TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
/* -*- c++ -*-
 *
 * SOCLIB_LGPL_HEADER_BEGIN
 * 
 * This file is part of SoCLib, GNU LGPLv2.1.
 * 
 * SoCLib is free software; you can redistribute it and/or modify it
 * under the terms of the GNU Lesser General Public License as published
 * by the Free Software Foundation; version 2.1 of the License.
 * 
 * SoCLib is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 * 
 * You should have received a copy of the GNU Lesser General Public
 * License along with SoCLib; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA
 * 02110-1301 USA
 * 
 * SOCLIB_LGPL_HEADER_END
 * 
 * TMS320C6X Instruction Set Simulator for the TMS320C6X processor core
 * developed for the SocLib Projet
 * 
 * Copyright (C) IRISA/INRIA, 2008
 *         Francois Charot <charot@irisa.fr>
 *
 * 
 * Maintainer: charot
 *
 * Functional description:
 * The following files: 
 * 				tms320c62.h
 *              tms320c62.cpp
 *              tms320c62_instructions.cpp
 *              tms320c62_decoding.cpp
 *
 * define the Instruction Set Simulator for the TMS320C62 processor.
 *
 * 
 */

#include "tms320c62.h"

#define SIGN_EXTEND(src,width)   (((src) << (32-width)) >> (32-width))
#define SIGN_EXTEND_LONG(src,width) (((src) << (64-width)) >> (64-width))

#ifndef INT64_MAX
#define INT64_MAX ((0xffffffff < 7) | 0x7f)  // ways to enforce 40-bit long constants
#endif
#ifndef INT64_MIN
#define INT64_MIN (-(0x80000000 << 8))
#endif

namespace soclib {
namespace common {

uint32_t clearbit[32] = { 0xfffffffe, 0xfffffffd, 0xfffffffb, 0xfffffff7,
		0xffffffef, 0xffffffdf, 0xffffffbf, 0xffffff7f, 0xfffffeff, 0xfffffdff,
		0xfffffbff, 0xfffff7ff, 0xffffefff, 0xffffdfff, 0xffffbfff, 0xffff7fff,
		0xfffeffff, 0xfffdffff, 0xfffbffff, 0xfff7ffff, 0xffefffff, 0xffdfffff,
		0xffbfffff, 0xff7fffff, 0xfeffffff, 0xfdffffff, 0xfbffffff, 0xf7ffffff,
		0xefffffff, 0xdfffffff, 0xbfffffff, 0x7fffffff };

uint32_t power2[32] = { 0x00000001, 0x00000002, 0x00000004, 0x00000008,
		0x00000010, 0x00000020, 0x00000040, 0x00000080, 0x00000100, 0x00000200,
		0x00000400, 0x00000800, 0x00001000, 0x00002000, 0x00004000, 0x00008000,
		0x00010000, 0x00020000, 0x00040000, 0x00080000, 0x00100000, 0x00200000,
		0x00400000, 0x00800000, 0x01000000, 0x02000000, 0x04000000, 0x08000000,
		0x10000000, 0x20000000, 0x40000000, 0x80000000 };

#define op(x) & Tms320C6xIss::op_##x
#define op4(x, y, z, t) op(x), op(y), op(z), op(t)
#define op2(x, y) op(x), op(y)

Tms320C6xIss::func_t const Tms320C6xIss::l_function_e1[] = { op4(illegal_l_e1, illegal_l_e1, add_l_02_e1, add_l_03_e1), 
      op4(illegal_l_e1, illegal_l_e1, sub_l_06_e1, sub_l_07_e1), 
      op4(illegal_l_e1, illegal_l_e1, illegal_l_e1, illegal_l_e1), 
      op4(illegal_l_e1, illegal_l_e1, ssub_l_0e_e1, ssub_l_0f_e1), 
      op4(illegal_l_e1, illegal_l_e1, sadd_l_12_e1, sadd_l_13_e1), 
      op4(illegal_l_e1, illegal_l_e1, illegal_l_e1, sub_l_17_e1), 
      op4(illegal_l_e1, illegal_l_e1, abs_l_1a_e1, illegal_l_e1), 
      op4(illegal_l_e1, illegal_l_e1, illegal_l_e1, ssub_l_1f_e1), 
      op4(add_l_20_e1,  add_l_21_e1,  illegal_l_e1, add_l_23_e1),

      op4(sub_l_24_e1,  illegal_l_e1, illegal_l_e1, sub_l_27_e1)		, 
      op4(illegal_l_e1, addu_l_29_e1, illegal_l_e1, addu_l_2b_e1), 
      op4(ssub_l_2c_e1, illegal_l_e1, illegal_l_e1, subu_l_2f_e1), 
      op4(sadd_l_30_e1, sadd_l_31_e1, illegal_l_e1, illegal_l_e1), 
      op4(illegal_l_e1, illegal_l_e1, illegal_l_e1, sub_l_37_e1), 
      op4(abs_l_38_e1, illegal_l_e1, illegal_l_e1, illegal_l_e1), 
      op4(illegal_l_e1, illegal_l_e1, illegal_l_e1, subu_l_3f_e1), 
      op4(sat_l_40_e1,  illegal_l_e1, illegal_l_e1, illegal_l_e1), 
      op4(cmpgt_l_44_e1,cmpgt_l_45_e1, cmpgt_l_46_e1, cmpgt_l_47_e1), 
      op4(illegal_l_e1, illegal_l_e1, illegal_l_e1, subc_l_4b_e1), 
      op4(cmpgtu_l_4c_e1, cmpgtu_l_4d_e1, cmpgtu_l_4e_e1, cmpgtu_l_4f_e1), 
      op4(cmpeq_l_50_e1, cmpeq_l_51_e1, cmpeq_l_52_e1, cmpeq_l_53_e1), 
      op4(cmplt_l_54_e1, cmplt_l_55_e1, cmplt_l_56_e1, cmplt_l_57_e1), 
      op4(illegal_l_e1, illegal_l_e1, illegal_l_e1, illegal_l_e1), 
      op4(cmpltu_l_5c_e1, cmpltu_l_5d_e1, cmpltu_l_5e_e1, cmpltu_l_5f_e1), 
      op4(norm_l_60_e1, illegal_l_e1, illegal_l_e1, norm_l_63_e1), 
      op4(illegal_l_e1, illegal_l_e1, illegal_l_e1, illegal_l_e1), 
      op4(illegal_l_e1, illegal_l_e1, lmbd_l_6a_e1, lmbd_l_6b_e1), 
      op4(illegal_l_e1, illegal_l_e1, xor_l_6e_e1, xor_l_6f_e1), 
      op4(illegal_l_e1, illegal_l_e1, illegal_l_e1, illegal_l_e1), 
      op4(illegal_l_e1, illegal_l_e1, illegal_l_e1, illegal_l_e1), 
      op4(illegal_l_e1, illegal_l_e1, and_l_7a_e1, and_l_7b_e1), 
      op4(illegal_l_e1, illegal_l_e1, or_l_7e_e1, or_l_7f_e1), };

		Tms320C6xIss::func_t const Tms320C6xIss::s_function_e1[] = {
			op4(illegal_s_e1, add2_s_01_e1, illegal_s_e1, b_s_03_e1),
			op4(illegal_s_e1, illegal_s_e1, add_s_06_e1, add_s_07_e1),
			op4(illegal_s_e1, illegal_s_e1, xor_s_0a_e1, xor_s_0b_e1),
			op4(illegal_s_e1, b_s_0d_e1, mvc_s_0e_e1, mvu_s_0f_e1),
			op4(illegal_s_e1, sub2_s_11_e1, shl_s_12_e1, shl_s_13_e1),
			op4(illegal_s_e1, illegal_s_e1, sub_s_16_e1, sub_s_17_e1),
			op4(illegal_s_e1, illegal_s_e1, or_s_1a_e1, or_s_1b_e1),
			op4(illegal_s_e1, illegal_s_e1, and_s_1e_e1, and_s_1f_e1),
			op4(illegal_s_e1, illegal_s_e1, sshl_s_22_e1, sshl_s_23_e1),
			op4(shru_s_24_e1, shru_s_25_e1, shru_s_26_e1, shru_s_27_e1),
			op4(illegal_s_e1, illegal_s_e1, illegal_s_e1, extu_s_2b_e1),
			op4(illegal_s_e1, illegal_s_e1, illegal_s_e1, ext_s_2f_e1),
			op4(shl_s_30_e1, shl_s_31_e1, shl_s_32_e1, shl_s_33_e1),
			op4(shr_s_34_e1, shr_s_35_e1, shr_s_36_e1, shr_s_37_e1),
			op4(illegal_s_e1, illegal_s_e1, illegal_s_e1, set_s_3b_e1),
			op4(illegal_s_e1, illegal_s_e1, illegal_s_e1, clr_s_3f_e1),};

		Tms320C6xIss::func_t const Tms320C6xIss::s_immed_function_e1[] = {
			op4(extu_s_immed_00_e1, ext_s_immed_01_e1, set_s_immed_02_e1,clr_s_immed_03_e1), };

    Tms320C6xIss::func_t const Tms320C6xIss::s_mvk_function_e1[] = {
      op2(mvk_s_mvk_00_e1, mvkh_s_mvk_01_e1), };

