TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
    Tms320C6xIss::func_t const Tms320C6xIss::s_addk_function_e1[] = {
      op(addk_s_addk_e1) };

    Tms320C6xIss::func_t const Tms320C6xIss::s_bcond_function_e1[] = {
      op(bcond_s_bcond_e1) };

    Tms320C6xIss::func_t const Tms320C6xIss::d_function_e1[] = {
      op4(illegal_d_e1, illegal_d_e1, illegal_d_e1, illegal_d_e1),
      op4(illegal_d_e1, illegal_d_e1, illegal_d_e1, illegal_d_e1),
      op4(illegal_d_e1, illegal_d_e1, illegal_d_e1, illegal_d_e1),
      op4(illegal_d_e1, illegal_d_e1, illegal_d_e1, illegal_d_e1),
      op4(add_d_10_e1, sub_d_11_e1, add_d_12_e1, sub_d_13_e1),
      op4(illegal_d_e1, illegal_d_e1, illegal_d_e1, illegal_d_e1),
      op4(illegal_d_e1, illegal_d_e1, illegal_d_e1, illegal_d_e1),
      op4(illegal_d_e1, illegal_d_e1, illegal_d_e1, illegal_d_e1),
      op4(illegal_d_e1, illegal_d_e1, illegal_d_e1, illegal_d_e1),
      op4(illegal_d_e1, illegal_d_e1, illegal_d_e1, illegal_d_e1),
      op4(illegal_d_e1, illegal_d_e1, illegal_d_e1, illegal_d_e1),
      op4(illegal_d_e1, illegal_d_e1, illegal_d_e1, illegal_d_e1),
      op4(addab_d_30_e1, subab_d_31_e1, addab_d_32_e1, subab_d_33_e1),
      op4(addah_d_34_e1, subah_d_35_e1, addah_d_36_e1, subah_d_37_e1),
      op4(addaw_d_38_e1, subaw_d_39_e1, addaw_d_3a_e1, subaw_d_3b_e1),
      op4(illegal_d_e1, illegal_d_e1, illegal_d_e1, illegal_d_e1), };

    Tms320C6xIss::func_t const Tms320C6xIss::d_ldstOffset_function_e1[] = {
      op4(ldhu_d_ldstOffset_00_e1, ldbu_d_ldstOffset_01_e1, ldb_d_ldstOffset_02_e1, stb_d_ldstOffset_03_e1),
      op4(ldh_d_ldstOffset_04_e1, sth_d_ldstOffset_05_e1, ldw_d_ldstOffset_06_e1, stw_d_ldstOffset_07_e1), };

    Tms320C6xIss::func_t const Tms320C6xIss::d_ldstBaseROffset_function_e1[] = {
      op4(ldhu_d_ldstBaseROffset_00_e1, ldbu_d_ldstBaseROffset_01_e1, ldb_d_ldstBaseROffset_02_e1, stb_d_ldstBaseROffset_03_e1),
      op4(ldh_d_ldstBaseROffset_04_e1, sth_d_ldstBaseROffset_05_e1, ldw_d_ldstBaseROffset_06_e1, stw_d_ldstBaseROffset_07_e1), };
 
    Tms320C6xIss::func_t const Tms320C6xIss::d_ldstOffset_function_e2[] = {
      op4(ldhu_d_ldstOffset_00_e2, ldbu_d_ldstOffset_01_e2, ldb_d_ldstOffset_02_e2, stb_d_ldstOffset_03_e2),
      op4(ldh_d_ldstOffset_04_e2, sth_d_ldstOffset_05_e2, ldw_d_ldstOffset_06_e2, stw_d_ldstOffset_07_e2), };

    Tms320C6xIss::func_t const Tms320C6xIss::d_ldstBaseROffset_function_e2[] = {
      op4(ldhu_d_ldstBaseROffset_00_e2, ldbu_d_ldstBaseROffset_01_e2, ldb_d_ldstBaseROffset_02_e2, stb_d_ldstBaseROffset_03_e2),
      op4(ldh_d_ldstBaseROffset_04_e2, sth_d_ldstBaseROffset_05_e2, ldw_d_ldstBaseROffset_06_e2, stw_d_ldstBaseROffset_07_e2), };

    Tms320C6xIss::func_t const Tms320C6xIss::d_ldstOffset_function_e3[] = {
      op4(ldhu_d_ldstOffset_00_e3, ldbu_d_ldstOffset_01_e3, ldb_d_ldstOffset_02_e3, stb_d_ldstOffset_03_e3),
      op4(ldh_d_ldstOffset_04_e3, sth_d_ldstOffset_05_e3, ldw_d_ldstOffset_06_e3, stw_d_ldstOffset_07_e3), };

    Tms320C6xIss::func_t const Tms320C6xIss::d_ldstBaseROffset_function_e3[] = {
      op4(ldhu_d_ldstBaseROffset_00_e3, ldbu_d_ldstBaseROffset_01_e3, ldb_d_ldstBaseROffset_02_e3, stb_d_ldstBaseROffset_03_e3),
      op4(ldh_d_ldstBaseROffset_04_e3, sth_d_ldstBaseROffset_05_e3, ldw_d_ldstBaseROffset_06_e3, stw_d_ldstBaseROffset_07_e3), };

    Tms320C6xIss::func_t const Tms320C6xIss::d_ldstOffset_function_e4[] = {
      op4(ldhu_d_ldstOffset_00_e4, ldbu_d_ldstOffset_01_e4, ldb_d_ldstOffset_02_e4, stb_d_ldstOffset_03_e4),
      op4(ldh_d_ldstOffset_04_e4, sth_d_ldstOffset_05_e4, ldw_d_ldstOffset_06_e4, stw_d_ldstOffset_07_e4), };

    Tms320C6xIss::func_t const Tms320C6xIss::d_ldstBaseROffset_function_e4[] = {
      op4(ldhu_d_ldstBaseROffset_00_e4, ldbu_d_ldstBaseROffset_01_e4, ldb_d_ldstBaseROffset_02_e4, stb_d_ldstBaseROffset_03_e4),
      op4(ldh_d_ldstBaseROffset_04_e4, sth_d_ldstBaseROffset_05_e4, ldw_d_ldstBaseROffset_06_e4, stw_d_ldstBaseROffset_07_e4), };

     Tms320C6xIss::func_t const Tms320C6xIss::d_ldstOffset_function_e5[] = {
      op4(ldhu_d_ldstOffset_00_e5, ldbu_d_ldstOffset_01_e5, ldb_d_ldstOffset_02_e5, nothing_to_be_done),
      op4(ldh_d_ldstOffset_04_e5, nothing_to_be_done, ldw_d_ldstOffset_06_e5, nothing_to_be_done), };

    Tms320C6xIss::func_t const Tms320C6xIss::d_ldstBaseROffset_function_e5[] = {
      op4(ldhu_d_ldstBaseROffset_00_e5, ldbu_d_ldstBaseROffset_01_e5, ldb_d_ldstBaseROffset_02_e5, nothing_to_be_done),
      op4(ldh_d_ldstBaseROffset_04_e5, nothing_to_be_done, ldw_d_ldstBaseROffset_06_e5, nothing_to_be_done), };

    Tms320C6xIss::func_t const Tms320C6xIss::m_function_e1[] = {
      op4(illegal_m_e1, mpyh_m_01_e1, smpyh_m_02_e1, mpyhsu_m_03_e1),
      op4(illegal_m_e1, mpyhus_m_05_e1, illegal_m_e1, mpyhu_m_07_e1),
      op4(illegal_m_e1, mpyhl_m_09_e1, smpyhl_m_0a_e1, mpyhslu_m_0b_e1),
      op4(illegal_m_e1, mpyhuls_m_0d_e1, illegal_m_e1, mpyhlu_m_0f_e1),
      op4(illegal_m_e1, mpylh_m_11_e1, smpylh_m_12_e1, mpylshu_m_13_e1),
      op4(illegal_m_e1, mpyluhs_m_15_e1, illegal_m_e1, mpylhu_m_17_e1),
      op4(mpy_m_18_e1, mpy_m_19_e1, smpy_m_1a_e1, mpysu_m_1b_e1),
      op4(illegal_m_e1, mpyus_m_1d_e1, mpysu_m_1e_e1, mpyu_m_1f_e1), };

   Tms320C6xIss::func_t const Tms320C6xIss::m_function_e2[] = {
      op4(illegal_m_e2, mpyh_m_01_e2, smpyh_m_02_e2, mpyhsu_m_03_e2),
      op4(illegal_m_e2, mpyhus_m_05_e2, illegal_m_e2, mpyhu_m_07_e2),
      op4(illegal_m_e2, mpyhl_m_09_e2, smpyhl_m_0a_e2, mpyhslu_m_0b_e2),
      op4(illegal_m_e2, mpyhuls_m_0d_e2, illegal_m_e2, mpyhlu_m_0f_e2),
      op4(illegal_m_e2, mpylh_m_11_e2, smpylh_m_12_e2, mpylshu_m_13_e2),
      op4(illegal_m_e2, mpyluhs_m_15_e2, illegal_m_e2, mpylhu_m_17_e2),
      op4(mpy_m_18_e2,  mpy_m_19_e2, smpy_m_1a_e2, mpysu_m_1b_e2),
      op4(illegal_m_e2, mpyus_m_1d_e2, mpysu_m_1e_e2, mpyu_m_1f_e2), };

#undef op
#define op(x) #x

    const char *Tms320C6xIss::name_l_function_e1[] = {
      op4(illegal_l_e1, illegal_l_e1, add_l_02_e1, add_l_03_e1),
      op4(illegal_l_e1, illegal_l_e1, sub_l_06_e1, sub_l_07_e1),
      op4(illegal_l_e1, illegal_l_e1, illegal_l_e1, illegal_l_e1),
      op4(illegal_l_e1, illegal_l_e1, ssub_l_0e_e1, ssub_l_0f_e1),
      op4(illegal_l_e1, illegal_l_e1, sadd_l_12_e1, sadd_l_13_e1),
      op4(illegal_l_e1, illegal_l_e1, illegal_l_e1, sub_l_17_e1),
      op4(illegal_l_e1, illegal_l_e1, abs_l_1a_e1, illegal_l_e1),
      op4(illegal_l_e1, illegal_l_e1, illegal_l_e1, ssub_l_1f_e1),
      op4(add_l_20_e1,  add_l_21_e1,  illegal_l_e1, add_l_23_e1),
      op4(sub_l_24_e1,  illegal_l_e1, illegal_l_e1, sub_l_27_e1),
      op4(illegal_l_e1, addu_l_29_e1, illegal_l_e1, addu_l_2b_e1),
      op4(ssub_l_2c_e1, illegal_l_e1, illegal_l_e1, subu_l_2f_e1),
      op4(sadd_l_30_e1, sadd_l_31_e1, illegal_l_e1, illegal_l_e1),
      op4(illegal_l_e1, illegal_l_e1, illegal_l_e1, sub_l_37_e1),
      op4(abs_l_38_e1, illegal_l_e1, illegal_l_e1, illegal_l_e1),
      op4(illegal_l_e1, illegal_l_e1, illegal_l_e1, subu_l_3f_e1),
      op4(sat_l_40_e1,  illegal_l_e1, illegal_l_e1, illegal_l_e1),
      op4(cmpgt_l_44_e1,cmpgt_l_45_e1, cmpgt_l_46_e1, cmpgt_l_47_e1),
      op4(illegal_l_e1, illegal_l_e1, illegal_l_e1, subc_l_4b_e1),
      op4(cmpgtu_l_4c_e1, cmpgtu_l_4d_e1, cmpgtu_l_4e_e1, cmpgtu_l_4f_e1),
      op4(cmpeq_l_50_e1, cmpeq_l_51_e1, cmpeq_l_52_e1, cmpeq_l_53_e1),
      op4(cmplt_l_54_e1, cmplt_l_55_e1, cmplt_l_56_e1, cmplt_l_57_e1),
      op4(illegal_l_e1, illegal_l_e1, illegal_l_e1, illegal_l_e1),
      op4(cmpltu_l_5c_e1, cmpltu_l_5d_e1, cmpltu_l_5e_e1, cmpltu_l_5f_e1),
      op4(norm_l_60_e1, illegal_l_e1, illegal_l_e1, norm_l_63_e1),
      op4(illegal_l_e1, illegal_l_e1, illegal_l_e1, illegal_l_e1),
      op4(illegal_l_e1, illegal_l_e1, lmbd_l_6a_e1, lmbd_l_6b_e1),
      op4(illegal_l_e1, illegal_l_e1, xor_l_6e_e1, xor_l_6f_e1),
      op4(illegal_l_e1, illegal_l_e1, illegal_l_e1, illegal_l_e1),
      op4(illegal_l_e1, illegal_l_e1, illegal_l_e1, illegal_l_e1),
      op4(illegal_l_e1, illegal_l_e1, and_l_7a_e1, and_l_7b_e1),
      op4(illegal_l_e1, illegal_l_e1, or_l_7e_e1, or_l_7f_e1), };

    const char *Tms320C6xIss::name_s_function_e1[] = {
      op4(illegal_s_e1, add2_s_01, illegal_s_e1, b_s_03_e1),
      op4(illegal_s_e1, illegal_s_e1, add_s_06_e1, add_s_07_e1),
      op4(illegal_s_e1, illegal_s_e1, xor_s_0a_e1, xor_s_0b_e1),
      op4(illegal_s_e1, b_s_0d_e1, mvc_s_0e_e1, mvu_s_0f_e1),
      op4(illegal_s_e1, sub2_s_11_e1, shl_s_1_e12_e1, shl_s_13_e1),
      op4(illegal_s_e1, illegal_s_e1, sub_s_16_e1, sub_s_17_e1),
      op4(illegal_s_e1, illegal_s_e1, or_s_1a_e1, or_s_1b_e1),
      op4(illegal_s_e1, illegal_s_e1, and_s_1e_e1, and_s_1f_e1),
      op4(illegal_s_e1, illegal_s_e1, sshl_s_22_e1, sshl_s_23_e1),
      op4(shru_s_24_e1, shru_s_25_e1, shru_s_26_e1, shru_s_27_e1),
      op4(illegal_s_e1, illegal_s_e1, illegal_s_e1, extu_s_2b_e1),
      op4(illegal_s_e1, illegal_s_e1, illegal_s_e1, ext_s_2f_e1),
      op4(shl_s_30_e1, shl_s_31_e1, shl_s_32_e1, shl_s_33_e1),
      op4(shr_s_34_e1, shr_s_35_e1, shr_s_36_e1, shr_s_37_e1),
      op4(illegal_s_e1, illegal_s_e1, illegal_s_e1, set_s_3b_e1),
      op4(illegal_s_e1, illegal_s_e1, illegal_s_e1, clr_s_3f_e1), };

    const char *Tms320C6xIss::name_s_immed_function_e1[] = {
      op4(extu_s_immed_00_e1, ext_s_immed_01_e1, set_s_immed_02_e1, clr_s_immed_03_e1), };

