TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
    const char *Tms320C6xIss::name_s_mvk_function_e1[] = {
      op2(mvk_s_mvk_00_e1, mvkh_s_mvk_01_e1), };

    const char *Tms320C6xIss::name_s_addk_function_e1[] = {
      op(addk_s_addk) };

    const char *Tms320C6xIss::name_s_bcond_function_e1[] = {
      op(bcond_s_bcond) };

    const char *Tms320C6xIss::name_d_function_e1[] = {
      op4(illegal_d_e1, illegal_d_e1, illegal_d_e1, illegal_d_e1),
      op4(illegal_d_e1, illegal_d_e1, illegal_d_e1, illegal_d_e1),
      op4(illegal_d_e1, illegal_d_e1, illegal_d_e1, illegal_d_e1),
      op4(illegal_d_e1, illegal_d_e1, illegal_d_e1, illegal_d_e1),
      op4(add_d_10_e1, sub_d_11_e1, add_d_12_e1, sub_d_13_e1),
      op4(illegal_d_e1, illegal_d_e1, illegal_d_e1, illegal_d_e1),
      op4(illegal_d_e1, illegal_d_e1, illegal_d_e1, illegal_d_e1),
      op4(illegal_d_e1, illegal_d_e1, illegal_d_e1, illegal_d_e1),
      op4(illegal_d_e1, illegal_d_e1, illegal_d_e1, illegal_d_e1),
      op4(illegal_d_e1, illegal_d_e1, illegal_d_e1, illegal_d_e1),
      op4(illegal_d_e1, illegal_d_e1, illegal_d_e1, illegal_d_e1),
      op4(illegal_d_e1, illegal_d_e1, illegal_d_e1, illegal_d_e1),
      op4(addab_d_30_e1, subab_d_31_e1, addab_d_32_e1, subab_d_33_e1),
      op4(addah_d_34_e1, subah_d_35_e1, addah_d_36_e1, subah_d_37_e1),
      op4(addaw_d_38_e1, subaw_d_39_e1, addaw_d_3a_e1, subaw_d_3b_e1),
      op4(illegal_d_e1, illegal_d_e1, illegal_d_e1, illegal_d_e1), };

    const char  *Tms320C6xIss::name_d_ldstOffset_function_e1[] = {
      op4(ldhu_d_ldstOffset_00_e1, ldbu_d_ldstOffset_01_e1, ldb_d_ldstOffset_02_e1, stb_d_ldstOffset_03_e1),
      op4(ldh_d_ldstOffset_04_e1, sth_d_ldstOffset_05_e1, ldw_d_ldstOffset_06_e1, stw_d_ldstOffset_07_e1), };

    const char *Tms320C6xIss::name_d_ldstBaseROffset_function_e1[] = {
      op4(ldhu_d_ldstBaseROffset_00_e1, ldbu_d_ldstBaseROffset_01_e1, ldb_d_ldstBaseROffset_02_e1, stb_d_ldstBaseROffset_03_e1),
      op4(ldh_d_ldstBaseROffset_04_e1, sth_dldstBaseROffset__05_e1, ldw_d_ldstBaseROffset_06_e1, stw_d_ldstBaseROffset_07_e1), };

    const char  *Tms320C6xIss::name_d_ldstOffset_function_e2[] = {
      op4(ldhu_d_ldstOffset_00_e2, ldbu_d_ldstOffset_01_e2, ldb_d_ldstOffset_02_e2, stb_d_ldstOffset_03_e2),
      op4(ldh_d_ldstOffset_04_e2, sth_d_ldstOffset_05_e2, ldw_d_ldstOffset_06_e2, stw_d_ldstOffset_07_e2), };

    const char *Tms320C6xIss::name_d_ldstBaseROffset_function_e2[] = {
      op4(ldhu_d_ldstBaseROffset_00_e2, ldbu_d_ldstBaseROffset_01_e2, ldb_d_ldstBaseROffset_02_e2, stb_d_ldstBaseROffset_03_e2),
      op4(ldh_d_ldstBaseROffset_04_e2, sth_dldstBaseROffset__05_e2, ldw_d_ldstBaseROffset_06_e2, stw_d_ldstBaseROffset_07_e2), };

    const char  *Tms320C6xIss::name_d_ldstOffset_function_e3[] = {
      op4(ldhu_d_ldstOffset_00_e3, ldbu_d_ldstOffset_01_e3, ldb_d_ldstOffset_02_e3, stb_d_ldstOffset_03_e3),
      op4(ldh_d_ldstOffset_04_e3, sth_d_ldstOffset_05_e3, ldw_d_ldstOffset_06_e3, stw_d_ldstOffset_07_e3), };

    const char *Tms320C6xIss::name_d_ldstBaseROffset_function_e3[] = {
      op4(ldhu_d_ldstBaseROffset_00_e3, ldbu_d_ldstBaseROffset_01_e3, ldb_d_ldstBaseROffset_02_e3, stb_d_ldstBaseROffset_03_e3),
      op4(ldh_d_ldstBaseROffset_04_e3, sth_dldstBaseROffset__05_e3, ldw_d_ldstBaseROffset_06_e3, stw_d_ldstBaseROffset_07_e3), };

    const char  *Tms320C6xIss::name_d_ldstOffset_function_e4[] = {
      op4(ldhu_d_ldstOffset_00_e4, ldbu_d_ldstOffset_01_e4, ldb_d_ldstOffset_02_e4, stb_d_ldstOffset_03_e4),
      op4(ldh_d_ldstOffset_04_e4, sth_d_ldstOffset_05_e4, ldw_d_ldstOffset_06_e4, stw_d_ldstOffset_07_e4), };

    const char *Tms320C6xIss::name_d_ldstBaseROffset_function_e4[] = {
      op4(ldhu_d_ldstBaseROffset_00_e4, ldbu_d_ldstBaseROffset_01_e4, ldb_d_ldstBaseROffset_02_e4, stb_d_ldstBaseROffset_03_e4),
      op4(ldh_d_ldstBaseROffset_04_e4, sth_dldstBaseROffset__05_e4, ldw_d_ldstBaseROffset_06_e4, stw_d_ldstBaseROffset_07_e4), };

    const char  *Tms320C6xIss::name_d_ldstOffset_function_e5[] = {
      op4(ldhu_d_ldstOffset_00_e5, ldbu_d_ldstOffset_01_e5, ldb_d_ldstOffset_02_e5, nothing_to_be_done),
      op4(ldh_d_ldstOffset_04_e5, nothing_to_be_done, ldw_d_ldstOffset_06_e5, nothing_to_be_done), };

    const char *Tms320C6xIss::name_d_ldstBaseROffset_function_e5[] = {
      op4(ldhu_d_ldstBaseROffset_00_e5, ldbu_d_ldstBaseROffset_01_e5, ldb_d_ldstBaseROffset_02_e5, nothing_to_be_done),
      op4(ldh_d_ldstBaseROffset_04_e5, nothing_to_be_done, ldw_d_ldstBaseROffset_06_e5, nothing_to_be_done), };

    const char *Tms320C6xIss::name_m_function_e1[] = {
      op4(illegal_m_e1, mpyh_m_01_e1, smpyh_m_02_e1, mpyhsu_m_03_e1),
      op4(illegal_m_e1, mpyhus_m_05_e1, illegal_m_e1, mpyhu_m_07_e1),
      op4(illegal_m_e1, mpyhl_m_09_e1, smpyhl_m_0a_e1, mpyhslu_m_0b_e1),
      op4(illegal_m_e1, mpyhuls_m_0d_e1, illegal_m_e1, mpyhlu_m_0f_e1),
      op4(illegal_m_e1, mpylh_m_11_e1, smpylh_m_12_e1, mpylshu_m_13_e1),
      op4(illegal_m_e1, mpyluhs_m_15_e1, illegal_m_e1, mpylhu_m_17_e1),
      op4(mpy_m_18_e1, mpy_m_19_e1, smpy_m_1a_e1, mpysu_m_1b_e1),
      op4(illegal_m_e1, mpyus_m_1d_e1, mpysu_m_1e_e1, mpyu_m_1f_e1), };

    const char *Tms320C6xIss::name_m_function_e2[] = {
      op4(illegal_m_e1, mpyh_m_01_e1, smpyh_m_02_e1, mpyhsu_m_03_e1),
      op4(illegal_m_e1, mpyhus_m_05_e1, illegal_m_e1, mpyhu_m_07_e1),
      op4(illegal_m_e1, mpyhl_m_09_e1, smpyhl_m_0a_e1, mpyhslu_m_0b_e1),
      op4(illegal_m_e1, mpyhuls_m_0d_e1, illegal_m_e1, mpyhlu_m_0f_e1),
      op4(illegal_m_e1, mpylh_m_11_e1, smpylh_m_12_e1, mpylshu_m_13_e1),
      op4(illegal_m_e1, mpyluhs_m_15_e1, illegal_m_e1, mpylhu_m_17_e1),
      op4(mpy_m_18_e1, mpy_m_19_e1, smpy_m_1a_e1, mpysu_m_1b_e1),
      op4(illegal_m_e1, mpyus_m_1d_e1, mpysu_m_1e_e1, mpyu_m_1f_e1), };
#undef op
#undef op4
#undef op2


    void  Tms320C6xIss::run()
    {

      
#if TMS320C62_DEBUG
      std::cout << " start runnning cycle ...." << std::endl;
      switch ((processor_state_fsm) m_run_state) {
	
      case idle_state:
	std::cout << "state: idle" << std::endl;
	break;
	
