TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
      case usual_state:
	std::cout << "state: usual" << std::endl;
	break;

      case two_datamemory_ldst_state:
	std::cout << "state: two load/store memory instructions" << std::endl;
	std::cout <<  "e5_phase_stalled:  "<< e5_phase_stalled 
		  <<  " e4_phase_stalled:  "<< e4_phase_stalled 
		  <<  " e3_phase_stalled:  "<< e3_phase_stalled << std::endl;
	break;

      case two_datamemory_ldst_bis_state:
	std::cout << "state: two load/store memory instructions (bis)" << std::endl;
	std::cout <<  "e5_phase_stalled:  "<< e5_phase_stalled 
		  <<  " e4_phase_stalled:  "<< e4_phase_stalled 
		  <<  " e3_phase_stalled:  "<< e3_phase_stalled << std::endl;
	break;

      case flush_pipeline_state:
	std::cout << "state: flush_pipeline_state" << std::endl;
	std::cout <<  "e5_phase_stalled:  "<< e5_phase_stalled 
		  <<  " e4_phase_stalled:  "<< e4_phase_stalled << std::endl;
	break;

      }
#endif

      switch ((processor_state_fsm) m_run_state) {

      case idle_state:
	break;

      case usual_state:
	break;

      case two_datamemory_ldst_state:

	// instruction with 2 load/store encountered in e1_pipeline_phase
	// we switch to the two_datamemory_ldst_bis_state state  in order to add an
	// extra cycle in the pipeline - this extra cycle is used to able the two load/store to be performed
	if (multiple_loadstore_instructions) {
	  m_run_state = two_datamemory_ldst_bis_state;
	  multiple_loadstore_instructions = false;
	  cycle_to_flush_pipeline = 5;

#if TMS320C62_DEBUG
	  std::cout << " register update is postponed " << std::endl;
#endif
	  registerUpdatePostponed = true;
	}

#if TMS320C62_DEBUG
	std::cout << "cycle_to_flush_pipeline:" << cycle_to_flush_pipeline << std::endl;	  
#endif
	
	break;

      case two_datamemory_ldst_bis_state:

	cycle_to_flush_pipeline = cycle_to_flush_pipeline - 1;

	if (end_of_loop) {
	  m_run_state = flush_pipeline_state;
	  end_of_loop = false;
	} 
	else 
	  m_run_state = two_datamemory_ldst_state;

#if TMS320C62_DEBUG
	if (tworeadinst_in_packet)
	  std::cout << " two read instruction in packet " << std::endl;
#endif
 	if (cycle_to_flush_pipeline == 4 && tworeadinst_in_packet)  {
	  registerUpdatePostponed = true;
#if TMS320C62_DEBUG
	  std::cout << " register update is postponed " << std::endl;
#endif
	}
#if TMS320C62_DEBUG
	std::cout << "cycle_to_flush_pipeline:" << cycle_to_flush_pipeline << std::endl;	  
#endif
	if (cycle_to_flush_pipeline == 0)
	  registerUpdatePostponed = false;
	
	break;

      case flush_pipeline_state:

	cycle_to_flush_pipeline = cycle_to_flush_pipeline - 1;

#if TMS320C62_DEBUG
	std::cout << "cycle_to_flush_pipeline:" << cycle_to_flush_pipeline << std::endl;	  
#endif
	if (cycle_to_flush_pipeline == 4) {
	  e5_phase_stalled = true; 
	  e4_phase_stalled = false;
	  e3_phase_stalled = false;
	}
	else if (cycle_to_flush_pipeline == 3) {
	  e5_phase_stalled = false;
	  e4_phase_stalled = true;
	  e3_phase_stalled = false;
	} 
	else if (cycle_to_flush_pipeline == 2) {
	  m_run_state = two_datamemory_ldst_state;
	  registerUpdatePostponed = false;
	  e5_phase_stalled = false;
	  e4_phase_stalled = false;
	  e3_phase_stalled = false;
	}
#if TMS320C62_DEBUG
	std::cout << "cycle_to_flush_pipeline:" << cycle_to_flush_pipeline << std::endl;	  
#endif
	if (cycle_to_flush_pipeline == 0)
	  registerUpdatePostponed = false;
	
	break;
      }
	
 
#if TMS320C62_DEBUG
      switch ((processor_state_fsm) m_run_state) {
	
      case idle_state:
	std::cout << "state: idle" << std::endl;
	break;
	
      case usual_state:
	std::cout << "state: usual" << std::endl;
	break;

      case two_datamemory_ldst_state:
	std::cout << "state: two load/store memory instructions" << std::endl;
	std::cout <<  "e5_phase_stalled:  "<< e5_phase_stalled 
		  <<  " e4_phase_stalled:  "<< e4_phase_stalled 
		  <<  " e3_phase_stalled:  "<< e3_phase_stalled << std::endl;
	break;

      case two_datamemory_ldst_bis_state:
	std::cout << "state: two load/store memory instructions (bis)" << std::endl;
	std::cout <<  "e5_phase_stalled:  "<< e5_phase_stalled 
		  <<  " e4_phase_stalled:  "<< e4_phase_stalled 
		  <<  " e3_phase_stalled:  "<< e3_phase_stalled << std::endl;
	break;

      case flush_pipeline_state:
	std::cout << "state: flush_pipeline_state" << std::endl;
	std::cout <<  "e5_phase_stalled:  "<< e5_phase_stalled 
		  <<  " e4_phase_stalled:  "<< e4_phase_stalled << std::endl;
	break;

      }
#endif

      switch ((processor_state_fsm) m_run_state) {

      case idle_state:
	break;

      case usual_state:
	// usual_state suppose that the data memory allows two Load/store to be performed simultaneously
	Tms320C6xIss::tempRegisterFileUpdate();
	state.PGPS.setStall(state.PGPS.isNextCycleStall());
	state.PSPW.setStall(state.PSPW.isNextCycleStall());
	state.PWPR.setStall(state.PWPR.isNextCycleStall());
	state.PRDP.setStall(state.PRDP.isNextCycleStall());
	state.PGPS.setNextCycleStall(false);
	state.PSPW.setNextCycleStall(false);
	state.PWPR.setNextCycleStall(false);
	state.PRDP.setNextCycleStall(false);
	// we go backwards in the pipeline execution
	Tms320C6xIss::e5_pipeline_phase(); 
	Tms320C6xIss::e4_pipeline_phase();
	Tms320C6xIss::e3_pipeline_phase(); 
	Tms320C6xIss::e2_pipeline_phase();
	Tms320C6xIss::e1_pipeline_phase();
	// decode stage decomposed into 2 phases
	Tms320C6xIss::dc_pipeline_phase();
	Tms320C6xIss::dp_pipeline_phase();
	//fetch stage decomposed into 4 phases
	Tms320C6xIss::pr_pipeline_phase();
	Tms320C6xIss::pw_pipeline_phase();
	Tms320C6xIss::ps_pipeline_phase();
	Tms320C6xIss::pg_pipeline_phase();
	Tms320C6xIss::registerFileUpdate();
	break;

      case two_datamemory_ldst_state:
	// the execution packet contains one data memory store and one data memory load
	// they have to be performed sequentially 
	Tms320C6xIss::tempRegisterFileUpdate();
	state.PGPS.setStall(state.PGPS.isNextCycleStall());
	state.PSPW.setStall(state.PSPW.isNextCycleStall());
	state.PWPR.setStall(state.PWPR.isNextCycleStall());
	state.PRDP.setStall(state.PRDP.isNextCycleStall());
	state.PGPS.setNextCycleStall(false);
	state.PSPW.setNextCycleStall(false);
	state.PWPR.setNextCycleStall(false);
	state.PRDP.setNextCycleStall(false);
	// we go backwards in the pipeline execution
	// execute stage decomposed into 5 phases
	if (!e5_phase_stalled)  
	  Tms320C6xIss::e5_pipeline_phase(); 
 	else e5_phase_stalled = false;
	// cette ligne qui bloque si decommenté	if (!e4_phase_stalled)  
	Tms320C6xIss::e4_pipeline_phase();
	if (!e3_phase_stalled) 
	  Tms320C6xIss::e3_pipeline_phase(); 
	else  { 
	  e3_phase_stalled = false;
	  e4_phase_stalled = true;
	}
	Tms320C6xIss::e2_pipeline_phase();
	Tms320C6xIss::e1_pipeline_phase();
	if (cycle_to_flush_pipeline > 0 && !m_list_reg.empty())
	  Tms320C6xIss::writeRegister();
	// decode stage decomposed into 2 phases
	Tms320C6xIss::dc_pipeline_phase();
	Tms320C6xIss::dp_pipeline_phase();
	//fetch stage decomposed into 4 phases
	Tms320C6xIss::pr_pipeline_phase();
	Tms320C6xIss::pw_pipeline_phase();
	Tms320C6xIss::ps_pipeline_phase();
	Tms320C6xIss::pg_pipeline_phase();
	Tms320C6xIss::registerFileUpdate();
	break;
       
	case two_datamemory_ldst_bis_state:
	  // when there are one store and one load in a execution packet
	  // this state alternate with state two_datamemory_ldst_state
	  Tms320C6xIss::tempRegisterFileUpdate();
	  Tms320C6xIss::e5bis_pipeline_phase();
	  if (!e4_phase_stalled)  
	    Tms320C6xIss::e4bis_pipeline_phase(); 
	  else { 
	    e4_phase_stalled = false;
	    e5_phase_stalled = true;	  
	  }
	  Tms320C6xIss::e3bis_pipeline_phase();
	  Tms320C6xIss::e2bis_pipeline_phase();
	  break;


      case flush_pipeline_state:
	// the execution packet contains one data memory store and one data memory load
	// they have to be performed sequentially 
	Tms320C6xIss::tempRegisterFileUpdate();
	state.PGPS.setStall(state.PGPS.isNextCycleStall());
	state.PSPW.setStall(state.PSPW.isNextCycleStall());
	state.PWPR.setStall(state.PWPR.isNextCycleStall());
	state.PRDP.setStall(state.PRDP.isNextCycleStall());
	state.PGPS.setNextCycleStall(false);
	state.PSPW.setNextCycleStall(false);
	state.PWPR.setNextCycleStall(false);
	state.PRDP.setNextCycleStall(false);
	// we go backwards in the pipeline execution
	// execute stage decomposed into 5 phases
	if (!e5_phase_stalled)  
	  Tms320C6xIss::e5bis_pipeline_phase(); 
	if (!e4_phase_stalled) 
	  Tms320C6xIss::e4_pipeline_phase();
	Tms320C6xIss::e3_pipeline_phase(); 

	Tms320C6xIss::e2_pipeline_phase();
	Tms320C6xIss::e1_pipeline_phase();
	if (cycle_to_flush_pipeline > 0 && !m_list_reg.empty())
	  Tms320C6xIss::writeRegister();
	// decode stage decomposed into 2 phases
	Tms320C6xIss::dc_pipeline_phase();
	Tms320C6xIss::dp_pipeline_phase();
	//fetch stage decomposed into 4 phases
	Tms320C6xIss::pr_pipeline_phase();
	Tms320C6xIss::pw_pipeline_phase();
	Tms320C6xIss::ps_pipeline_phase();
	Tms320C6xIss::pg_pipeline_phase();
	Tms320C6xIss::registerFileUpdate();
	break;
       
