TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
     }

#if TMS320C62_DEBUG
      std::cout
	<< m_name << std::hex
	<< " PC: " << r_pc << " branchAddress: " <<m_branchAddress << " branchTaken: " << m_branchTaken 
	<< std::endl
	<< " exceptionSignal: " << std::hex << m_exceptionSignal
	<< std::endl << std::endl << std::dec;
       Tms320C6xIss::dumpRegisterFile();
#endif 

    }

    inline bool Tms320C6xIss::isConditionalInstruction(InstructionState instruction) {
      bool execute = false;
      if ((instruction.ins.common.creg == 0 && instruction.ins.common.z == 0) || 
	  (instruction.ins.common.creg == CREG_B0 && (instruction.ins.common.z == 1) && state.regfile[sideB][0] == 0) ||
	  (instruction.ins.common.creg == CREG_B0 && (instruction.ins.common.z == 0) && state.regfile[sideB][0] != 0) ||
	  (instruction.ins.common.creg == CREG_B1 && (instruction.ins.common.z == 1) && state.regfile[sideB][1] == 0) ||
	  (instruction.ins.common.creg == CREG_B1 && (instruction.ins.common.z == 0) && state.regfile[sideB][1] != 0) ||
	  (instruction.ins.common.creg == CREG_B2 && (instruction.ins.common.z == 1) && state.regfile[sideB][2] == 0) ||
	  (instruction.ins.common.creg == CREG_B2 && (instruction.ins.common.z == 0) && state.regfile[sideB][2] != 0) ||
	  (instruction.ins.common.creg == CREG_A1 && (instruction.ins.common.z == 1) && state.regfile[sideA][1] == 0) ||
	  (instruction.ins.common.creg == CREG_A1 && (instruction.ins.common.z == 0) && state.regfile[sideA][1] != 0) ||
	  (instruction.ins.common.creg == CREG_A2 && (instruction.ins.common.z == 1) && state.regfile[sideA][2] == 0) ||
	  (instruction.ins.common.creg == CREG_A2 && (instruction.ins.common.z == 0) && state.regfile[sideA][2] != 0)  )
	execute = true;
      return execute;
    }
	

    void Tms320C6xIss::pg_pipeline_phase() {
      // first phase of the fetch stage
      // the program address is generated in the CPU
      bool readyToExecute;
      uint32_t new_pc;

      readyToExecute = (state.PG.isBranchFlag() || !state.PGPS.isStall()) ? true : false;
      if (readyToExecute) {
	new_pc = state.PG.isBranchFlag() ? state.PG.getBranchAddress() : state.PG.getPC() + FETCH_SIZE;
	state.PGPS.setPC(new_pc);
	state.PGPS.setBranchFlag(state.PG.isBranchFlag());
	
	state.PG.setPC(new_pc & FETCH_MASK);
	state.PG.setBranchFlag(false);

#if TMS320C62_DEBUG
	std::cout << "  PG PC=" << std::hex << state.PGPS.getPC() << " JumptoPC " << 
	  state.PG.getBranchAddress() << std::dec << " " << 
	  state.PGPS.isBranchFlag() << " " << state.PGPS.isStall() << " "<< state.PGPS.isNextCycleStall() <<
	  std::dec << std::endl;
#endif
      }
      else { // !readyToExecute
	state.PGPS.setBranchFlag(false);	
#if TMS320C62_DEBUG
	std::cout << "  PG PC=" << std::hex << state.PGPS.getPC() << " JumptoPC " << 
	  state.PG.getBranchAddress() << std::dec <<" " << 
	  state.PGPS.isBranchFlag() << " " << state.PGPS.isStall() << " " << state.PGPS.isNextCycleStall() << " stall" <<
	  std::dec << std::endl;
#endif
      }
    }

    void Tms320C6xIss::ps_pipeline_phase() {
      // second phase of the fetch stage
      // the program address is sent to memory
      bool readyToExecute;
 
      readyToExecute = (state.PGPS.isBranchFlag() || !state.PSPW.isStall()) ? true : false;
      if (readyToExecute) {
	state.PSPW.setPC(state.PGPS.getPC()) ;
	state.PSPW.setBranchFlag(state.PGPS.isBranchFlag());

	state.PGPS.setNextCycleStall(state.PSPW.isNextCycleStall());
	state.PGPS.setStall(false);

#if TMS320C62_DEBUG
	std::cout << "  PS PC=" << std::hex << state.PSPW.getPC() << std::dec << " " <<
	  state.PSPW.isBranchFlag() << " " << state.PSPW.isStall() << " " << state.PSPW.isNextCycleStall() <<
	  std::dec << std::endl;
#endif
      }
      else { // !readyToExecute
	state.PGPS.setNextCycleStall(state.PSPW.isNextCycleStall());
#if TMS320C62_DEBUG
	std::cout << "  PS PC=" << std::hex << state.PSPW.getPC() << std::dec << " " <<
	  state.PSPW.isBranchFlag() << " " << state.PSPW.isStall() << " " << state.PSPW.isNextCycleStall() << " stall" <<
	  std::dec << std::endl;
#endif
      }
    }

    void Tms320C6xIss::pw_pipeline_phase() {
      // third phase of the fetch stage
      // a program memory access is performed
      bool readyToExecute;
      InstructionState *inst  = new InstructionState();
     
      readyToExecute = (state.PSPW.isBranchFlag() || !state.PWPR.isStall()) ? true : false;
      if (readyToExecute) {
	state.PWPR.setPC(state.PSPW.getPC()) ;
	state.PWPR.setBranchFlag(state.PSPW.isBranchFlag());
	for (int i = 0; i < FETCH_PACKET_SIZE; i++) {
	  inst->setInstruction(m_instruction[i]);	  
	  state.PWPR.setInstInPack(*inst,i);
	}
	state.PSPW.setNextCycleStall(state.PWPR.isNextCycleStall());
	state.PSPW.setStall(false);

#if TMS320C62_DEBUG
	std::cout << "  PW PC=" << std::hex << state.PSPW.getPC() << std::dec << " " <<
	  state.PSPW.isBranchFlag() << " " << state.PWPR.isStall() << " " << state.PWPR.isNextCycleStall() << " ";
	std::cout << std::hex << "               ";
	for (int i = 0; i < FETCH_PACKET_SIZE; i++) {
	  inst =  state.PWPR.getInst(i);	  
	  std::cout << inst->getInstruction().ins << "  "; 
	}
	std::cout << std::dec << std::endl;
#endif
      }
      else { // !readyToExecute
	state.PSPW.setNextCycleStall(state.PWPR.isNextCycleStall());
#if TMS320C62_DEBUG
	std::cout << "  PW PC=" << std::hex << state.PSPW.getPC() << std::dec << " " <<
	  state.PSPW.isBranchFlag() << " " << state.PWPR.isStall() << " " << state.PWPR.isNextCycleStall() << " stall" << 
	  std::dec << std::endl;
#endif
      }      
    }

    void Tms320C6xIss::pr_pipeline_phase() {
      // forth phase of the fetch stage
      // the fetch packet is received
      bool readyToExecute;

      readyToExecute = (state.PWPR.isBranchFlag() || !state.PRDP.isStall()) ? true : false;
      if (readyToExecute) {
	state.PRDP.setPC(state.PWPR.getPC()) ;
	state.PRDP.setBranchFlag(state.PWPR.isBranchFlag());
	state.PRDP.setInstPack(state.PWPR.getInstPack());
	
	state.PWPR.setNextCycleStall(state.PRDP.isNextCycleStall());
	state.PWPR.setStall(false);

#if TMS320C62_DEBUG
	InstructionState *inst  = new InstructionState();
	std::cout << "  PR PC=" << std::hex << state.PRDP.getPC() << std::dec << " " <<
	  state.PRDP.isBranchFlag() << " " << state.PRDP.isStall() << " " << state.PRDP.isNextCycleStall() << " ";
	std::cout << std::hex << "               ";
	for (int i = 0; i < FETCH_PACKET_SIZE; i++) {
	  inst = state.PRDP.getInst(i);	  
	  std::cout << inst->getInstruction().ins << "  "; 
	}
	std::cout << std::dec << std::endl;
#endif
      }
      else { // !readyToExecute
	state.PWPR.setNextCycleStall(state.PRDP.isNextCycleStall());
#if TMS320C62_DEBUG
	std::cout << "  PR PC=" << std::hex << state.PWPR.getPC() << std::dec << " " <<
	  state.PWPR.isBranchFlag() << " " << state.PRDP.isStall() << " " << state.PRDP.isNextCycleStall() << " ";
	std::cout << std::dec << std::endl;
#endif
      }      
    }

    void Tms320C6xIss::dp_pipeline_phase() {
      // first phase of the decode stage
      // the fetch packets are split into execute packets. An execute packet consists of one instruction or from two to eight
      // parallel instructions
      uint32_t count = 0, count1 = 0, start, end;
      bool multinop_flag = false;

      if (state.DP.getInstLeft() == 0 || state.PRDP.isBranchFlag() ) {

	state.DP.setPC(state.PRDP.getPC());
	state.DP.setBranchFlag(state.PRDP.isBranchFlag());
	state.PRDP.setStall(false);
	state.DP.setInstPack(state.PRDP.getInstPack());

	//take care of branch in a fetch packet
	state.DP.setInstLeft(FETCH_PACKET_SIZE - ((state.DP.getPC() - (state.DP.getPC() & FETCH_MASK)) >> 2));
      }
      
