TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
      // break into execution packets and dispatch
      state.DPDC.setPC((state.DP.getPC() & FETCH_MASK) + ((FETCH_PACKET_SIZE - state.DP.getInstLeft()) << 2));
      start = FETCH_PACKET_SIZE - state.DP.getInstLeft();
      for (count = FETCH_PACKET_SIZE - state.DP.getInstLeft(), count1 = 0; count < FETCH_PACKET_SIZE; count++, count1++) {
	
	InstructionState *instState = state.DP.getInst(count);

	if (instState->ins.nop.unit == 0x00 && instState->ins.nop.src > 0) {
	  multinop_flag = true;
	}

	state.DPDC.setInstInPack(*instState, count1);
	state.DP.setInstLeft(state.DP.getInstLeft()-1);

	// break if  next instruction is not parallel to this one
	if (!instState->isParallelInstruction(*instState))
	  break;
      }

      // fill with NOP the rest of the instruction
      InstructionState *instState = new InstructionState();
      instState->setIns(NOP1);	
      for (count = count1 + 1; count < FETCH_PACKET_SIZE; count ++) {
	state.DPDC.setInstInPack(*instState, count);
      }

      // multicycle NOP management
      if (multinop_flag) {
	end = start + count1;
	for (count = start; count <= end; count ++) {
	  InstructionState *instState = state.DP.getInst(count);
	  if (instState->ins.nop.unit == 0x00 && instState->ins.nop.src > 0){
	    instState->ins.nop.src--;
	  }
	  else if (instState->isParallelInstruction(*instState))
	    instState->setIns(NOP1_PARALLEL); 
	  else
	    instState->setIns(NOP1);
	  state.DP.setInstInPack(*instState, count);
	}

	state.DP.setInstLeft(FETCH_PACKET_SIZE - start);
      }

      // stall signal is set if necessary
      if (state.DP.getInstLeft() != 0)
	state.PRDP.setNextCycleStall(true);

#if TMS320C62_DEBUG
      std::cout << "  DP PC=" << std::hex << state.DP.getPC() << std::dec << " " <<
	state.DP.isBranchFlag() << " " << "     instLeft: " << state.DP.getInstLeft() ;
      std::cout << std::hex << "   ";
      for (int i = 0; i < FETCH_PACKET_SIZE; i++) {
	InstructionState *instState = state.DP.getInst(i);	  
	std::cout << instState->getInstruction().ins << "  "; 
      }
      std::cout << std::dec << std::endl;
#endif      
    }
    

    void Tms320C6xIss::dc_pipeline_phase() {
      // second phase of the decode stage
      // instructions are decoded in the functional units
      
      state.DCE1.setPC(state.DPDC.getPC());
      state.DCE1.setInstPack(state.DPDC.getInstPack());
      state.DCE1.initState();

#if TMS320C62_DEBUG
      std::cout << "  DC PC=" << std::hex << state.DPDC.getPC() ;
      std::cout << std::hex << "                      ";
      for (int i = 0; i < FETCH_PACKET_SIZE; i++) {
	InstructionState *inst;
	inst = state.DCE1.getInst(i);

	if (inst->getInstruction().ins != 0)
	  std::cout << inst->getInstruction().ins << "  "; 
      }
      std::cout << std::dec << std::endl;
#endif    
    }

    
    // first phase of the execute stage
    void Tms320C6xIss::e1_pipeline_phase() {
      bool execute = false;
      uint32_t ldst_instructions = 0;
      uint32_t ldst_really_executed = 0;

      state.E1E2.setPC(state.DCE1.getPC());
      state.E1E2.setInstPack(state.DCE1.getInstPack());

#if TMS320C62_DEBUG
      std::cout << "  E1 PC=" << std::hex << state.DCE1.getPC() << "   ";
      for (int i = 0; i < FETCH_PACKET_SIZE; i++) {
	InstructionState *inst;
	inst = state.E1E2.getInst(i);
	if (inst->getInstruction().ins != 0)
	  std::cout << inst->getInstruction().ins << "   ";
      }
      std::cout << std::dec << std::endl;
#endif     

      for (int i = 0; i < FETCH_PACKET_SIZE; i++) {
	InstructionState * instState = (state.E1E2.getInst(i));
	
	// number of load store instruction in this packet ?
	if (instState->ins.d_ldstOffset.unit == DUNIT_LDSTOFFSET || 
	    instState->ins.d_ldstBaseROffset.unit == DUNIT_LDSTBASEROFFSET) {
	  switch (ldst_instructions) {
	  case 0:
	    instState->setFirstLoadStore(true);
	    instState->setSecondLoadStore(false);
	    instState->setLoadStorePosition(0);	    
	    break;
	  case 1:
	    instState->setFirstLoadStore(false);
	    instState->setSecondLoadStore(true);
	    instState->setLoadStorePosition(1);	    
	    break;
	  default:
	    instState->setFirstLoadStore(false);
	    instState->setSecondLoadStore(false);
	    break;
	  }
	ldst_instructions++;
	}  
      }
      state.E1E2.setLoadStoreNumber(ldst_instructions);

      for (int i = 0; i < FETCH_PACKET_SIZE; i++) {

	// execute instruction one after another
	InstructionState * instState = (state.E1E2.getInst(i));
       
	// is it a NOP instruction
	if (instState->ins.nop.unit == 0x00 && instState->ins.nop.src == 0)
	  continue;
	
	// check condition in creg field
	if (isConditionalInstruction(*instState))
	  execute = true;
	else execute = false;
	instState->setExecute(execute);

#if TMS320C62_DEBUG
	Tms320C6xIss::instruction_print(instState->ins.ins); 
#endif
	// if execute condition failed, skip the current instruction
	if (!instState->isExecute())
	  continue;

	// instruction execution
	if (instState->ins.nop.unit == 0 ) {
#if TMS320C62_DEBUG
	  std::cout << " NOP encountered  " << std::endl;
#endif
	}
	else if (instState->ins.idle.unit == 0x7800 ) {
#if TMS320C62_DEBUG
	  std::cout << " IDLE encountered  " << std::endl;
#endif
	}
	else if (instState->ins.l.unit == LUNIT) {
	  func_t func = l_function_e1[instState->ins.l.op];	
	  (this->*func)(instState);
#if TMS320C62_DEBUG
	  std::cout << " execute " << name_l_function_e1[instState->ins.l.op] << std::endl;
#endif	
	}
	else if (instState->ins.s.unit == SUNIT) {
	  func_t func = s_function_e1[instState->ins.s.op];
#if TMS320C62_DEBUG
	  std::cout << " execute " << name_s_function_e1[instState->ins.s.op] << std::endl;
#endif	
	  (this->*func)(instState);
	}
	else if (instState->ins.s_addk.unit == SUNIT_ADDK) {
	  func_t func = s_addk_function_e1[0];
#if TMS320C62_DEBUG
	  std::cout << " execute " << name_s_addk_function_e1[0] << std::endl;
#endif	
	  (this->*func)(instState);
	}
	else if (instState->ins.s_bcond.unit == SUNIT_BCOND) {
	  func_t func = s_bcond_function_e1[0];
#if TMS320C62_DEBUG
	  std::cout << " execute " << name_s_bcond_function_e1[0] << std::endl;
#endif	
	  (this->*func)(instState);
	}
	else if (instState->ins.s_immed.unit == SUNIT_IMMED) {
	  func_t func = s_immed_function_e1[instState->ins.s_immed.op];
 #if TMS320C62_DEBUG
	  std::cout << " execute " <<  name_s_immed_function_e1[instState->ins.s_immed.op] << std::endl;
#endif	
	  (this->*func)(instState);
	}
	else if (instState->ins.s_mvk.unit == SUNIT_MVK) {
	  func_t func = s_mvk_function_e1[instState->ins.s_mvk.op];
#if TMS320C62_DEBUG
	  std::cout << " execute " << name_s_mvk_function_e1[instState->ins.s_mvk.op] << std::endl;
#endif	
	  (this->*func)(instState);
	}
	else if (instState->ins.m.unit == MUNIT) {
	  func_t func = m_function_e1[instState->ins.m.op];
#if TMS320C62_DEBUG
	  std::cout << " execute " << name_m_function_e1[instState->ins.m.op] << std::endl;
#endif	
	  (this->*func)(instState);
	}
	else if (instState->ins.d.unit == DUNIT) {
	  func_t func = d_function_e1[instState->ins.d.op];
#if TMS320C62_DEBUG
	  std::cout << " execute " << name_d_function_e1[instState->ins.d.op] << std::endl;
#endif	
	  (this->*func)(instState);
	}
	else if (instState->ins.d_ldstOffset.unit == DUNIT_LDSTOFFSET) {
	    func_t func = d_ldstOffset_function_e1[instState->ins.d_ldstOffset.op];
#if TMS320C62_DEBUG
	    std::cout << " execute " << name_d_ldstOffset_function_e1[instState->ins.d_ldstOffset.op] << std::endl;
#endif	
	    (this->*func)(instState);
#if TMS320C62_DEBUG
	    std::cout << std::endl;
	    instState->print();
#endif	
	    ldst_really_executed++;
	}
	else if (instState->ins.d_ldstBaseROffset.unit == DUNIT_LDSTBASEROFFSET) {
	    func_t func = d_ldstBaseROffset_function_e1[instState->ins.d_ldstBaseROffset.op];
#if TMS320C62_DEBUG
	    std::cout << " execute " << name_d_ldstBaseROffset_function_e1[instState->ins.d_ldstBaseROffset.op] << std::endl;
#endif	
	    (this->*func)(instState);
#if TMS320C62_DEBUG
	    std::cout << std::endl;
	    instState->print();
#endif	
	    ldst_really_executed++;
 	}
	else
	  std::cout << "Warning: unknown instruction in E1 pipeline phase @ " << m_exec_cycles <<  " cycle, instruction is " 
		    << std::hex << instState->ins.ins
		    << " PC is " << state.E1E2.getPC() << std::dec << std::endl;
      }
#if TMS320C62_DEBUG
      if (ldst_instructions > 1)
	std::cout << ldst_instructions << " load/store instructions encountered " << std::endl;
#endif
      tworeadinst_in_packet = false;
      int nbread = 0;
      for (int i = 0; i < FETCH_PACKET_SIZE; i++) {
	InstructionState * instState = (state.E1E2.getInst(i));
	if (instState->isReadInstInPacketExecute()) nbread++;
      }      
      if (nbread > 1) {
	tworeadinst_in_packet = true;
#if TMS320C62_DEBUG
	  std::cout << " two read instruction in packet " << std::endl;	
#endif
      }

