TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
      twowriteinst_in_packet = false;
      int nbwrite = 0;
      for (int i = 0; i < FETCH_PACKET_SIZE; i++) {
	InstructionState * instState = (state.E1E2.getInst(i));
	if (instState->isWriteInstInPacketExecute()) nbwrite++;
      }      
      if (nbwrite > 1) {
	twowriteinst_in_packet = true;
#if TMS320C62_DEBUG
	  std::cout << " two write instruction in packet " << std::endl;	
#endif
       }
      if (ldst_instructions > 1) {
	multiple_loadstore_instructions = true;
	if (ldst_really_executed == 1)
	  end_of_loop = true;
      }
    }


    // second phase of the execute stage
    void Tms320C6xIss::e2_pipeline_phase() {

      state.E2E3.setPC(state.E1E2.getPC());
      state.E2E3.setInstPack(state.E1E2.getInstPack());
      state.E2E3.setLoadStoreNumber(state.E1E2.getLoadStoreNumber());

#if TMS320C62_DEBUG
      std::cout << "  E2 PC=" << std::hex << state.E1E2.getPC() << "   ";
      for (int i = 0; i < FETCH_PACKET_SIZE; i++) {
	InstructionState *inst;
	inst = state.E2E3.getInst(i);	  
	if (inst->getInstruction().ins != 0)
	  std::cout << inst->getInstruction().ins << "  ";
      }

      std::cout << std::dec << std::endl;
#endif      

      for (int i = 0; i < FETCH_PACKET_SIZE; i++) {

	// execute instruction one after another
	InstructionState * instState = (state.E2E3.getInst(i));

#if TMS320C62_DEBUG
	//	instState->print();
#endif

	// instruction execution
	if (instState->ins.nop.unit == 0)
	  continue;

	if (!instState->isExecute())
	  continue;

#if TMS320C62_DEBUG
	if(instState->ins.m.unit == MUNIT 
	   || instState->ins.d_ldstOffset.unit == DUNIT_LDSTOFFSET 
	   || instState->ins.d_ldstBaseROffset.unit == DUNIT_LDSTBASEROFFSET)
	   Tms320C6xIss::instruction_print(instState->ins.ins); 
#endif

	if (instState->ins.m.unit == MUNIT) {
	  func_t func = m_function_e2[instState->ins.m.op];
#if TMS320C62_DEBUG
	  std::cout << " execute " << name_m_function_e2[instState->ins.m.op] << std::endl;
#endif	
	  (this->*func)(instState);
	}
	else if (instState->ins.d_ldstOffset.unit == DUNIT_LDSTOFFSET) {
	  switch (state.E2E3.getLoadStoreNumber()) {
	  case 1:
	    {
	      // we only have one read/write operation in this packet
	      func_t func = d_ldstOffset_function_e2[instState->ins.d_ldstOffset.op];
#if TMS320C62_DEBUG
	      std::cout << " execute " << name_d_ldstOffset_function_e2[instState->ins.d_ldstOffset.op] << std::endl;
#endif	
	      (this->*func)(instState);
	    }   
	    break;
	  case 2:
	    {
	      // we have two read/write operations in this packet
	      // second read is treated	    
	      if (instState->isSecondLoadStore()) {
		func_t func = d_ldstOffset_function_e2[instState->ins.d_ldstOffset.op];
#if TMS320C62_DEBUG
		std::cout << std::endl;
		instState->print();
		std::cout << " execute " << name_d_ldstOffset_function_e2[instState->ins.d_ldstOffset.op] << std::endl;
#endif	
		(this->*func)(instState);
	      }
	      else {
#if TMS320C62_DEBUG
		std::cout << std::endl;
#endif
	      }
	      ;
	    }
	    break;
	  }
	}
	else if (instState->ins.d_ldstBaseROffset.unit == DUNIT_LDSTBASEROFFSET) {
	  switch (state.E2E3.getLoadStoreNumber()) {
	  case 1:
	    {
	      // we only have one read/write operation in this packet
	      func_t func = d_ldstBaseROffset_function_e2[instState->ins.d_ldstBaseROffset.op];
#if TMS320C62_DEBUG
	      std::cout << " execute " << name_d_ldstBaseROffset_function_e2[instState->ins.d_ldstBaseROffset.op] << std::endl;
#endif	
	      (this->*func)(instState);
	    }
	    break;
	  case 2:
	    {
	      // we have two read/write operations in this packet
	      // second read is treated	    
	      if (instState->isSecondLoadStore()) {	    
		func_t func = d_ldstBaseROffset_function_e2[instState->ins.d_ldstBaseROffset.op];
#if TMS320C62_DEBUG
		std::cout << std::endl;
		instState->print();
		std::cout << " execute " << name_d_ldstBaseROffset_function_e2[instState->ins.d_ldstBaseROffset.op] << std::endl;
#endif	
		(this->*func)(instState);
	      }
	      else {
#if TMS320C62_DEBUG
		std::cout << std::endl;
#endif
	      }
	      ;
	    }
	    break;
	  }
	}
      }
    }

    // second phase of the execute stage
    // executed again in case of several load/store instruction in the same execute packet
    void Tms320C6xIss::e2bis_pipeline_phase() {

      state.E2E3.setPC(state.E1E2.getPC());
      state.E2E3.setInstPack(state.E1E2.getInstPack());
      state.E2E3.setLoadStoreNumber(state.E1E2.getLoadStoreNumber());

#if TMS320C62_DEBUG
      std::cout << "  E2bis PC=" << std::hex << state.E1E2.getPC() << "   ";
      for (int i = 0; i < FETCH_PACKET_SIZE; i++) {
	InstructionState *inst;
	inst = state.E2E3.getInst(i);	  
	if (inst->getInstruction().ins != 0)
	  std::cout << inst->getInstruction().ins << "  ";
      }

      std::cout << std::dec << std::endl;
#endif      
   
      for (int i = 0; i < FETCH_PACKET_SIZE; i++) {

	// execute instruction one after another
	InstructionState * instState = (state.E2E3.getInst(i));

	// instruction execution
	if (instState->ins.nop.unit == 0) {
	  continue;
	}
	if (!instState->isExecute())
	  continue;

#if TMS320C62_DEBUG
	if(instState->ins.d_ldstOffset.unit == DUNIT_LDSTOFFSET 
	   || instState->ins.d_ldstBaseROffset.unit == DUNIT_LDSTBASEROFFSET)
	   Tms320C6xIss::instruction_print(instState->ins.ins); 
#endif

	if (instState->ins.d_ldstOffset.unit == DUNIT_LDSTOFFSET) {
	  if (instState->isFirstLoadStore()) {
	    func_t func = d_ldstOffset_function_e2[instState->ins.d_ldstOffset.op];
#if TMS320C62_DEBUG
	    std::cout << std::endl;
	    instState->print();
	    std::cout << " execute " << name_d_ldstOffset_function_e2[instState->ins.d_ldstOffset.op] << std::endl;
#endif	
	    (this->*func)(instState);
	    e3_phase_stalled = true; 
	  }
	  else {
#if TMS320C62_DEBUG
	    std::cout << std::endl;
#endif
	  }
	  ;
	}
	else if (instState->ins.d_ldstBaseROffset.unit == DUNIT_LDSTBASEROFFSET) {
	  if (instState->isFirstLoadStore()) {
	    func_t func = d_ldstBaseROffset_function_e2[instState->ins.d_ldstBaseROffset.op];
#if TMS320C62_DEBUG
	    std::cout <<  std::endl;
	    instState->print();
	    std::cout << " execute " << name_d_ldstBaseROffset_function_e2[instState->ins.d_ldstBaseROffset.op] << std::endl;
#endif	
	    (this->*func)(instState);
	    e3_phase_stalled = true; 
	  }
	  else {
#if TMS320C62_DEBUG
	    std::cout << std::endl;
#endif
	  }
	  ;
	}
      }
    }

    // third phase of the execute stage
    void Tms320C6xIss::e3_pipeline_phase() {

      state.E3E4.setPC(state.E2E3.getPC());
      state.E3E4.setInstPack(state.E2E3.getInstPack());
      state.E3E4.setLoadStoreNumber(state.E2E3.getLoadStoreNumber());

#if TMS320C62_DEBUG
      std::cout << "  E3 PC=" << std::hex << state.E2E3.getPC() << "   ";
      for (int i = 0; i < FETCH_PACKET_SIZE; i++) {
	InstructionState *inst;
	inst = state.E3E4.getInst(i);	  
	if (inst->getInstruction().ins != 0)
	  std::cout << inst->getInstruction().ins << "  "; 
      }
      std::cout << std::dec << std::endl;
#endif      

