TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
      for (int i = 0; i < FETCH_PACKET_SIZE; i++) {

	// execute instruction one after another
	InstructionState * instState = (state.E3E4.getInst(i));

#if TMS320C62_DEBUG
	//	instState->print();
#endif
	// instruction execution
	if (instState->ins.nop.unit == 0 )
	  continue;
 
	if (!instState->isExecute())
	  continue;

#if TMS320C62_DEBUG
	Tms320C6xIss::instruction_print_ld(instState->ins.ins); 
	Tms320C6xIss::instruction_print_st(instState->ins.ins);
#endif

	if (instState->ins.d_ldstOffset.unit == DUNIT_LDSTOFFSET) {	  
	  switch (state.E3E4.getLoadStoreNumber()) {
	  case 1:
	    {
	      func_t func = d_ldstOffset_function_e3[instState->ins.d_ldstOffset.op];
#if TMS320C62_DEBUG
	      std::cout << " execute " << name_d_ldstOffset_function_e3[instState->ins.d_ldstOffset.op] << std::endl;
#endif	
	      (this->*func)(instState);
	    }   
	    break;
	  case 2:
	    {
	      if (instState->isFirstLoadStore()) {	    
		func_t func = d_ldstOffset_function_e3[instState->ins.d_ldstOffset.op];
#if TMS320C62_DEBUG
		std::cout << " execute " << name_d_ldstOffset_function_e3[instState->ins.d_ldstOffset.op] << std::endl;
#endif	
		(this->*func)(instState);
	      }
	      else {
#if TMS320C62_DEBUG
		std::cout << std::endl;
#endif
	      }
	      ;
	    }
	    break;
	  }
	}
	else if (instState->ins.d_ldstBaseROffset.unit == DUNIT_LDSTBASEROFFSET) {
	  switch (state.E2E3.getLoadStoreNumber()) {
	  case 1:
	    {   
	      func_t func = d_ldstBaseROffset_function_e3[instState->ins.d_ldstBaseROffset.op];
#if TMS320C62_DEBUG
	      std::cout << " execute " << name_d_ldstBaseROffset_function_e3[instState->ins.d_ldstBaseROffset.op] << std::endl;
#endif	
	      (this->*func)(instState);
	    }
	    break;
	  case 2:
	    {
	      if (instState->isFirstLoadStore()) {	    
		func_t func = d_ldstBaseROffset_function_e3[instState->ins.d_ldstBaseROffset.op];
#if TMS320C62_DEBUG
		std::cout << " execute " << name_d_ldstBaseROffset_function_e3[instState->ins.d_ldstBaseROffset.op] << std::endl;
#endif	
		(this->*func)(instState);
	      }
	      else {
#if TMS320C62_DEBUG
		std::cout << std::endl;
#endif
	      }
	      ;
	    }
	    break;
	  }
	}
      }
    }
    
    
    // third phase of the execute stage
    void Tms320C6xIss::e3bis_pipeline_phase() {

      state.E3E4.setPC(state.E2E3.getPC());
      state.E3E4.setInstPack(state.E2E3.getInstPack());
      state.E3E4.setLoadStoreNumber(state.E2E3.getLoadStoreNumber());

#if TMS320C62_DEBUG
      std::cout << "  E3bis PC=" << std::hex << state.E2E3.getPC() << "   ";
      for (int i = 0; i < FETCH_PACKET_SIZE; i++) {
	InstructionState *inst;
	inst = state.E3E4.getInst(i);	  
	if (inst->getInstruction().ins != 0)
	  std::cout << inst->getInstruction().ins << "  "; 
      }
      std::cout << std::dec << std::endl;
#endif      

      for (int i = 0; i < FETCH_PACKET_SIZE; i++) {

	// execute instruction one after another
	InstructionState * instState = (state.E3E4.getInst(i));

#if TMS320C62_DEBUG
	//	instState->print();
#endif
	// instruction execution
	if (instState->ins.nop.unit == 0 )
	  continue;
 
	if (!instState->isExecute())
	  continue;

#if TMS320C62_DEBUG
	Tms320C6xIss::instruction_print_ld(instState->ins.ins); 
	Tms320C6xIss::instruction_print_st(instState->ins.ins);
#endif

	if (instState->ins.d_ldstOffset.unit == DUNIT_LDSTOFFSET) {	  
	  switch (state.E3E4.getLoadStoreNumber()) {
	  case 1:
	    {
	      func_t func = d_ldstOffset_function_e3[instState->ins.d_ldstOffset.op];
#if TMS320C62_DEBUG
	      std::cout << " execute " << name_d_ldstOffset_function_e3[instState->ins.d_ldstOffset.op] << std::endl;
#endif	
	      (this->*func)(instState);
	    }
	    break;
	  case 2:
	    {	    
	      if (instState->isSecondLoadStore()) {	    
		func_t func = d_ldstOffset_function_e3[instState->ins.d_ldstOffset.op];
#if TMS320C62_DEBUG
		std::cout << " execute " << name_d_ldstOffset_function_e3[instState->ins.d_ldstOffset.op] << std::endl;
#endif	
		(this->*func)(instState);
	      }
	      else {
#if TMS320C62_DEBUG
		std::cout << std::endl;
#endif
	      }
	      ;
	    }
	    break;
	  }
	}
	else if (instState->ins.d_ldstBaseROffset.unit == DUNIT_LDSTBASEROFFSET) {
	  switch (state.E2E3.getLoadStoreNumber()) {
	  case 1:
	    {
	      func_t func = d_ldstBaseROffset_function_e3[instState->ins.d_ldstBaseROffset.op];
#if TMS320C62_DEBUG
	      std::cout << " execute " << name_d_ldstBaseROffset_function_e3[instState->ins.d_ldstBaseROffset.op] << std::endl;
#endif	
	      (this->*func)(instState);
	    }
	    break;
	  case 2:
	    {
	      if (instState->isSecondLoadStore()) {	    
		func_t func = d_ldstBaseROffset_function_e3[instState->ins.d_ldstBaseROffset.op];
#if TMS320C62_DEBUG
		std::cout << " execute " << name_d_ldstBaseROffset_function_e3[instState->ins.d_ldstBaseROffset.op] << std::endl;
#endif	
		(this->*func)(instState);
	      }
	      else {
#if TMS320C62_DEBUG
		std::cout << std::endl;
#endif
	      }
	      ;
	    }
	    break;
	  }
	}
      }
    }
    
    
    void Tms320C6xIss::e4_pipeline_phase() {

      state.E4E5.setPC(state.E3E4.getPC());
      state.E4E5.setInstPack(state.E3E4.getInstPack());
      state.E4E5.setLoadStoreNumber(state.E3E4.getLoadStoreNumber());

#if TMS320C62_DEBUG
      std::cout << "  E4 PC=" << std::hex << state.E3E4.getPC() << "   ";
      for (int i = 0; i < FETCH_PACKET_SIZE; i++) {
	InstructionState *inst;
	inst = state.E4E5.getInst(i);	  
	if (inst->getInstruction().ins != 0)
	  std::cout << inst->getInstruction().ins << "  "; 
      }
      std::cout << std::dec << std::endl;
#endif  
      for (int i = 0; i < FETCH_PACKET_SIZE; i++) {

	// execute instruction one after another
	InstructionState * instState = (state.E4E5.getInst(i));

#if TMS320C62_DEBUG
	Tms320C6xIss::instruction_print_ld(instState->ins.ins); 
	Tms320C6xIss::instruction_print_st(instState->ins.ins);
#endif
#if TMS320C62_DEBUG
	//	instState->print();
#endif
	// instruction execution
	if (instState->ins.nop.unit == 0 )
	  continue;
 
	if (!instState->isExecute())
	  continue;

