TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
	if (instState->ins.d_ldstOffset.unit == DUNIT_LDSTOFFSET) {
	    func_t func = d_ldstOffset_function_e4[instState->ins.d_ldstOffset.op];
#if TMS320C62_DEBUG
	    std::cout << " execute " << name_d_ldstOffset_function_e4[instState->ins.d_ldstOffset.op] << std::endl;
#endif	
	    (this->*func)(instState);
	}
	else if (instState->ins.d_ldstBaseROffset.unit == DUNIT_LDSTBASEROFFSET) {
	    func_t func = d_ldstBaseROffset_function_e4[instState->ins.d_ldstBaseROffset.op];
#if TMS320C62_DEBUG
	    std::cout << " execute " << name_d_ldstBaseROffset_function_e4[instState->ins.d_ldstBaseROffset.op] << std::endl;
#endif	
	    (this->*func)(instState);
	}
      }
    }

    void Tms320C6xIss::e4bis_pipeline_phase() {

      state.E4E5.setPC(state.E3E4.getPC());
      state.E4E5.setInstPack(state.E3E4.getInstPack());
      state.E4E5.setLoadStoreNumber(state.E3E4.getLoadStoreNumber());
      
#if TMS320C62_DEBUG
      std::cout << "  E4bis PC=" << std::hex << state.E3E4.getPC() << "   ";
      for (int i = 0; i < FETCH_PACKET_SIZE; i++) {
	InstructionState *inst;
	inst = state.E4E5.getInst(i);	  
	if (inst->getInstruction().ins != 0)
	  std::cout << inst->getInstruction().ins << "  "; 
      }
      std::cout << std::dec << std::endl;
#endif  
      for (int i = 0; i < FETCH_PACKET_SIZE; i++) {

	// execute instruction one after another
	InstructionState * instState = (state.E4E5.getInst(i));

#if TMS320C62_DEBUG
	Tms320C6xIss::instruction_print_ld(instState->ins.ins); 
	Tms320C6xIss::instruction_print_st(instState->ins.ins);
#endif
#if TMS320C62_DEBUG
	//	instState->print();
#endif
	// instruction execution
	if (instState->ins.nop.unit == 0 )
	  continue;
 
	if (!instState->isExecute())
	  continue;

	if (instState->ins.d_ldstOffset.unit == DUNIT_LDSTOFFSET) {
	  if (state.E4E5.getLoadStoreNumber() == 1) {
	    func_t func = d_ldstOffset_function_e4[instState->ins.d_ldstOffset.op];
#if TMS320C62_DEBUG
	    std::cout << " execute " << name_d_ldstOffset_function_e4[instState->ins.d_ldstOffset.op] << std::endl;
#endif	
	    (this->*func)(instState);
	  }
	}
	else if (instState->ins.d_ldstBaseROffset.unit == DUNIT_LDSTBASEROFFSET) {
	  if (state.E4E5.getLoadStoreNumber() == 1) {
	    func_t func = d_ldstBaseROffset_function_e4[instState->ins.d_ldstBaseROffset.op];
#if TMS320C62_DEBUG
	    std::cout << " execute " << name_d_ldstBaseROffset_function_e4[instState->ins.d_ldstBaseROffset.op] << std::endl;
#endif	
	    (this->*func)(instState);
	  }
	}
      }
    }

    void Tms320C6xIss::e5_pipeline_phase() {

#if TMS320C62_DEBUG
      std::cout << "  E5 PC=" << std::hex << state.E4E5.getPC() << "   ";
      for (int i = 0; i < FETCH_PACKET_SIZE; i++) {
	InstructionState *inst;
	inst = state.E4E5.getInst(i);	  
	if (inst->getInstruction().ins != 0)
	  std::cout << inst->getInstruction().ins << "  "; 
      }
      std::cout << std::dec << std::endl;
#endif      

      for (int i = 0; i < FETCH_PACKET_SIZE; i++) {

	// execute instruction one after another
	InstructionState * instState = (state.E4E5.getInst(i));

	if (instState->ins.nop.unit == 0 )
	  continue;

#if TMS320C62_DEBUG
	Tms320C6xIss::instruction_print_ld(instState->ins.ins); 
#endif

	if (!instState->isExecute())
	  continue;
	 
	if (instState->ins.d_ldstOffset.unit == DUNIT_LDSTOFFSET) {
	  switch (state.E4E5.getLoadStoreNumber()) {
	  case 1:
	    {
	      func_t func = d_ldstOffset_function_e5[instState->ins.d_ldstOffset.op];
#if TMS320C62_DEBUG
	      instState->print();
	      std::cout << " execute " << name_d_ldstOffset_function_e5[instState->ins.d_ldstOffset.op] << std::endl;
#endif	
	      (this->*func)(instState);
	    }
	    break;
	  case 2:
#if TMS320C62_DEBUG
	    std::cout << std::endl;
#endif
	    break;
	  }
	}
	else if (instState->ins.d_ldstBaseROffset.unit == DUNIT_LDSTBASEROFFSET) {
	  switch (state.E4E5.getLoadStoreNumber()) {
	  case 1:
	    {
	      func_t func = d_ldstBaseROffset_function_e5[instState->ins.d_ldstBaseROffset.op];
#if TMS320C62_DEBUG
	      instState->print();
	      std::cout << " execute " << name_d_ldstBaseROffset_function_e5[instState->ins.d_ldstBaseROffset.op] << std::endl;
#endif	
	      (this->*func)(instState);
	    }
	    break;
	  case 2:
#if TMS320C62_DEBUG
	    std::cout << std::endl;
#endif
	    break;
	  }
	}
      }
    }
    
    void Tms320C6xIss::e5bis_pipeline_phase() {

#if TMS320C62_DEBUG
      std::cout << "  E5bis PC=" << std::hex << state.E4E5.getPC() << "   ";
      for (int i = 0; i < FETCH_PACKET_SIZE; i++) {
	InstructionState *inst;
	inst = state.E4E5.getInst(i);	  
	if (inst->getInstruction().ins != 0)
	  std::cout << inst->getInstruction().ins << "  "; 
      }
      std::cout << std::dec << std::endl;
#endif      

      for (int i = 0; i < FETCH_PACKET_SIZE; i++) {

	// execute instruction one after another
	InstructionState * instState = (state.E4E5.getInst(i));

	if (instState->ins.nop.unit == 0 )
	  continue;

#if TMS320C62_DEBUG
	Tms320C6xIss::instruction_print_ld(instState->ins.ins); 
#endif

	if (!instState->isExecute())
	  continue;
	 
	if (instState->ins.d_ldstOffset.unit == DUNIT_LDSTOFFSET) {
	  func_t func = d_ldstOffset_function_e5[instState->ins.d_ldstOffset.op];
#if TMS320C62_DEBUG
	  instState->print();
	  std::cout << " execute " << name_d_ldstOffset_function_e5[instState->ins.d_ldstOffset.op] << std::endl;
#endif	
	  (this->*func)(instState);
	}
	else if (instState->ins.d_ldstBaseROffset.unit == DUNIT_LDSTBASEROFFSET) {
	  func_t func = d_ldstBaseROffset_function_e5[instState->ins.d_ldstBaseROffset.op];
#if TMS320C62_DEBUG
	  instState->print();
	  std::cout << " execute " << name_d_ldstBaseROffset_function_e5[instState->ins.d_ldstBaseROffset.op] << std::endl;
#endif	
	  (this->*func)(instState);
	}
      }
    }
    
    void Tms320C6xIss::registerToBeUpdateLater(uint32_t bank, uint32_t reg, uint32_t value) {

      register_entry regentry;
#if TMS320C62_DEBUG
      std::cout << "register update postponed: " << "register: " << reg;
       if (!bank)
	 std::cout << " bank A" ;
       else std::cout << " bank B";
       std::cout << " (value: " << std::hex << value << ")" << std::dec << std::endl;
#endif
       regentry.bank = bank;
       regentry.reg = reg;
       regentry.value = value;
       m_list_reg.push_front(regentry);
       
#if TMS320C62_DEBUG
       std::cout << "m_list_reg contains " << m_list_reg.size() << " elements:"  << std::endl;
       for (std::list<register_entry>::iterator it = m_list_reg.begin(); it != m_list_reg.end(); ++it)
	 std::cout << "reg: " << (*it).reg << " bank: " << (*it).bank << " value: " << std::hex << (*it).value << std::dec << std::endl;
#endif
    }


    void Tms320C6xIss::writeRegister() {

      register_entry regentry = m_list_reg.back();
#if TMS320C62_DEBUG
       std::cout
	 << m_name << std::hex
	 << " value " << regentry.value << std::dec << " is written to ";
       if (!regentry.bank)
	 std::cout << " bank A" ;
       else std::cout << " bank B";
       std::cout << " register " << regentry.reg << std::endl;      
#endif
       state.regfile_temp[regentry.bank][regentry.reg] = regentry.value;
       m_list_reg.pop_back();
    }


    //
    // registerfile management
    //
void Tms320C6xIss::registerFileUpdate() {

      for (int bank = 0; bank <= 1; bank++)
	for (int i = 0; i < 16; i++)
	  state.regfile[bank][i] = state.regfile_temp[bank][i];
}

void Tms320C6xIss::tempRegisterFileUpdate() {

      for (int bank = 0; bank <= 1; bank++)
	for (int i = 0; i < 16; i++)
	  state.regfile_temp[bank][i] = state.regfile[bank][i];
}


	//
    //
    // .L unit Instruction set
    //
    //

    //
    // E1 phase
    //

    // ABS (.unit) src2 (xsint), dst (sint) -- .unit = .L1 or .L2 op field: 1A pipeline phase E1
    void Tms320C6xIss::op_abs_l_1a_e1(InstructionState * instState) {
      int32_t signedSrc2x, signedDst;
      signedSrc2x = (int32_t) state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      signedDst = abs(signedSrc2x);
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] = signedDst;
    }

