TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
    // ABS (.unit) src2 (slong), dst (slong) -- .unit = .L1 or .L2 op field: 1A pipeline phase E1
    void Tms320C6xIss::op_abs_l_38_e1(InstructionState * instState) {
      int64_t signedLongSrc2, signedLongDst;
      uint64_t tmplong;
      tmplong = ((uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2+1] & 0xff) << 32;
      tmplong = tmplong  | (uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2];
      signedLongSrc2 = SIGN_EXTEND_LONG((int64_t) tmplong, 40);
      if ( signedLongSrc2 < 0 ) {
	signedLongDst = - signedLongSrc2;
      } else {
	signedLongDst = signedLongSrc2;
      }
      // long result is written over 2 registers
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst+1] = signedLongDst >> 32 & 0x000000ff;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] = signedLongDst;
    }

    // ADD (.unit) src1 (sint), src2 (xsint), dst (sint) -- .unit = .L1, .L2 op field: 03 pipeline phase E1
    void Tms320C6xIss::op_add_l_03_e1(InstructionState * instState) {
      int32_t signedSrc1, signedSrc2x, signedDst;
      signedSrc1 = (int32_t) state.regfile[instState->ins.l.s][instState->ins.l.src1]; 
      signedSrc2x = (int32_t) state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      signedDst = signedSrc1 + signedSrc2x;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] = signedDst;
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " add_l_03 operand: " << signedSrc1 << " " <<  signedSrc2x 
         << " add instruction result: " << signedDst << std::dec << " (" << (int) signedDst << ")" << std::endl;
#endif
    }

    // ADD (.unit) src1 (sint), src2 (xsint), dst (slong) -- .unit = .L1, .L2 op field: 23 pipeline phase E1
    void Tms320C6xIss::op_add_l_23_e1(InstructionState * instState) {
      int32_t signedSrc1, signedSrc2x; 
      int64_t signedLongDst;
      signedSrc1 = (int32_t) state.regfile[instState->ins.l.s][instState->ins.l.src1]; 
      signedSrc2x = (int32_t) state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      signedLongDst = ((int64_t) signedSrc1) + ((int64_t) signedSrc2x);
      // long result is written over 2 registers
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst+1] = signedLongDst >> 32 & 0x000000ff;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] = signedLongDst;
    }

    // ADD (.unit) src1 (xsint), src2 (slong), dst (slong) -- .unit = .L1, .L2 op field: 21 pipeline phase E1
    void Tms320C6xIss::op_add_l_21_e1(InstructionState * instState) {
      int32_t signedSrc1x; 
      int64_t signedLongSrc2, signedLongDst;
      uint64_t tmplong;
      signedSrc1x = (int32_t) state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src1]; 
      tmplong = ((uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2+1] & 0xff) << 32;
      tmplong = tmplong  | (uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2];
      signedLongSrc2 = SIGN_EXTEND_LONG((int64_t) tmplong, 40);
      signedLongDst = ((int64_t) signedSrc1x) + signedLongSrc2;
      // long result is written over 2 registers
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst+1] = signedLongDst >> 32 & 0x000000ff;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] = signedLongDst;
    }

    // ADD (.unit) src1 (scst5), src2 (xsint), dst (xsint) -- .unit = .L1, .L2 op field: 02 pipeline phase E1
    void Tms320C6xIss::op_add_l_02_e1(InstructionState * instState) {
      int32_t signedCst1, signedSrc2x, signedDst;
      signedCst1 = SIGN_EXTEND((int32_t) instState->ins.l.src1, 5);
      signedSrc2x = (int32_t) state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      signedDst = signedCst1 + signedSrc2x;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] = signedDst;
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " add_l_02 operand: " << signedCst1 << " " <<  signedSrc2x 
         << " add instruction result: " << signedDst << std::dec << " (" << (int) signedDst << ")" << std::endl;
#endif
    }

    // ADD (.unit) src1 (scst5), src2 (slong), dst (slong) -- .unit = .L1, .L2 op field: 20 pipeline phase E1
    void Tms320C6xIss::op_add_l_20_e1(InstructionState * instState) {
      int64_t signedLongCst1, signedLongSrc2,  signedLongDst;
      uint64_t tmplong;
      signedLongCst1 = SIGN_EXTEND_LONG((int64_t) instState->ins.l.src1, 5);
      tmplong = ((uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2+1] & 0xff) << 32;
      tmplong = tmplong  | (uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2];
      signedLongSrc2 = SIGN_EXTEND_LONG((int64_t) tmplong, 40);
      signedLongDst = signedLongCst1 + signedLongSrc2;
      // long result is written over 2 registers
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst+1] = signedLongDst >> 32 & 0x000000ff;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] = signedLongDst;
    }

    // ADDU (.unit) src1 (usint), src2 (xusint), dst (uslong) -- .unit = .L1, .L2 op field: 2B pipeline phase E1
    void Tms320C6xIss::op_addu_l_2b_e1(InstructionState * instState) {
      uint32_t unsignedSrc1, unsignedSrc2x; 
      uint64_t unsignedLongDst;
      unsignedSrc1 = state.regfile[instState->ins.l.s][instState->ins.l.src1]; 
      unsignedSrc2x = state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      unsignedLongDst = ((int64_t) unsignedSrc1) + ((int64_t) unsignedSrc2x);
      // long result is written over 2 registers
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst+1] = unsignedLongDst >> 32 & 0x000000ff;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] = unsignedLongDst;
    }

    // ADDU (.unit) src1 (xusint), src2 (uslong), dst (uslong) -- .unit = .L1, .L2 op field: 29 pipeline phase E1
    void Tms320C6xIss::op_addu_l_29_e1(InstructionState * instState) {
      uint32_t unsignedSrc1x; 
      uint64_t unsignedLongSrc2, unsignedLongDst;
      unsignedSrc1x = state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src1];
      unsignedLongSrc2 = ((uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2+1] & 0xff) << 32;
      unsignedLongSrc2 = unsignedLongSrc2  | (uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2];
      unsignedLongDst = ((int64_t) unsignedSrc1x) + unsignedLongSrc2; 
      // long result is written over 2 registers
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst+1] = unsignedLongDst >> 32 & 0x000000ff;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] = unsignedLongDst;
    }

    // AND (.unit) src1 (usint), src2 (xusint), dst (usint) -- .unit = .L1, .L2 op field: 7B pipeline phase E1
    void Tms320C6xIss::op_and_l_7b_e1(InstructionState * instState) {
      uint32_t unsignedSrc1, unsignedSrc2x, unsignedDst;
      unsignedSrc1 = state.regfile[instState->ins.l.s][instState->ins.l.src1];
      unsignedSrc2x = state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      unsignedDst = unsignedSrc1 & unsignedSrc2x;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }

    // AND (.unit) src1 (scst5), src2 (xusint), dst (usint) -- .unit = .L1, .L2 op field: 7A pipeline phase E1
    void Tms320C6xIss::op_and_l_7a_e1(InstructionState * instState) {
      int32_t signedCst1; 
      uint32_t unsignedSrc2x, unsignedDst;
      signedCst1 = SIGN_EXTEND((int32_t) instState->ins.l.src1, 5);
      unsignedSrc2x = state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      unsignedDst = signedCst1 & unsignedSrc2x;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }

    // CMPEQ (.unit) src1 (sint), src2 (xsint), dst (usint) -- .unit = .L1, .L2 op field: 53 pipeline phase E1
    void Tms320C6xIss::op_cmpeq_l_53_e1(InstructionState * instState) {
      int32_t signedSrc1, signedSrc2x; 
      uint32_t unsignedDst;
      signedSrc1 = (int32_t) state.regfile[instState->ins.l.s][instState->ins.l.src1];
      signedSrc2x = (int32_t) state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      unsignedDst = (signedSrc1 == signedSrc2x) ? 1 : 0;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }

    // CMPEQ (.unit) src1 (scst5), src2 (xsint), dst (usint) -- .unit = .L1, .L2 op field: 52 pipeline phase E1
    void Tms320C6xIss::op_cmpeq_l_52_e1(InstructionState * instState) {
      int32_t signedCst1, signedSrc2x; 
      uint32_t unsignedDst;
      signedCst1 = SIGN_EXTEND((int32_t)instState->ins.l.src1, 5);
      signedSrc2x = (int32_t) state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      unsignedDst = (signedCst1 == signedSrc2x) ? 1 : 0;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }

    // CMPEQ (.unit) src1 (xsint), src2 (slong), dst (usint) -- .unit = .L1, .L2 op field: 51 pipeline phase E1
    void Tms320C6xIss::op_cmpeq_l_51_e1(InstructionState * instState) {
      int32_t signedSrc1x; 
      int64_t signedLongSrc2; 
      uint32_t unsignedDst;
      uint64_t tmplong;
      signedSrc1x = (int32_t) state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src1];
      tmplong = ((uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2+1] & 0xff) << 32;
      tmplong = tmplong  | (uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2];
      signedLongSrc2 = SIGN_EXTEND_LONG((int64_t) tmplong, 40);
      unsignedDst = (signedSrc1x == (signedLongSrc2 & 0xffffffff)) ? 1 : 0;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }

    // CMPEQ (.unit) src1 (scst5), src2 (slong), dst (usint) -- .unit = .L1, .L2 op field: 50 pipeline phase E1
    void Tms320C6xIss::op_cmpeq_l_50_e1(InstructionState * instState) {
      int32_t signedCst1; 
      int64_t signedLongSrc2; 
      uint32_t unsignedDst;
      uint64_t tmplong;
      signedCst1 = SIGN_EXTEND((int32_t) instState->ins.l.src1, 5);
      tmplong = ((uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2+1] & 0xff) << 32;
      tmplong = tmplong  | (uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2];
      signedLongSrc2 = SIGN_EXTEND_LONG((int64_t) tmplong, 40);
      unsignedDst = (signedCst1 == (signedLongSrc2 & 0xffffffff)) ? 1 : 0;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }

