TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
    // CMPGT (.unit) src1 (sint), src2 (xsint), dst (usint) -- .unit = .L1, .L2 op field: 47 pipeline phase E1
    void Tms320C6xIss::op_cmpgt_l_47_e1(InstructionState * instState) {
      int32_t signedSrc1, signedSrc2x; 
      uint32_t unsignedDst;
      signedSrc1 = (int32_t) state.regfile[instState->ins.l.s][instState->ins.l.src1];
      signedSrc2x = (int32_t) state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      unsignedDst = (signedSrc1 > signedSrc2x) ? 1 : 0;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }

    // CMPGT (.unit) src1 (scst5), src2 (xsint), dst (usint) -- .unit = .L1, .L2 op field: 46 pipeline phase E1
    void Tms320C6xIss::op_cmpgt_l_46_e1(InstructionState * instState) {
      int32_t signedCst1, signedSrc2x; 
      uint32_t unsignedDst;
      signedCst1 = SIGN_EXTEND((int32_t) instState->ins.l.src1, 5);
      signedSrc2x = (int32_t) state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      unsignedDst = (signedCst1 > signedSrc2x) ? 1 : 0;
//       std::cout << " cst1: " << signedCst1 << " src2: " << signedSrc2x << " dst: " << unsignedDst << std::endl;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }

    // CMPGT (.unit) src1 (xsint), src2 (slong), dst (usint) -- .unit = .L1, .L2 op field: 45 pipeline phase E1
    void Tms320C6xIss::op_cmpgt_l_45_e1(InstructionState * instState) {
      int32_t signedSrc1x; 
      int64_t signedLongSrc2; 
      uint32_t unsignedDst;
      uint64_t tmplong;
      signedSrc1x = (int32_t) state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src1];
      tmplong = ((uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2+1] & 0xff) << 32;
      tmplong = tmplong  | (uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2];
      signedLongSrc2 = SIGN_EXTEND_LONG((int64_t) tmplong, 40);
      unsignedDst = (signedSrc1x > signedLongSrc2) ? 1 : 0;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }

    // CMPGT (.unit) src1 (scst5), src2 (slong), dst (usint) -- .unit = .L1, .L2 op field: 44 pipeline phase E1
    void Tms320C6xIss::op_cmpgt_l_44_e1(InstructionState * instState) {
      int32_t signedCst1; 
      int64_t signedLongSrc2; 
      uint32_t unsignedDst;
      uint64_t tmplong;
      signedCst1 = SIGN_EXTEND((int32_t) instState->ins.l.src1, 5);
      tmplong = ((uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2+1] & 0xff) << 32;
      tmplong = tmplong  | (uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2];
      signedLongSrc2 = SIGN_EXTEND_LONG((int64_t) tmplong, 40);
      unsignedDst = (signedCst1 > signedLongSrc2) ? 1 : 0;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }

    // CMPGTU (.unit) src1 (usint), src2 (xusint), dst (usint) -- .unit = .L1, .L2 op field: 4f pipeline phase E1
    void Tms320C6xIss::op_cmpgtu_l_4f_e1(InstructionState * instState) {
      uint32_t unsignedSrc1, unsignedSrc2x, unsignedDst;
      unsignedSrc1 = state.regfile[instState->ins.l.s][instState->ins.l.src1];
      unsignedSrc2x = state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      unsignedDst = (unsignedSrc1 > unsignedSrc2x) ? 1 : 0;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }

    // CMPGTU (.unit) src1 (ucst5), src2 (xusint), dst (usint) -- .unit = .L1, .L2 op field: 4e pipeline phase E1
    void Tms320C6xIss::op_cmpgtu_l_4e_e1(InstructionState * instState) {
      uint32_t unsignedCst1, unsignedSrc2x, unsignedDst;
      unsignedCst1 = instState->ins.l.src1;
      unsignedSrc2x = state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      unsignedDst = (unsignedCst1 > unsignedSrc2x) ? 1 : 0;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }

    // CMPGTU (.unit) src1 (xusint), src2 (uslong), dst (usint) -- .unit = .L1, .L2 op field: 4d pipeline phase E1
    void Tms320C6xIss::op_cmpgtu_l_4d_e1(InstructionState * instState) {
      uint32_t unsignedSrc1x; 
      uint64_t unsignedLongSrc2; 
      uint32_t unsignedDst;
      unsignedSrc1x = state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src1];
      unsignedLongSrc2 = ((uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2+1] & 0xff) << 32;
      unsignedLongSrc2 = unsignedLongSrc2  | (uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2];
      unsignedDst = (unsignedSrc1x > unsignedLongSrc2) ? 1 : 0;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }

    // CMPGTU (.unit) src1 (ucst5), src2 (uslong), dst (usint) -- .unit = .L1, .L2 op field: 4d pipeline phase E1
    void Tms320C6xIss::op_cmpgtu_l_4c_e1(InstructionState * instState) {
      uint32_t unsignedCst1; 
      uint64_t unsignedLongSrc2; 
      uint32_t unsignedDst;
      unsignedCst1 = instState->ins.l.src1;
      unsignedLongSrc2 = ((uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2+1] & 0xff) << 32;
      unsignedLongSrc2 = unsignedLongSrc2  | (uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2];
      unsignedDst = (unsignedCst1 > unsignedLongSrc2) ? 1 : 0;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }

    // CMPLT (.unit) src1 (sint), src2 (xsint), dst (usint) -- .unit = .L1, .L2 op field: 57 pipeline phase E1
    void Tms320C6xIss::op_cmplt_l_57_e1(InstructionState * instState) {
      int32_t signedSrc1, signedSrc2x;
      uint32_t unsignedDst;
      signedSrc1 = (int32_t) state.regfile[instState->ins.l.s][instState->ins.l.src1];
      signedSrc2x = (int32_t) state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      unsignedDst = (signedSrc1 < signedSrc2x) ? 1 : 0;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }

