TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
    // CMPLT (.unit) src1 (scst5), src2 (xsint), dst (usint) -- .unit = .L1, .L2 op field: 56 pipeline phase E1
    void Tms320C6xIss::op_cmplt_l_56_e1(InstructionState * instState) {
      int32_t signedCst1, signedSrc2x;
      uint32_t unsignedDst;
      signedCst1 = SIGN_EXTEND((int32_t) instState->ins.l.src1, 5);
      signedSrc2x = (int32_t) state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      unsignedDst = (signedCst1 < signedSrc2x) ? 1 : 0;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }

    // CMPLT (.unit) src1 (xsint), src2 (slong), dst (usint) -- .unit = .L1, .L2 op field: 55 pipeline phase E1
    void Tms320C6xIss::op_cmplt_l_55_e1(InstructionState * instState) {
      int32_t signedSrc1x; 
      int64_t signedLongSrc2; 
      uint32_t unsignedDst;
      uint64_t tmplong;
      signedSrc1x = (int32_t) state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src1];
      tmplong = ((uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2+1] & 0xff) << 32;
      tmplong = tmplong  | (uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2];
      signedLongSrc2 = SIGN_EXTEND_LONG((int64_t) tmplong, 40);
      unsignedDst = (signedSrc1x < signedLongSrc2) ? 1 : 0;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }

    // CMPLT (.unit) src1 (scst5), src2 (slong), dst (usint) -- .unit = .L1, .L2 op field: 55 pipeline phase E1
    void Tms320C6xIss::op_cmplt_l_54_e1(InstructionState * instState) {
      int32_t signedCst1; 
      int64_t signedLongSrc2; 
      uint32_t unsignedDst;
      uint64_t tmplong;
      signedCst1 = SIGN_EXTEND((int32_t) instState->ins.l.src1, 5);
      tmplong = ((uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2+1] & 0xff) << 32;
      tmplong = tmplong  | (uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2];
      signedLongSrc2 = SIGN_EXTEND_LONG((int64_t) tmplong, 40);
      unsignedDst = (signedCst1 < signedLongSrc2) ? 1 : 0;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }

    // CMPLTU (.unit) src1 (usint), src2 (xusint), dst (usint) -- .unit = .L1, .L2 op field: 5f pipeline phase E1
    void Tms320C6xIss::op_cmpltu_l_5f_e1(InstructionState * instState) {
      uint32_t unsignedSrc1, unsignedSrc2x, unsignedDst;
      unsignedSrc1 = state.regfile[instState->ins.l.s][instState->ins.l.src1];
      unsignedSrc2x = state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      unsignedDst = (unsignedSrc1 < unsignedSrc2x) ? 1 : 0;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }

    // CMPLTU (.unit) src1 (ucst5), src2 (xusint), dst (usint) -- .unit = .L1, .L2 op field: 5e pipeline phase E1
    void Tms320C6xIss::op_cmpltu_l_5e_e1(InstructionState * instState) {
      uint32_t unsignedCst1, unsignedSrc2x, unsignedDst;
      unsignedCst1 = instState->ins.l.src1;
      unsignedSrc2x = state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      unsignedDst = (unsignedCst1 < unsignedSrc2x) ? 1 : 0;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }

    // CMPLTU (.unit) src1 (xusint), src2 (uslong), dst (usint) -- .unit = .L1, .L2 op field: 5d pipeline phase E1
    void Tms320C6xIss::op_cmpltu_l_5d_e1(InstructionState * instState) {
      uint32_t unsignedSrc1x; 
      uint64_t unsignedLongSrc2; 
      uint32_t unsignedDst;
      unsignedSrc1x = state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src1];
      unsignedLongSrc2 = ((uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2+1] & 0xff) << 32;
      unsignedLongSrc2 = unsignedLongSrc2  | (uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2];
      unsignedDst = (unsignedSrc1x < unsignedLongSrc2) ? 1 : 0;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }

    // CMPLTU (.unit) src1 (ucst5), src2 (uslong), dst (usint) -- .unit = .L1, .L2 op field: 5d pipeline phase E1
    void Tms320C6xIss::op_cmpltu_l_5c_e1(InstructionState * instState) {
      uint32_t unsignedCst1; 
      uint64_t unsignedLongSrc2; 
      uint32_t unsignedDst;
      unsignedCst1 = instState->ins.l.src1;
      unsignedLongSrc2 = ((uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2+1] & 0xff) << 32;
      unsignedLongSrc2 = unsignedLongSrc2  | (uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2];
      unsignedDst = (unsignedCst1 < unsignedLongSrc2) ? 1 : 0;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }


    // LMBD (.unit) src1 (uint), src2 (xuint), dst (uint) -- .unit = .L1, .L2 op field: 6b pipeline phase E1
    void Tms320C6xIss::op_lmbd_l_6b_e1(InstructionState * instState) {
      uint32_t unsignedSrc1, unsignedSrc2x, unsignedDst; 
      int32_t tmpcount; 
      uint8_t tmp;
      unsignedSrc1 = state.regfile[instState->ins.l.s][instState->ins.l.src1];
      unsignedSrc2x = state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      tmp = unsignedSrc1 & 0x00000001;
      for (tmpcount = 31 ; tmpcount >= 0 ; tmpcount-- ) {
	if (((unsignedSrc2x >> tmpcount) & 0x00000001) == tmp)
	  break;
      }
      unsignedDst = 31 - tmpcount;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }

    // LMBD (.unit) src1 (cst5), src2 (xuint), dst (uint) -- .unit = .L1, .L2 op field: 6a pipeline phase E1
    void Tms320C6xIss::op_lmbd_l_6a_e1(InstructionState * instState) {
      uint32_t unsignedCst1, unsignedSrc2x, unsignedDst; 
      int32_t tmpcount; 
      uint8_t tmp;
      unsignedCst1 = instState->ins.l.src1;
      unsignedSrc2x = state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      tmp = unsignedCst1 & 0x00000001;
      for (tmpcount = 31 ; tmpcount >= 0 ; tmpcount-- ) {
	if (((unsignedSrc2x >> tmpcount) & 0x00000001) == tmp)
	  break;
      }
      unsignedDst = 31 - tmpcount;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }


    // NORM(.unit) src1 (xsint), dst (uint) -- .unit = .L1, .L2 op field: 63 pipeline phase E1
    void Tms320C6xIss::op_norm_l_63_e1(InstructionState * instState) {
      int32_t signedSrc2x; 
      uint32_t unsignedDst; 
      int32_t tmpcount; 
      uint8_t tmp;
      signedSrc2x = (int32_t) state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      tmp = (signedSrc2x >> 31) & 0x00000001;
      tmp = !tmp;
      for (tmpcount = 31 ; tmpcount >= 0 ; tmpcount-- ) {
	if (((signedSrc2x >> tmpcount) & 0x00000001) == tmp)
	  break;
      }
      unsignedDst = 31 - tmpcount - 1;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }

    // NORM (.unit) src1 (slong), dst (uint) -- .unit = .L1, .L2 op field: 60 pipeline phase E1
    void Tms320C6xIss::op_norm_l_60_e1(InstructionState * instState) {
      int64_t signedLongSrc2; 
      uint32_t unsignedDst; 
      int32_t tmpcount; 
      uint8_t tmp;
      uint64_t tmplong;
      tmplong = ((uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2+1] & 0xff) << 32;
      tmplong = tmplong  | (uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2];
      signedLongSrc2 = SIGN_EXTEND_LONG((int64_t) tmplong, 40);
      tmp = (signedLongSrc2 >> 39) & 0x00000001;
      tmp = !tmp;
      for (tmpcount = 39 ; tmpcount >= 0 ; tmpcount-- ) {
	if (((signedLongSrc2 >> tmpcount) & 0x00000001) == tmp)
	  break;
      }
//       std::cout << " tmpcount : " << tmpcount <<  std::endl;
      unsignedDst = 39 - tmpcount - 1;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }

