TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
    // OR (.unit) src1 (usint), src2 (xusint), dst (usint) -- .unit = .L1, .L2 op field: 7f pipeline phase E1
    void Tms320C6xIss::op_or_l_7f_e1(InstructionState * instState) {
      uint32_t unsignedSrc1, unsignedSrc2x, unsignedDst;
      unsignedSrc1 = state.regfile[instState->ins.l.s][instState->ins.l.src1];
      unsignedSrc2x = state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      unsignedDst = unsignedSrc1 | unsignedSrc2x;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }

    // OR (.unit) src1 (scst5), src2 (xusint), dst (usint) -- .unit = .L1, .L2 op field: 7e pipeline phase E1
    void Tms320C6xIss::op_or_l_7e_e1(InstructionState * instState) {
      int32_t signedCst1;
      uint32_t unsignedSrc2x, unsignedDst;
      signedCst1 = SIGN_EXTEND((int32_t) instState->ins.l.src1, 5);
      unsignedSrc2x = state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      unsignedDst = signedCst1 | unsignedSrc2x;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }

    // SADD (.unit) src1 (sint), src2 (xsint), dst (sint) -- .unit = .L1, .L2 op field: 13 pipeline phase E1
    void Tms320C6xIss::op_sadd_l_13_e1(InstructionState * instState) {
      int32_t signedSrc1, signedSrc2x, signedDst; 
      int64_t signedLongDst;
      signedSrc1 = (int32_t) state.regfile[instState->ins.l.s][instState->ins.l.src1];
      signedSrc2x = (int32_t) state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      signedLongDst = ((int64_t) signedSrc1) + ((int64_t) signedSrc2x);
      if (signedLongDst > 0x7fffffff) {
	signedDst = 0x7fffffff;
	state.c_regfile[CSR] = state.c_regfile[CSR] | 0x00000200; }
      else if (signedLongDst < -(0x8000000)) {
	signedDst = -(0x80000000);
	state.c_regfile[CSR] = state.c_regfile[CSR] | 0x00000200; }
      else
	signedDst = (int32_t) signedLongDst;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  signedDst;
    }

    // SADD (.unit) src1 (xsint), src2 (slong), dst (slong) -- .unit = .L1, .L2 op field: 31 pipeline phase E1
    void Tms320C6xIss::op_sadd_l_31_e1(InstructionState * instState) {
      int32_t signedSrc1x; 
      int64_t signedLongSrc2, signedLongDst;
      uint64_t tmplong;
      signedSrc1x = (int32_t) state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src1];
      tmplong = ((uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2+1] & 0xff) << 32;
      tmplong = tmplong  | (uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2];
      signedLongSrc2 = SIGN_EXTEND_LONG((int64_t) tmplong, 40);
      signedLongDst = ((int64_t) signedSrc1x) + signedLongSrc2;
      if (signedLongDst > INT64_MAX) {
	signedLongDst = INT64_MAX;
	state.c_regfile[CSR] = state.c_regfile[CSR] | 0x00000200; }
      else if (signedLongDst < INT64_MIN) {
	signedLongDst = INT64_MIN;
	state.c_regfile[CSR] = state.c_regfile[CSR] | 0x00000200; }
      // long result is written over 2 registers
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst+1] = signedLongDst >> 32 & 0x000000ff;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] = signedLongDst;
    }

    // SADD (.unit) src1 (scst5), src2 (xsint), dst (sint) -- .unit = .L1, .L2 op field: 12 pipeline phase E1
    void Tms320C6xIss::op_sadd_l_12_e1(InstructionState * instState) {
      int32_t signedCst1, signedSrc2x, signedDst; 
      int64_t signedLongDst;
      signedCst1 = SIGN_EXTEND((int32_t) instState->ins.l.src1, 5);
      signedSrc2x = (int32_t) state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      signedLongDst = ((int64_t) signedCst1) + ((int64_t) signedSrc2x);
      if (signedLongDst > 0x7fffffff) {
	signedDst = 0x7fffffff;			
	state.c_regfile[CSR] = state.c_regfile[CSR] | 0x00000200; }
      else if (signedLongDst < -(0x8000000)) {
	signedDst = -(0x80000000) ,
	  state.c_regfile[CSR] = state.c_regfile[CSR] | 0x00000200; }
      else
	signedDst = (int32_t) signedLongDst;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  signedDst;
    }

    // SADD (.unit) src1 (scst5), src2 (slong), dst (slong) -- .unit = .L1, .L2 op field: 30 pipeline phase E1
    void Tms320C6xIss::op_sadd_l_30_e1(InstructionState * instState) {
      int64_t signedLongCst1, signedLongSrc2, signedLongDst;
      uint32_t tmplong;
      signedLongCst1 = SIGN_EXTEND_LONG((int64_t) instState->ins.l.src1, 5);
      tmplong = ((uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2+1] & 0xff) << 32;
      tmplong = tmplong  | (uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2];
      signedLongSrc2 = SIGN_EXTEND_LONG((int64_t) tmplong, 40);
      signedLongDst = signedLongCst1 + signedLongSrc2;
      if (signedLongDst > INT64_MAX) {
	signedLongDst = INT64_MAX;
	state.c_regfile[CSR] = state.c_regfile[CSR] | 0x00000200; }
      else if (signedLongDst < INT64_MIN) {
	signedLongDst = INT64_MIN;
	state.c_regfile[CSR] = state.c_regfile[CSR] | 0x00000200; }
      // long result is written over 2 registers
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst+1] = signedLongDst >> 32 & 0x000000ff;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] = signedLongDst;
    }

    // SAT (.unit) src2 (slong), dst (sint) -- .unit = .L1, .L2 op field: 40 pipeline phase E1
    void Tms320C6xIss::op_sat_l_40_e1(InstructionState * instState) {
      int64_t signedLongSrc2; 
      int32_t signedDst;
      uint64_t tmplong;
      tmplong = ((uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2+1] & 0xff) << 32;
      tmplong = tmplong  | (uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2];
      signedLongSrc2 = SIGN_EXTEND_LONG((int64_t) tmplong, 40);
      if (signedLongSrc2 > 0x7fffffff)
	signedDst = 0x7fffffff ,
	  state.c_regfile[CSR] = state.c_regfile[CSR] | 0x00000200;
      else if (signedLongSrc2 < -(0x80000000))
	signedDst = -(0x80000000) ,
	  state.c_regfile[CSR] = state.c_regfile[CSR] | 0x00000200;
      else
	signedDst = signedLongSrc2 & 0xffffffff;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  signedDst;
    }

