TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
    // SSUB (.unit) src1 (sint), src2 (xsint), dst (sint) -- .unit = .L1, .L2 op field: 0f pipeline phase E1
    void Tms320C6xIss::op_ssub_l_0f_e1(InstructionState * instState) {
      int32_t signedSrc1, signedSrc2x; 
      int64_t signedLongDst; 
      int32_t signedDst;
      signedSrc1 = (int32_t) state.regfile[instState->ins.l.s][instState->ins.l.src1];
      signedSrc2x = (int32_t) state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      signedLongDst = ((int64_t) signedSrc1) - ((int64_t) signedSrc2x);
      if (signedLongDst > 0x7fffffff)
	signedDst = 0x7fffffff ,
	  state.c_regfile[CSR] = state.c_regfile[CSR] | 0x00000200;
      else if (signedLongDst < -(0x8000000))
	signedDst = -(0x80000000) ,
	  state.c_regfile[CSR] = state.c_regfile[CSR] | 0x00000200;
      else
	signedDst = (int32_t) signedLongDst;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  signedDst;
    }

    // SSUB (.unit) src1 (xsint), src2 (sint), dst (sint) -- .unit = .L1, .L2 op field: 1f pipeline phase E1
    void Tms320C6xIss::op_ssub_l_1f_e1(InstructionState * instState) {
      int32_t signedSrc1x, signedSrc2; 
      int64_t signedLongDst; 
      int32_t signedDst;
      signedSrc1x = (int32_t) (int32_t) state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src1];
      signedSrc2 = (int32_t) state.regfile[instState->ins.l.s][instState->ins.l.src2];
      signedLongDst = ((int64_t) signedSrc1x) - ((int64_t) signedSrc2);
      if (signedLongDst > 0x7fffffff)
	signedDst = 0x7fffffff ,
	  state.c_regfile[CSR] = state.c_regfile[CSR] | 0x00000200;
      else if (signedLongDst < -(0x8000000))
	signedDst = -(0x80000000) ,
	  state.c_regfile[CSR] = state.c_regfile[CSR] | 0x00000200;
      else
	signedDst = (int32_t) signedLongDst;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  signedDst;
    }

    // SSUB (.unit) src1 (scst5), src2 (xsint), dst (sint) -- .unit = .L1, .L2 op field: 0e pipeline phase E1
    void Tms320C6xIss::op_ssub_l_0e_e1(InstructionState * instState) {
      int32_t signedCst1, signedSrc2x; 
      int64_t signedLongDst; 
      int32_t signedDst;
      signedCst1 = SIGN_EXTEND((int32_t) instState->ins.l.src1, 5);
      signedSrc2x = (int32_t) state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      signedLongDst = ((int64_t) signedCst1) - ((int64_t) signedSrc2x);
      if (signedLongDst > 0x7fffffff)
	signedDst = 0x7fffffff ,
	  state.c_regfile[CSR] = state.c_regfile[CSR] | 0x00000200;
      else if (signedLongDst < -(0x8000000))
	signedDst = -(0x80000000) ,
	  state.c_regfile[CSR] = state.c_regfile[CSR] | 0x00000200;
      else
	signedDst = (int32_t) signedLongDst;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  signedDst;
    }

    // SSUB (.unit) src1 (scst5), src2 (slong), dst (slong) -- .unit = .L1, .L2 op field: 2c pipeline phase E1
    void Tms320C6xIss::op_ssub_l_2c_e1(InstructionState * instState) {
      int64_t signedLongCst1, signedLongSrc2, signedLongDst;
      uint64_t tmplong;
      signedLongCst1 = SIGN_EXTEND_LONG((int64_t) instState->ins.l.src1, 5);
      tmplong = ((uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2+1] & 0xff) << 32;
      tmplong = tmplong  | (uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2];
      signedLongSrc2 = SIGN_EXTEND_LONG((int64_t) tmplong, 40);
      signedLongDst = signedLongCst1 - signedLongSrc2;
      if (signedLongDst > INT64_MAX)
	signedLongDst = INT64_MAX ,
	  state.c_regfile[CSR] = state.c_regfile[CSR] | 0x00000200;
      else if (signedLongDst < INT64_MIN)
	signedLongDst = INT64_MIN,
	  state.c_regfile[CSR] = state.c_regfile[CSR] | 0x00000200;
      // long result is written over 2 registers
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst+1] = signedLongDst >> 32 & 0x000000ff;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] = signedLongDst;
    }

    // SSUB (.unit) src1 (sint), src2 (xsint), dst (sint) -- .unit = .L1, .L2 op field: 07 pipeline phase E1
    void Tms320C6xIss::op_sub_l_07_e1(InstructionState * instState) {
      int32_t signedSrc1, signedSrc2x, signedDst;
      signedSrc1 = (int32_t) state.regfile[instState->ins.l.s][instState->ins.l.src1];
      signedSrc2x = (int32_t) state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      signedDst = ((int64_t) signedSrc1) - ((int64_t) signedSrc2x);
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  signedDst;
    }

    // SSUB (.unit) src1 (xsint), src2 (sint), dst (sint) -- .unit = .L1, .L2 op field: 17 pipeline phase E1
    void Tms320C6xIss::op_sub_l_17_e1(InstructionState * instState) {
      int32_t signedSrc1x, signedSrc2, signedDst;
      signedSrc1x = (int32_t) state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src1];
      signedSrc2 = (int32_t) state.regfile[instState->ins.l.s][instState->ins.l.src2];
      signedDst = ((int64_t) signedSrc1x) - ((int64_t) signedSrc2);
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  signedDst;
    }

    // SSUB (.unit) src1 (sint), src2 (xsint), dst (slong) -- .unit = .L1, .L2 op field: 27 pipeline phase E1
    void Tms320C6xIss::op_sub_l_27_e1(InstructionState * instState) {
      int32_t signedSrc1, signedSrc2x;
      int64_t signedLongDst;
      signedSrc1 = (int32_t) state.regfile[instState->ins.l.s][instState->ins.l.src1];
      signedSrc2x = (int32_t) state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      signedLongDst = ((int64_t) signedSrc1) - ((int64_t) signedSrc2x);
      // long result is written over 2 registers
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst+1] = signedLongDst >> 32 & 0x000000ff;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] = signedLongDst;
    }

    // SSUB (.unit) src1 (xsint), src2 (sint), dst (slong) -- .unit = .L1, .L2 op field: 37 pipeline phase E1
    void Tms320C6xIss::op_sub_l_37_e1(InstructionState * instState) {
      int32_t signedSrc1x, signedSrc2; 
      int64_t signedLongDst;
      signedSrc1x = (int32_t) state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src1];
      signedSrc2 = (int32_t) state.regfile[instState->ins.l.s][instState->ins.l.src2];
      signedLongDst = ((int64_t) signedSrc1x) - ((int64_t) signedSrc2);
      // long result is written over 2 registers
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst+1] = signedLongDst >> 32 & 0x000000ff;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] = signedLongDst;
    }

    // SUBU (.unit) src1 (usint), src2 (xusint), dst (uslong) -- .unit = .L1, .L2 op field: 2f pipeline phase E1
    void Tms320C6xIss::op_subu_l_2f_e1(InstructionState * instState) {
      uint32_t unsignedSrc1, unsignedSrc2x; 
      uint64_t unsignedLongDst;
      unsignedSrc1 = state.regfile[instState->ins.l.s][instState->ins.l.src1];
      unsignedSrc2x = state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      unsignedLongDst = ((uint64_t) unsignedSrc1) - ((uint64_t) unsignedSrc2x);
      // long result is written over 2 registers
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst+1] = unsignedLongDst >> 32 & 0x000000ff;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] = unsignedLongDst;
    }

    // SUBU (.unit) src1 (xusint), src2 (usint), dst (uslong) -- .unit = .L1, .L2 op field: 3f pipeline phase E1
    void Tms320C6xIss::op_subu_l_3f_e1(InstructionState * instState) {
      uint32_t unsignedSrc1x, unsignedSrc2; 
      uint64_t unsignedLongDst;
      unsignedSrc1x = state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src1];
      unsignedSrc2 = state.regfile[instState->ins.l.s][instState->ins.l.src2];
      unsignedLongDst = ((uint64_t) unsignedSrc1x) - ((uint64_t) unsignedSrc2);
      // long result is written over 2 registers
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst+1] = unsignedLongDst >> 32 & 0x000000ff;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] = unsignedLongDst;
    }

    // SUB (.unit) src1 (scst5), src2 (xsint), dst (sint) -- .unit = .L1, .L2 op field: 06 pipeline phase E1
    void Tms320C6xIss::op_sub_l_06_e1(InstructionState * instState) {
      int32_t signedCst1, signedSrc2x, signedDst;
      signedCst1 = SIGN_EXTEND((int32_t) instState->ins.l.src1, 5);
      signedSrc2x = (int32_t) state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      signedDst = signedCst1 - signedSrc2x;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  signedDst;
    }

    // SUB (.unit) src1 (scst5), src2 (slong), dst (slong) -- .unit = .L1, .L2 op field: 24 pipeline phase E1
    void Tms320C6xIss::op_sub_l_24_e1(InstructionState * instState) {
      int64_t signedLongCst1, signedLongSrc2, signedLongDst;
      uint64_t tmplong;
      signedLongCst1 = SIGN_EXTEND_LONG((int64_t) instState->ins.l.src1, 5);
      tmplong = ((uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2+1] & 0xff) << 32;
      tmplong = tmplong  | (uint64_t) state.regfile[instState->ins.l.s][instState->ins.l.src2];
      signedLongSrc2 = SIGN_EXTEND_LONG((int64_t) tmplong, 40);
      signedLongDst = signedLongCst1 - signedLongSrc2;
      // long result is written over 2 registers
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst+1] = signedLongDst >> 32 & 0x000000ff;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] = signedLongDst;
    }

    // SUBC (.unit) src1 (usint), src2 (xusint), dst (usint) -- .unit = .L1, .L2 op field: 4b pipeline phase E1
    void Tms320C6xIss::op_subc_l_4b_e1(InstructionState * instState) {
      uint32_t unsignedSrc1, unsignedSrc2x, unsignedDst;
      unsignedSrc1 = state.regfile[instState->ins.l.s][instState->ins.l.src1];
      unsignedSrc2x = state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      if (((int) (unsignedSrc1 - unsignedSrc2x)) >= 0)
	unsignedDst = ((unsignedSrc1 - unsignedSrc2x) << 1) +1;
      else
	unsignedDst = unsignedSrc1 << 1;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
//       std::cout << " src1: " << unsignedSrc1 << " src2: " << unsignedSrc2x << " dst: " << unsignedDst << std::endl;
    }

