TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
    // XOR (.unit) src1 (usint), src2 (xusint), dst (usint) -- .unit = .L1, .L2 op field: 24 pipeline phase E1
    void Tms320C6xIss::op_xor_l_6f_e1(InstructionState * instState) {
      uint32_t unsignedSrc1, unsignedSrc2x, unsignedDst;
      unsignedSrc1 = state.regfile[instState->ins.l.s][instState->ins.l.src1];
      unsignedSrc2x = state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      unsignedDst = unsignedSrc1 ^ unsignedSrc2x;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }

    // XOR (.unit) src1 (scst5), src2 (xusint), dst (usint) -- .unit = .L1, .L2 op field: 24 pipeline phase E1
    void Tms320C6xIss::op_xor_l_6e_e1(InstructionState * instState) {
      int32_t signedCst1; 
      uint32_t unsignedSrc2x, unsignedDst;
      signedCst1 = SIGN_EXTEND((int32_t) instState->ins.l.src1, 5);
      unsignedSrc2x = state.regfile[instState->ins.l.s ^ instState->ins.l.x][instState->ins.l.src2];
      unsignedDst = signedCst1 ^ unsignedSrc2x;
      state.regfile_temp[instState->ins.l.s][instState->ins.l.dst] =  unsignedDst;
    }


    void Tms320C6xIss::op_illegal_l_e1(InstructionState * instState) {
      std::cerr << "Warning: unknown instruction with opcode "<< std::hex << instState->ins.l.op << std::dec 
		<< " in .L unit in E1 pipeline phase @ " << m_exec_cycles <<  " cycle, instruction is " 
		<< std::hex << instState->ins.ins 
		<< " PC is " << state.DCE1.getPC() << std::dec << std::endl;
    }


    //
    // .S unit InstructionState set
    //
    //

    //
    // E1 phase
    //

    // ADD (.unit) src1 (sint), src2 (xsint), dst (sint) -- .unit = .S1, .S2 op field: 07 pipeline phase E1
    void Tms320C6xIss::op_add_s_07_e1(InstructionState * instState) {
      int32_t signedDst, signedSrc1, signedSrc2x;
      signedSrc1 = (int32_t) state.regfile[instState->ins.s.s][instState->ins.s.src1];
      signedSrc2x = (int32_t) state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      signedDst = signedSrc1 + signedSrc2x;
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] =  signedDst;
    }

    // ADD (.unit) src1 (scst5), src2 (xsint), dst (sint) -- .unit = .S1, .S2 op field: 06 pipeline phase E1
    void Tms320C6xIss::op_add_s_06_e1(InstructionState * instState) {
      int32_t signedDst, signedCst1, signedSrc2x;
      signedCst1 = SIGN_EXTEND((int32_t) instState->ins.s.src1, 5);
      signedSrc2x = (int32_t) state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      signedDst = signedCst1 + signedSrc2x;
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] =  signedDst;
    }

    // ADD2 (.unit) src1 (scst5), src2 (xsint), dst (sint) -- .unit = .S1, .S2 op field: 01 pipeline phase E1
    void Tms320C6xIss::op_add2_s_01_e1(InstructionState * instState) {
      int32_t signedDst, signedSrc1, signedSrc2x;
      signedSrc1 = (int32_t) state.regfile[instState->ins.s.s][instState->ins.s.src1];
      signedSrc2x = (int32_t) state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      signedDst =  ((SLSB16(signedSrc1) + SLSB16(signedSrc2x)) & 0xffff) | ((MSB16(signedSrc1) + MSB16(signedSrc2x)) << 16);
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] =  signedDst;
    }

    // AND (.unit) src1 (usint), src2 (xusint), dst (usint) -- .unit = .S1, .S2 op field: 1f pipeline phase E1
    void Tms320C6xIss::op_and_s_1f_e1(InstructionState * instState) {
      uint32_t unsignedDst, unsignedSrc1, unsignedSrc2x;
      unsignedSrc1 = state.regfile[instState->ins.s.s][instState->ins.s.src1];
      unsignedSrc2x = state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      unsignedDst = unsignedSrc1 & unsignedSrc2x;
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] =  unsignedDst;
    }

    // AND (.unit) src1 (scst5), src2 (xusint), dst (usint) -- .unit = .S1, .S2 op field: 1e pipeline phase E1
    void Tms320C6xIss::op_and_s_1e_e1(InstructionState * instState) {
      uint32_t unsignedDst, signedCst1, unsignedSrc2x;
      signedCst1 = SIGN_EXTEND((int32_t) instState->ins.s.src1, 5);
      unsignedSrc2x = state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      unsignedDst = signedCst1 & unsignedSrc2x;
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] =  unsignedDst;
    }

    // Branch Using a Register B (.unit) src2 .unit = .S2
    void Tms320C6xIss::op_b_s_0d_e1(InstructionState * instState) {
      uint32_t unsignedSrc2x;
      unsignedSrc2x = state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      state.PG.setBranchAddress(unsignedSrc2x);
      state.PG.setBranchFlag(true);
    }

    // Branch Using an Interrupt Return Pointer -- B (.unit) IRP .unit = .S2
    // Branch Using NMI Return Pointer          -- B (.unit) NRP .unit = .S2
    void Tms320C6xIss::op_b_s_03_e1(InstructionState * instState) {
      if (instState->ins.s.src2  == 0x06) {
	// Branch Using an IRP - an Interrupt Return Pointer
	state.PG.setBranchAddress(state.c_regfile[IRP]);
	state.PG.setBranchFlag(true);
	// PGIE is copied to GIE
	state.c_regfile[CSR] = (state.c_regfile[CSR] & 0xfffffffe) | ((state.c_regfile[CSR] >> 1) & 0x00000001);
	//PGPS.branch_delay = 1;
      } else if (instState->ins.s.src2 == 0x07) {
	// Branch using NMI Return Pointer & set NMIE in state.c_regfile[IER]
	state.PG.setBranchAddress(state.c_regfile[NRP]);
	state.PG.setBranchFlag(true);
	state.c_regfile[IER] = state.c_regfile[IER] | 0x00000002;
      }
    }


    // CLR Clear Bit Fields of src2 whose bounds are given by 5-9 & 0-4 of src1 (.unit) src1 (usint), src2 (xusint), dst (usint) -- .unit = .S1, .S2 op field: 3f pipeline phase E1
    void Tms320C6xIss::op_clr_s_3f_e1(InstructionState * instState) {
      uint32_t unsignedDst, unsignedSrc1, unsignedSrc2x; 
      int32_t tmpcount;
      unsignedSrc1 = state.regfile[instState->ins.s.s][instState->ins.s.src1];
      unsignedSrc2x = state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      unsignedDst = unsignedSrc2x;
      for (tmpcount  = ((unsignedSrc1 >> 5) & 0x1f);
	   tmpcount <= (int32_t) ((unsignedSrc1 >> 0) & 0x1f);
	   tmpcount++)
	unsignedDst = unsignedDst & clearbit[tmpcount];
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] =  unsignedDst;
    }

    // EXT Extract & Sign Extend a bit field* (.unit) src1 (usint), src2 (xsint), dst (sint) -- .unit = .S1, .S2 op field: 2f pipeline phase E1
    void Tms320C6xIss::op_ext_s_2f_e1(InstructionState * instState) {
      uint32_t unsignedSrc1;
      int32_t signedDst, signedSrc2x;
      unsignedSrc1 = state.regfile[instState->ins.s.s][instState->ins.s.src1];
      signedSrc2x = (int32_t) state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      signedDst = ( signedSrc2x << ((unsignedSrc1 >> 5) & 0x1f)) >> (unsignedSrc1 & 0x1f);
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] =  signedDst;
    }

    // EXT Extract & Zeo Extend a bit field* (.unit) src1 (usint), src2 (xusint), dst (usint) -- .unit = .S1, .S2 op field: 2f pipeline phase E1
    void Tms320C6xIss::op_extu_s_2b_e1(InstructionState * instState) {
      uint32_t unsignedDst, unsignedSrc1,  unsignedSrc2x;
      unsignedSrc1 = state.regfile[instState->ins.s.s][instState->ins.s.src1];
      unsignedSrc2x = state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      unsignedDst = ( unsignedSrc2x << ((unsignedSrc1 >> 5) & 0x1f)) >> (unsignedSrc1 & 0x1f);
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] =  unsignedDst;
    }

    // Move between Control File & Register File (.unit) src2 (usint), dst (usint) -- .unit = .S1, .S2 op field: 0f pipeline phase E1
    void Tms320C6xIss::op_mvu_s_0f_e1(InstructionState * instState) {
      uint32_t unsignedDst;
      unsignedDst = state.c_regfile[instState->ins.s.src2];
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] =  unsignedDst;
    }

    // Move between Control File & Register File (.unit) src2 (xusint), dst (usint) -- .unit = .S1, .S2 op field: 0e pipeline phase E1
    void Tms320C6xIss::op_mvc_s_0e_e1(InstructionState * instState) {
      uint32_t unsignedSrc2x;
      unsignedSrc2x = state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      state.c_regfile[instState->ins.s.dst] = unsignedSrc2x;
    }

    // Bitwise OR (.unit) src1 (usint), src2 (xusint), dst (usint) -- .unit = .S1, .S2 op field: 1b pipeline phase E1
    void Tms320C6xIss::op_or_s_1b_e1(InstructionState * instState) {
      uint32_t unsignedDst, unsignedSrc1, unsignedSrc2x;
      unsignedSrc1 = state.regfile[instState->ins.s.s][instState->ins.s.src1];
      unsignedSrc2x = state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      unsignedDst = unsignedSrc1 | unsignedSrc2x;
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] =  unsignedDst;
    }

    // Bitwise OR (.unit) src1 (scst5), src2 (xusint), dst (usint) -- .unit = .S1, .S2 op field: 1a pipeline phase E1
    void Tms320C6xIss::op_or_s_1a_e1(InstructionState * instState) {
      int32_t signedCst1;
      uint32_t unsignedDst, unsignedSrc2x;
      signedCst1 = SIGN_EXTEND((int32_t) instState->ins.s.src1, 5);
      unsignedSrc2x = state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      unsignedDst = signedCst1 | unsignedSrc2x;
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] =  unsignedDst;
    }

    // ET Set Bit Fields of src2 whose bounds are given by 5-9 & 0-4 of src1  (.unit) src1 (usint), src2 (xusint), dst (usint) -- .unit = .S1, .S2 op field: 3b pipeline phase E1
    void Tms320C6xIss::op_set_s_3b_e1(InstructionState * instState) {
      uint32_t unsignedDst, unsignedSrc1, unsignedSrc2x; 
      int32_t tmpcount;
      unsignedSrc1 = state.regfile[instState->ins.s.s][instState->ins.s.src1];
      unsignedSrc2x = state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      unsignedDst = unsignedSrc2x;
      for (tmpcount  = ((unsignedSrc1 >> 5) & 0x1f);
	   tmpcount <= (int32_t) ((unsignedSrc1 >> 0) & 0x1f);
	   tmpcount++)
	unsignedDst = unsignedDst | (0x01 << tmpcount);
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] =  unsignedDst;
    }

