TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
    // SHL Shift Left by amount given in src1  (.unit) src1 (usint), src2 (xsint), dst (sint) -- .unit = .S1, .S2 op field: 33 pipeline phase E1
    void Tms320C6xIss::op_shl_s_33_e1(InstructionState * instState) {
      uint32_t unsignedSrc1;
      int32_t signedDst, signedSrc2x; 
      uint32_t unsignedTmp;
      unsignedSrc1 = state.regfile[instState->ins.s.s][instState->ins.s.src1];
      signedSrc2x = (int32_t) state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      unsignedTmp = unsignedSrc1 & 0x3f;
      unsignedTmp = (unsignedTmp < 40) ? unsignedTmp : 40;
      signedDst = signedSrc2x << unsignedTmp;
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] =  signedDst;
    }

    // SHL Shift Left by amount given in src1  (.unit) src1 (usint), src2 (slong), dst (slong) -- .unit = .S1, .S2 op field: 31 pipeline phase E1
    void Tms320C6xIss::op_shl_s_31_e1(InstructionState * instState) {
      int64_t signedLongSrc2, signedLongDst; 
      uint32_t unsignedSrc1;
      uint32_t unsignedTmp;
      uint32_t tmplong;
      unsignedSrc1 = state.regfile[instState->ins.s.s][instState->ins.s.src1];
      tmplong = ((uint64_t) state.regfile[instState->ins.s.s][instState->ins.s.src2+1] & 0xff) << 32;
      tmplong = tmplong  | (uint64_t) state.regfile[instState->ins.s.s][instState->ins.s.src2];
      signedLongSrc2 = SIGN_EXTEND_LONG((int64_t) tmplong, 40);
      unsignedTmp = unsignedSrc1 & 0x3f;
      unsignedTmp = (unsignedTmp <= 40) ? unsignedTmp : 40;
      signedLongDst = signedLongSrc2 << unsignedTmp;
      // long result is written over 2 registers
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst+1] = signedLongDst >> 32 & 0x000000ff;
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] = signedLongDst;
    }

    // SHL Shift Left by amount given in src1  (.unit) src1 (usint), src2 (xusint), dst (uslong) -- .unit = .S1, .S2 op field: 13 pipeline phase E1
    void Tms320C6xIss::op_shl_s_13_e1(InstructionState * instState) {
      uint64_t unsignedLongDst; 
      uint32_t unsignedSrc1, unsignedSrc2x; 
      uint32_t unsignedTmp;
      unsignedSrc1 = state.regfile[instState->ins.s.s][instState->ins.s.src1];
      unsignedSrc2x = state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      unsignedTmp = unsignedSrc1 & 0x3f;
      unsignedTmp = (unsignedTmp < 40) ? unsignedTmp : 40;
      unsignedLongDst = ((uint64_t) unsignedSrc2x) << unsignedTmp; 
      // long result is written over 2 registers
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst+1] = unsignedLongDst >> 32 & 0x000000ff;
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] = unsignedLongDst;
    }

    // SHL Shift Left by amount given in src1  (.unit) src1 (ucst5), src2 (xsint), dst (sint) -- .unit = .S1, .S2 op field: 32 pipeline phase E1
    void Tms320C6xIss::op_shl_s_32_e1(InstructionState * instState) {
      uint32_t unsignedCst1;
      int32_t signedDst, signedSrc2x;
      unsignedCst1 = instState->ins.s.src1;
      signedSrc2x = (int32_t) state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      signedDst = signedSrc2x << unsignedCst1;
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] =  signedDst;
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " shl operand: " << unsignedCst1 << " " <<  signedSrc2x 
         << " shl instruction result: " << signedDst << std::dec << " (" << (int) signedDst << ")" << std::endl;
#endif
    }

    // SHL Shift Left by amount given in src1  (.unit) src1 (ucst5), src2 (slong), dst (slong) -- .unit = .S1, .S2 op field: 30 pipeline phase E1
    void Tms320C6xIss::op_shl_s_30_e1(InstructionState * instState) {
      int64_t signedLongDst, signedLongSrc2; 
      uint32_t unsignedCst1; 
      uint32_t tmplong;
      unsignedCst1 = instState->ins.s.src1;
      tmplong = ((uint64_t) state.regfile[instState->ins.s.s][instState->ins.s.src2+1] & 0xff) << 32;
      tmplong = tmplong  | (uint64_t) state.regfile[instState->ins.s.s][instState->ins.s.src2];
      signedLongSrc2 = SIGN_EXTEND_LONG((int64_t) tmplong, 40);
      signedLongDst = signedLongSrc2 << unsignedCst1;
      // long result is written over 2 registers
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst+1] = signedLongDst >> 32 & 0x000000ff;
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] = signedLongDst;
    }

    // SHL Shift Left by amount given in src1  (.unit) src1 (ucst5), src2 (xusint), dst (uslong) -- .unit = .S1, .S2 op field: 12 pipeline phase E1
    void Tms320C6xIss::op_shl_s_12_e1(InstructionState * instState) {
      uint64_t unsignedLongDst; 
      uint32_t unsignedCst1, unsignedSrc2x;
      unsignedCst1 = instState->ins.s.src1;
      unsignedSrc2x = state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      unsignedLongDst = ((uint64_t) unsignedSrc2x) << unsignedCst1;
      // long result is written over 2 registers
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst+1] = unsignedLongDst >> 32 & 0x000000ff;
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] = unsignedLongDst;
    }

    // SHL Shift Left by amount given in src1  (.unit) src1 (usint), src2 (xsint), dst (sint) -- .unit = .S1, .S2 op field: 37 pipeline phase E1
    void Tms320C6xIss::op_shr_s_37_e1(InstructionState * instState) {
      uint32_t  unsignedSrc1 ;
      int32_t signedDst, signedSrc2x; 
      uint32_t unsignedTmp;
      unsignedSrc1 = state.regfile[instState->ins.s.s][instState->ins.s.src1];
      signedSrc2x = (int32_t) state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      unsignedTmp = unsignedSrc1 & 0x3f;
      unsignedTmp = (unsignedTmp < 40) ? unsignedTmp : 40;
      signedDst = signedSrc2x >> unsignedTmp;
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] =  signedDst;
    }

    // SHL Shift Left by amount given in src1  (.unit) src1 (usint), src2 (slong), dst (slong) -- .unit = .S1, .S2 op field: 35 pipeline phase E1
    void Tms320C6xIss::op_shr_s_35_e1(InstructionState * instState) {
      int64_t signedLongDst, signedLongSrc2; 
      uint32_t unsignedSrc1;
      uint32_t unsignedTmp;
      uint32_t tmplong;
      unsignedSrc1 = state.regfile[instState->ins.s.s][instState->ins.s.src1];
      tmplong = ((uint64_t) state.regfile[instState->ins.s.s][instState->ins.s.src2+1] & 0xff) << 32;
      tmplong = tmplong  | (uint64_t) state.regfile[instState->ins.s.s][instState->ins.s.src2];
      signedLongSrc2 = SIGN_EXTEND_LONG((int64_t) tmplong, 40);
      unsignedTmp = unsignedSrc1 & 0x3f;
      unsignedTmp = (unsignedTmp < 40) ? unsignedTmp : 40;
      signedLongDst = signedLongSrc2 >> unsignedTmp;
      // long result is written over 2 registers
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst+1] = signedLongDst >> 32 & 0x000000ff;
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] = signedLongDst;
    }

    // SHL Shift Left by amount given in src1  (.unit) src1 (ucst5), src2 (xsint), dst (sint) -- .unit = .S1, .S2 op field: 36 pipeline phase E1
    void Tms320C6xIss::op_shr_s_36_e1(InstructionState * instState) {
      uint32_t unsignedCst1;
      int32_t signedDst, signedSrc2x;
      unsignedCst1 = instState->ins.s.src1;
      signedSrc2x = (int32_t) state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      signedDst = signedSrc2x >> unsignedCst1;
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] =  signedDst;
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " shr operand: " 
	 << unsignedCst1 << " (" << std::dec << (int) unsignedCst1 << ") " << std::hex
	 << signedSrc2x << " (" << std::dec << (int) signedSrc2x << ") " << std::hex
         << " shr instruction result: " << signedDst << std::dec << " (" << (int) signedDst << ")" << std::endl;
#endif
    }

    // SHL Shift Left by amount given in src1  (.unit) src1 (ucst5), src2 (slong), dst (slong) -- .unit = .S1, .S2 op field: 34 pipeline phase E1
    void Tms320C6xIss::op_shr_s_34_e1(InstructionState * instState) {
      int64_t signedLongDst, signedLongSrc2;
      uint32_t unsignedCst1;
      uint32_t tmplong;
      unsignedCst1 = instState->ins.s.src1;
      tmplong = ((uint64_t) state.regfile[instState->ins.s.s][instState->ins.s.src2+1] & 0xff) << 32;
      tmplong = tmplong  | (uint64_t) state.regfile[instState->ins.s.s][instState->ins.s.src2];
      signedLongSrc2 = SIGN_EXTEND_LONG((int64_t) tmplong, 40);
      signedLongDst = signedLongSrc2 >> unsignedCst1;
      // long result is written over 2 registers
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst+1] = signedLongDst >> 32 & 0x000000ff;
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] = signedLongDst;
    }

