TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
    // SHRU Shift Right by amount given in src1  (.unit) src1 (usint), src2 (xusint), dst (usint) -- .unit = .S1, .S2 op field: 27 pipeline phase E1
    void Tms320C6xIss::op_shru_s_27_e1(InstructionState * instState) {
      uint32_t unsignedDst, unsignedSrc1, unsignedSrc2x; 
      uint32_t unsignedTmp;
      unsignedSrc1 = state.regfile[instState->ins.s.s][instState->ins.s.src1];
      unsignedSrc2x = state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      unsignedTmp = unsignedSrc1 & 0x3f;
      unsignedTmp = (unsignedTmp < 40) ? unsignedTmp : 40;
      unsignedDst = unsignedSrc2x >> unsignedTmp;
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] =  unsignedDst;
    }

    // SHRU Shift Right by amount given in src1  (.unit) src1 (usint), src2 (uslong), dst (uslong) -- .unit = .S1, .S2 op field: 25 pipeline phase E1
    void Tms320C6xIss::op_shru_s_25_e1(InstructionState * instState) {
      uint64_t unsignedLongDst, unsignedLongSrc2; 
      uint32_t unsignedSrc1; 
      uint32_t unsignedTmp;
      unsignedSrc1 = state.regfile[instState->ins.s.s][instState->ins.s.src1];
      unsignedLongSrc2 = ((uint64_t) state.regfile[instState->ins.s.s][instState->ins.s.src2+1] & 0xff) << 32;
      unsignedLongSrc2 = unsignedLongSrc2 | (uint64_t) state.regfile[instState->ins.s.s][instState->ins.s.src2];
      unsignedTmp = unsignedSrc1 & 0x3f;
      unsignedTmp = (unsignedTmp < 40) ? unsignedTmp : 40;
      unsignedLongDst = unsignedLongSrc2 >> unsignedTmp;
      // long result is written over 2 registers
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst+1] = unsignedLongDst >> 32 & 0x000000ff;
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] = unsignedLongDst;
    }

    // SHRU Shift Right by amount given in src1  (.unit) src1 (ucst5), src2 (xusint), dst (usint) -- .unit = .S1, .S2 op field: 65 pipeline phase E1
    void Tms320C6xIss::op_shru_s_26_e1(InstructionState * instState) {
      uint32_t unsignedDst, unsignedCst1, unsignedSrc2x;
      unsignedCst1 = instState->ins.s.src1;
      unsignedSrc2x = state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      unsignedDst = unsignedSrc2x >> unsignedCst1;
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] =  unsignedDst;
    }

    // SHRU Shift Right by amount given in src1  (.unit) src1 (ucst5), src2 (uslong), dst (uslong) -- .unit = .S1, .S2 op field: 24 pipeline phase E1
    void Tms320C6xIss::op_shru_s_24_e1(InstructionState * instState) {
      uint64_t unsignedLongDst, unsignedLongSrc2; 
      uint32_t unsignedCst1;
      unsignedCst1 = instState->ins.s.src1;
      unsignedLongSrc2 = ((uint64_t) state.regfile[instState->ins.s.s][instState->ins.s.src2+1] & 0xff) << 32;
      unsignedLongSrc2 = unsignedLongSrc2 | (uint64_t) state.regfile[instState->ins.s.s][instState->ins.s.src2];
      unsignedLongDst = unsignedLongSrc2 >> unsignedCst1;
      // long result is written over 2 registers
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst+1] = unsignedLongDst >> 32 & 0x000000ff;
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] = unsignedLongDst;
    }

    // SSHL Shift Left with Saturation  (.unit) src1 (usint), src2 (xsint), dst (sint) -- .unit = .S1, .S2 op field: 23 pipeline phase E1
    void Tms320C6xIss::op_sshl_s_23_e1(InstructionState * instState) {
      int32_t signedDst = 0, signedSrc2x; 
      uint32_t unsignedSrc1;
      uint32_t unsignedTmp; uint8_t tmpchar; 
      int32_t tmpcount;
      unsignedSrc1 = state.regfile[instState->ins.s.s][instState->ins.s.src1];
      signedSrc2x = (int32_t) state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      unsignedTmp = unsignedSrc1 & 0x1f;
      tmpchar = signedSrc2x >> 31 & 0x01;
      for(tmpcount=31 ; tmpcount <= (int32_t) (31-unsignedTmp) ; tmpcount--)
	if (((signedSrc2x >> tmpcount) & 0x01) != tmpchar)
	  break;
      if ((uint32_t) tmpcount == (31-unsignedTmp-1))
	signedDst = signedSrc2x << unsignedTmp;
      else if (signedSrc2x > 0)
	signedDst = 0x7fffffff;
      else if (signedSrc2x < 0)
	signedDst = 0x80000000;

      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] =  signedDst;
    }

    // SSHL Shift Left with Saturation  (.unit) src1 (ucst5), src2 (xsint), dst (sint) -- .unit = .S1, .S2 op field: 22 pipeline phase E1
    void Tms320C6xIss::op_sshl_s_22_e1(InstructionState * instState) {
      int32_t signedDst = 0, signedSrc2x; 
      uint32_t unsignedCst1; 
      uint32_t unsignedTmp; 
      uint8_t tmpchar; 
      int32_t tmpcount;
      unsignedCst1 = instState->ins.s.src1;
      signedSrc2x = (int32_t) state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      unsignedTmp = unsignedCst1;
      tmpchar = signedSrc2x >> 31 & 0x01;
      for(tmpcount=31 ; tmpcount <= (int32_t) (31-unsignedTmp) ; tmpcount--)
	if (((signedSrc2x >> tmpcount) & 0x01) != tmpchar)
	  break;
      if ((uint32_t) tmpcount == (31-unsignedTmp-1))
	signedDst = signedSrc2x << unsignedTmp;
      else if (signedSrc2x > 0)
	signedDst = 0x7fffffff;
      else if (signedSrc2x < 0)
	signedDst = 0x80000000;

      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] =  signedDst;
    }

    // SUB without saturation  (.unit) src1 (sint), src2 (xsint), dst (sint) -- .unit = .S1, .S2 op field: 17 pipeline phase E1
    void Tms320C6xIss::op_sub_s_17_e1(InstructionState * instState) {
      int32_t signedDst, signedSrc1, signedSrc2x;
      signedSrc1 = (int32_t) state.regfile[instState->ins.s.s][instState->ins.s.src1];
      signedSrc2x = (int32_t) state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      signedDst = signedSrc1 - signedSrc2x;
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] =  signedDst;
    }

    // SUB without saturation  (.unit) src1 (scst5), src2 (xsint), dst (sint) -- .unit = .S1, .S2 op field: 16 pipeline phase E1
    void Tms320C6xIss::op_sub_s_16_e1(InstructionState * instState) {
      int32_t signedDst, signedCst1, signedSrc2x;
      signedCst1 = SIGN_EXTEND((int32_t) instState->ins.s.src1, 5);
      signedSrc2x = (int32_t) state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      signedDst = signedCst1 - signedSrc2x;
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] =  signedDst;
    }

    // SUB2 Subtractions of lower and upper halfs  (.unit) src1 (sint), src2 (xsint), dst (sint) -- .unit = .S1, .S2 op field: 11 pipeline phase E1
    void Tms320C6xIss::op_sub2_s_11_e1(InstructionState * instState) {
      int32_t signedDst, signedSrc1, signedSrc2x;
      signedSrc1 = (int32_t) state.regfile[instState->ins.s.s][instState->ins.s.src1];
      signedSrc2x = (int32_t) state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      signedDst =  ((SLSB16(signedSrc1) - SLSB16(signedSrc2x)) & 0xffff) |
	((MSB16(signedSrc1) - MSB16(signedSrc2x)) << 16);
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] =  signedDst;
    }

