TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
    // XOR (.unit) src1 (usint), src2 (xusint), dst (usint) -- .unit = .S1, .S2 op field: 0b pipeline phase E1
    void Tms320C6xIss::op_xor_s_0b_e1(InstructionState * instState) {
      uint32_t unsignedDst, unsignedSrc1, unsignedSrc2x;
      unsignedSrc1 = state.regfile[instState->ins.s.s][instState->ins.s.src1];
      unsignedSrc2x = state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      unsignedDst = unsignedSrc1 ^ unsignedSrc2x;
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] =  unsignedDst;
    }

    // XOR (.unit) src1 (scst5), src2 (xusint), dst (usint) -- .unit = .S1, .S2 op field: 0a pipeline phase E1
    void Tms320C6xIss::op_xor_s_0a_e1(InstructionState * instState) {
      uint32_t unsignedDst, unsignedSrc2x; 
      int32_t signedCst1;
      signedCst1 = SIGN_EXTEND((int32_t) instState->ins.s.src1, 5);
      unsignedSrc2x = state.regfile[instState->ins.s.s ^ instState->ins.s.x][instState->ins.s.src2];
      unsignedDst = signedCst1 ^ unsignedSrc2x;
      state.regfile_temp[instState->ins.s.s][instState->ins.s.dst] =  unsignedDst;
    }

    void Tms320C6xIss::op_illegal_s_e1(InstructionState * instState) {
      std::cerr << "Warning: unknown instruction with opcode "<< std::hex << instState->ins.s.op << std::dec 
		<< " in .S unit in E1 pipeline phase @ " << m_exec_cycles <<  " cycle, instruction is " 
		<< std::hex << instState->ins.ins 
		<< " PC is " << state.DCE1.getPC() << std::dec << std::endl;
    }


    // ADDK Add Signed 16-Bit Constant to Register ADDK (.unit) cst (cst16), dst (usint) .unit = .S1 or .S2 op field: a pipeline phase E1
    void Tms320C6xIss::op_addk_s_addk_e1(InstructionState * instState) {
      int32_t signedTmp; 
      uint32_t unsignedDst;
      signedTmp = (int32_t) instState->ins.s_addk.cst;
      signedTmp = SIGN_EXTEND(signedTmp,16);
      unsignedDst = state.regfile[instState->ins.s_addk.s][instState->ins.s_addk.dst] + signedTmp;
      state.regfile_temp[instState->ins.s.s][instState->ins.s_addk.dst] =  unsignedDst;
    }

    // Branch Using a Displacement (.unit) label .unit = .S1 or .S2 
    void Tms320C6xIss::op_bcond_s_bcond_e1(InstructionState * instState) {
      int32_t signedTmp;
      signedTmp = (int32_t) instState->ins.s_bcond.cst; 
      signedTmp = SIGN_EXTEND(signedTmp,21); 
      signedTmp = (signedTmp << 2) + (state.DCE1.getPC() & FETCH_MASK);
      state.PG.setBranchAddress(signedTmp);
      state.PG.setBranchFlag(true);
    }

    // CLR Clear Bit Fields of src2 whose bounds are given by csta & cstb (.unit) cst (cst5), dst (usint) .unit = .S1 or .S2 op field: 03 pipeline phase E1
    void Tms320C6xIss::op_clr_s_immed_03_e1(InstructionState * instState) {
      uint32_t unsignedDst, unsignedSrc2; 
      int32_t tmpCount;
      unsignedSrc2 = state.regfile[instState->ins.s_immed.s][instState->ins.s_immed.src2];
      unsignedDst = unsignedSrc2;
      for (tmpCount  = instState->ins.s_immed.csta;
	   (uint32_t) tmpCount <= instState->ins.s_immed.cstb;
	   tmpCount++)
	unsignedDst = unsignedDst & clearbit[tmpCount];
      state.regfile_temp[instState->ins.s_immed.s][instState->ins.s_immed.dst] =  unsignedDst;
    }

    // EXT Extract & Sign Extend a bit field whose bounds are given by csta & cstb, src2 (sint), dst (sint) unit = .S1 or .S2 op field: 01 pipeline phase E1
    void Tms320C6xIss::op_ext_s_immed_01_e1(InstructionState * instState) {
      int32_t signedDst, signedSrc2;
      signedSrc2 = (int32_t) state.regfile[instState->ins.s_immed.s][instState->ins.s_immed.src2];
      signedDst = signedSrc2 << instState->ins.s_immed.csta;
      signedDst = signedDst >> instState->ins.s_immed.cstb;
      state.regfile_temp[instState->ins.s_immed.s][instState->ins.s_immed.dst] =  signedDst;
    }

    // EXTU Extract & Zero Extend a bit field whose bounds are given by csta & cstb, src2 (usint), dst (usint) unit = .S1 or .S2 op field: 00 pipeline phase E1
    void Tms320C6xIss::op_extu_s_immed_00_e1(InstructionState * instState) {
      uint32_t unsignedDst; 
      int32_t signedSrc2;
      signedSrc2 = (int32_t) state.regfile[instState->ins.s_immed.s][instState->ins.s_immed.src2];
      unsignedDst = signedSrc2 << instState->ins.s_immed.csta;
      unsignedDst = unsignedDst >> instState->ins.s_immed.cstb;
      state.regfile_temp[instState->ins.s_immed.s][instState->ins.s_immed.dst] =  unsignedDst;
    }

    // SET Set Bit Fields  whose bounds are given by csta & cstb, src2 (usint), dst (usint) unit = .S1 or .S2 op field: a pipeline phase E1
    void Tms320C6xIss::op_set_s_immed_02_e1(InstructionState * instState) {
      uint32_t unsignedDst, unsignedSrc2; 
      int32_t tmpcount;
      unsignedSrc2 = state.regfile[instState->ins.s_immed.s][instState->ins.s_immed.src2];
      unsignedDst = unsignedSrc2;
      for (tmpcount  = instState->ins.s_immed.csta;
	   (uint32_t) tmpcount <= instState->ins.s_immed.cstb;
	   tmpcount++)
	unsignedDst = unsignedDst | (0x01 << tmpcount);
      state.regfile_temp[instState->ins.s_immed.s][instState->ins.s_immed.dst] =  unsignedDst;
    }

    // MVK Move a 16bit signed constant into a Register & Sign Extend cst (scst16), dst (sint) unit = .S1 or .S2 op field: a pipeline phase E1
    void Tms320C6xIss::op_mvk_s_mvk_00_e1(InstructionState * instState) {
      int32_t signedDst;
      signedDst = (int32_t) instState->ins.s_mvk.cst;
      signedDst = SIGN_EXTEND(signedDst,16);
      state.regfile_temp[instState->ins.s_mvk.s][instState->ins.s_mvk.dst] =  signedDst;
    }

    // MVK Move a 16bit signed constant into the Upper Bits of a Register  cst (scst16), dst (sint) unit = .S1 or .S2 op field: a pipeline phase E1
    void Tms320C6xIss::op_mvkh_s_mvk_01_e1(InstructionState * instState) {
      int32_t signedDst;
      signedDst = (int32_t) state.regfile[instState->ins.s_mvk.s][instState->ins.s_mvk.dst];
      signedDst = (signedDst & 0x0000ffff) | (instState->ins.s_mvk.cst << 16);
      state.regfile_temp[instState->ins.s_mvk.s][instState->ins.s_mvk.dst] =  signedDst;

