TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
    }

    //
    //
    // .M unit InstructionState set
    //
    //

    //
    // E1 phase
    //

    // MPY Integer Multiply 16lsb x 16lsb  src1 (slsb16), src2 (xslsb16), dst (sint) unit = .M1 or .M2 op field: 19 pipeline phase E1
    void Tms320C6xIss::op_mpy_m_19_e1(InstructionState * instState) {
      int32_t signedSrc1, signedSrc2x, signedTmp;
      signedSrc1 = (int32_t) state.regfile[instState->ins.m.s][instState->ins.m.src1];  
      signedSrc2x = (int32_t) state.regfile[instState->ins.m.s ^ instState->ins.m.x][instState->ins.m.src2];
      signedTmp = SLSB16(signedSrc1) * SLSB16(signedSrc2x);
      instState->setResult(signedTmp); // write data in E2 phase
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy operand: " << signedSrc1 << " " <<  signedSrc2x 
         << " mpy instruction result: " << signedTmp << std::dec << " (" << (int) signedTmp << ")" << std::endl;
#endif
    }

    // MPYU Integer Multiply 16lsb x 16lsb  src1 (slsb16), src2 (xulsb16), dst (usint) unit = .M1 or .M2 op field: 1f pipeline phase E1
    void Tms320C6xIss::op_mpyu_m_1f_e1(InstructionState * instState) {
      uint32_t unsignedSrc1, unsignedSrc2x, unsignedTmp;
      unsignedSrc1 = state.regfile[instState->ins.m.s][instState->ins.m.src1]; 
      unsignedSrc2x = state.regfile[instState->ins.m.s ^ instState->ins.m.x][instState->ins.m.src2];
      unsignedTmp = ULSB16(unsignedSrc1) * ULSB16(unsignedSrc2x);
      instState->setResult(unsignedTmp); // write data in E2 phase
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
	 << " mpy operand: " << unsignedSrc1 << " " <<  unsignedSrc2x
	 << " mpy instruction result: " << unsignedTmp << std::dec << " (" << (int) unsignedTmp << ")" << std::endl;
#endif
    }

    // MPYUS Integer Multiply 16lsb x 16lsb  src1 (ulsb16), src2 (xslsb16), dst (sint) unit = .M1 or .M2 op field: 1d pipeline phase E1
    void Tms320C6xIss::op_mpyus_m_1d_e1(InstructionState * instState) {
      uint32_t unsignedSrc1; 
      int32_t signedSrc2x, signedTmp;
      unsignedSrc1 = state.regfile[instState->ins.m.s][instState->ins.m.src1];
      signedSrc2x = (int32_t) state.regfile[instState->ins.m.s ^ instState->ins.m.x][instState->ins.m.src2];
      signedTmp = ULSB16(unsignedSrc1) * SLSB16(signedSrc2x);
      instState->setResult(signedTmp); // write data in E2 phase 
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy operand: " << unsignedSrc1 << " " <<  signedSrc2x 
         << " mpy instruction result: " << signedTmp << std::dec << " (" << (int) signedTmp << ")" << std::endl;
#endif
    }

    // MPYSU Integer Multiply 16lsb x 16lsb  src1 (slsb16), src2 (xulsb16), dst (sint) unit = .M1 or .M2 op field: 1b pipeline phase E1
    void Tms320C6xIss::op_mpysu_m_1b_e1(InstructionState * instState) {
      int32_t signedSrc1; 
      uint32_t unsignedSrc2x; 
      int32_t signedTmp;
      signedSrc1 = (int32_t) state.regfile[instState->ins.m.s][instState->ins.m.src1];
      unsignedSrc2x = state.regfile[instState->ins.m.s ^ instState->ins.m.x][instState->ins.m.src2];
      signedTmp = SLSB16(signedSrc1) * ULSB16(unsignedSrc2x);
      instState->setResult(signedTmp); // write data in E2 phase 
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy operand: " << signedSrc1 << " " <<  unsignedSrc2x 
         << " mpy instruction result: " << signedTmp << std::dec << " (" << (int) signedTmp << ")" << std::endl;
#endif
    }

    // MPY Integer Multiply 16lsb x 16lsb  src1 (scst5), src2 (xslsb16), dst (sint) unit = .M1 or .M2 op field: 1b pipeline phase E1
    void Tms320C6xIss::op_mpy_m_18_e1(InstructionState * instState) {
      int32_t signedCst1, signedSrc2x, signedTmp;
      signedCst1 = SIGN_EXTEND((int32_t) instState->ins.m.src1, 5);
      signedSrc2x = (int32_t) state.regfile[instState->ins.m.s ^ instState->ins.m.x][instState->ins.m.src2];
      signedTmp = signedCst1 * SLSB16(signedSrc2x);
      instState->setResult(signedTmp); // write data in E2 phase 
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy operand: " << signedCst1 << " " << signedSrc2x 
         << " mpy instruction result: " << signedTmp << std::dec << " (" << (int) signedTmp << ")" << std::cout << std::endl;
#endif
    }

    // MPYSU Integer Multiply 16lsb x 16lsb  src1 (scst5), src2 (xulsb16), dst (sint) unit = .M1 or .M2 op field: 1e pipeline phase E1
    void Tms320C6xIss::op_mpysu_m_1e_e1(InstructionState * instState) {
      int32_t signedCst1; 
      uint32_t unsignedSrc2x; 
      int32_t signedTmp;
      signedCst1 = SIGN_EXTEND((int32_t) instState->ins.m.src1, 5);
      unsignedSrc2x = state.regfile[instState->ins.m.s ^ instState->ins.m.x][instState->ins.m.src2];
      signedTmp = signedCst1 * ULSB16(unsignedSrc2x);
      instState->setResult(signedTmp); // write data in E2 phase 
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy operand: " <<  signedCst1 << " " << unsignedSrc2x 
         << " mpy instruction result: " << signedTmp << std::dec << " (" << (int) signedTmp << ")" << std::cout << std::endl;
#endif
    }

    // MPYH Integer Multiply 16msb x 16msb   src1 (smsb16), src2 (xsmsb16), dst (sint) unit = .M1 or .M2 op field: 01 pipeline phase E1
    void Tms320C6xIss::op_mpyh_m_01_e1(InstructionState * instState) {
      int32_t signedSrc1, signedSrc2x, signedTmp;
      signedSrc1 = (int32_t) state.regfile[instState->ins.m.s][instState->ins.m.src1];
      signedSrc2x = (int32_t) state.regfile[instState->ins.m.s ^ instState->ins.m.x][instState->ins.m.src2];
      signedTmp = MSB16(signedSrc1) * MSB16(signedSrc2x);
      instState->setResult(signedTmp); // write data in E2 phase 
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy operand: " << signedSrc1 << " " <<  signedSrc2x 
         << " mpy instruction result: " << signedTmp << std::dec << " (" << (int) signedTmp << ")" << std::endl;
#endif
    }

    // MPYHU Integer Multiply 16msb x 16msb   src1 (umsb16), src2 (xumsb16), dst (sint) unit = .M1 or .M2 op field: 07 pipeline phase E1
    void Tms320C6xIss::op_mpyhu_m_07_e1(InstructionState * instState) {
      uint32_t unsignedSrc1, unsignedSrc2x, unsignedTmp;
      unsignedSrc1 = state.regfile[instState->ins.m.s][instState->ins.m.src1];
      unsignedSrc2x = state.regfile[instState->ins.m.s ^ instState->ins.m.x][instState->ins.m.src2];
      unsignedTmp = MSB16(unsignedSrc1) * MSB16(unsignedSrc2x);
      instState->setResult(unsignedTmp); // write data in E2 phase 
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy operand: " << unsignedSrc1 << " " <<  unsignedSrc2x 
         << " mpy instruction result: " << unsignedTmp << std::dec << " (" << (int) unsignedTmp << ")" << std::endl;
#endif
    }

