TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
    // MPYHUS Integer Multiply 16msb x 16msb   src1 (umsb16), src2 (xsmsb16), dst (sint) unit = .M1 or .M2 op field: 05 pipeline phase E1
    void Tms320C6xIss::op_mpyhus_m_05_e1(InstructionState * instState) {
      uint32_t unsignedSrc1; 
      int32_t signedSrc2x; int32_t signedTmp;
      unsignedSrc1 = state.regfile[instState->ins.m.s][instState->ins.m.src1];
      signedSrc2x = (int32_t) state.regfile[instState->ins.m.s ^ instState->ins.m.x][instState->ins.m.src2];
      signedTmp = MSB16(unsignedSrc1) * MSB16(signedSrc2x);
      instState->setResult(signedTmp); // write data in E2 phase 
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy operand: " << unsignedSrc1 << " " <<  signedSrc2x 
         << " mpy instruction result: " << signedTmp << std::dec << " (" << (int) signedTmp << ")" << std::endl;
#endif
    }

    // MPYHSU Integer Multiply 16msb x 16msb   src1 (smsb16), src2 (xumsb16), dst (sint) unit = .M1 or .M2 op field: 03 pipeline phase E1
    void Tms320C6xIss::op_mpyhsu_m_03_e1(InstructionState * instState) {
      int32_t signedSrc1; 
      uint32_t unsignedSrc2x; 
      int32_t signedTmp;
      signedSrc1 = (int32_t) state.regfile[instState->ins.m.s][instState->ins.m.src1];
      unsignedSrc2x = state.regfile[instState->ins.m.s ^ instState->ins.m.x][instState->ins.m.src2];
      signedTmp = MSB16(signedSrc1) * MSB16(unsignedSrc2x);
      instState->setResult(signedTmp); // write data in E2 phase 
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy operand: " << signedSrc1 << " " <<  unsignedSrc2x 
         << " mpy instruction result: " << signedTmp << std::dec << " (" << (int) signedTmp << ")" << std::endl;
#endif
    }

    // MPYHL Integer Multiply 16msb x 16lsb   src1 (smsb16), src2 (xslsb16), dst (sint) unit = .M1 or .M2 op field: 09 pipeline phase E1
    void Tms320C6xIss::op_mpyhl_m_09_e1(InstructionState * instState) {
      int32_t signedSrc1; int32_t signedSrc2x; int32_t signedTmp;
      signedSrc1 = (int32_t) state.regfile[instState->ins.m.s][instState->ins.m.src1];
      signedSrc2x = (int32_t) state.regfile[instState->ins.m.s ^ instState->ins.m.x][instState->ins.m.src2];
      signedTmp = MSB16(signedSrc1) * SLSB16(signedSrc2x);
      instState->setResult(signedTmp); // write data in E2 phase 
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy operand: " 
	 << signedSrc1 << " (" << std::dec << (int) signedSrc1 << ") " << std::hex
	 << signedSrc2x << " (" << std::dec << (int) signedSrc2x << ")" << std::hex
         << " mpy instruction result: " << signedTmp << std::dec << " (" << (int) signedTmp << ")" << std::endl;
#endif 
    }

    // MPYHLU Integer Multiply 16msb x 16lsb   src1 (umsb16), src2 (xulsb16), dst (usint) unit = .M1 or .M2 op field: 0f pipeline phase E1
    void Tms320C6xIss::op_mpyhlu_m_0f_e1(InstructionState * instState) {
      uint32_t unsignedSrc1, unsignedSrc2x, unsignedTmp;
      unsignedSrc1 = state.regfile[instState->ins.m.s][instState->ins.m.src1];
      unsignedSrc2x = state.regfile[instState->ins.m.s ^ instState->ins.m.x][instState->ins.m.src2];
      unsignedTmp = MSB16(unsignedSrc1) * ULSB16(unsignedSrc2x);
      instState->setResult(unsignedTmp); // write data in E2 phase 
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy operand: " << unsignedSrc1 << " " <<  unsignedSrc2x 
         << " mpy instruction result: " << unsignedTmp << std::dec << " (" << (int) unsignedTmp << ")" << std::endl;
#endif
    }

    // MPYHULS Integer Multiply 16msb x 16lsb   src1 (umsb16), src2 (xslsb16), dst (sint) unit = .M1 or .M2 op field: 0d pipeline phase E1
    void Tms320C6xIss::op_mpyhuls_m_0d_e1(InstructionState * instState) {
      uint32_t unsignedSrc1; 
      int32_t signedSrc2x; int32_t signedTmp;
      unsignedSrc1 = state.regfile[instState->ins.m.s][instState->ins.m.src1];
      signedSrc2x = (int32_t) state.regfile[instState->ins.m.s ^ instState->ins.m.x][instState->ins.m.src2];
      signedTmp = MSB16(unsignedSrc1) * SLSB16(signedSrc2x);
      instState->setResult(signedTmp); // write data in E2 phase 
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy operand: " << unsignedSrc1 << " " <<  signedSrc2x 
         << " mpy instruction result: " << signedTmp << std::dec << " (" << (int) signedTmp << ")" << std::endl;
#endif
    }

    // MPYHSLU Integer Multiply 16msb x 16lsb   src1 (smsb16), src2 (smsb16), dst (sint) unit = .M1 or .M2 op field: 0b pipeline phase E1
    void Tms320C6xIss::op_mpyhslu_m_0b_e1(InstructionState * instState) {
      int32_t signedSrc1; 
      uint32_t unsignedSrc2x; 
      int32_t signedTmp;
      signedSrc1 = (int32_t) state.regfile[instState->ins.m.s][instState->ins.m.src1];
      unsignedSrc2x = state.regfile[instState->ins.m.s ^ instState->ins.m.x][instState->ins.m.src2];
      signedTmp = MSB16(signedSrc1) * ULSB16(unsignedSrc2x);
      instState->setResult(signedTmp); // write data in E2 phase 
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy operand: " << signedSrc1 << " " <<  unsignedSrc2x 
         << " mpy instruction result: " << signedTmp << std::dec << " (" << (int) signedTmp << ")" << std::endl;
#endif
    }

    // MPYLH Integer Multiply 16lsb x 16msb   src1 (slsb16), src2 (slsb16), dst (sint) unit = .M1 or .M2 op field: 11 pipeline phase E1
    void Tms320C6xIss::op_mpylh_m_11_e1(InstructionState * instState) {
      int32_t signedSrc1, signedSrc2x, signedTmp;
      signedSrc1 = (int32_t) state.regfile[instState->ins.m.s][instState->ins.m.src1];
      signedSrc2x = (int32_t) state.regfile[instState->ins.m.s ^ instState->ins.m.x][instState->ins.m.src2];
      signedTmp = SLSB16(signedSrc1) * MSB16(signedSrc2x);
      instState->setResult(signedTmp); // write data in E2 phase 
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy operand: " 
	 << signedSrc1 << " (" << std::dec << (int) signedSrc1 << ") " << std::hex
	 <<  signedSrc2x  <<  "(" << std::dec << (int) signedSrc2x << ")" << std::hex
         << " mpy instruction result: " << signedTmp << std::dec << " (" << (int) signedTmp << ")" << std::endl;
#endif
    }

    // MPYLH Integer Multiply 16lsb x 16msb   src1 (ulsb16), src2 (xumsb16), dst (usint) unit = .M1 or .M2 op field: 17 pipeline phase E1
    void Tms320C6xIss::op_mpylhu_m_17_e1(InstructionState * instState) {
      uint32_t unsignedSrc1, unsignedSrc2x, unsignedTmp;
      unsignedSrc1 = state.regfile[instState->ins.m.s][instState->ins.m.src1];
      unsignedSrc2x = state.regfile[instState->ins.m.s ^ instState->ins.m.x][instState->ins.m.src2];
      unsignedTmp = ULSB16(unsignedSrc1) * MSB16(unsignedSrc2x);
      instState->setResult(unsignedTmp); // write data in E2 phase  
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy operand: " << unsignedSrc1 << " " <<  unsignedSrc2x 
         << " mpy instruction result: " << unsignedTmp << std::dec << " (" << (int) unsignedTmp << ")" << std::endl;
#endif
   }

    // MPYLUHS Integer Multiply 16lsb x 16msb   src1 (ulsb16), src2 (xsmsb16), dst (sint) unit = .M1 or .M2 op field: 15 pipeline phase E1
    void Tms320C6xIss::op_mpyluhs_m_15_e1(InstructionState * instState) {
      uint32_t unsignedSrc1; 
      int32_t signedSrc2x, signedTmp;
      unsignedSrc1 = state.regfile[instState->ins.m.s][instState->ins.m.src1];
      signedSrc2x = (int32_t) state.regfile[instState->ins.m.s ^ instState->ins.m.x][instState->ins.m.src2];
      signedTmp = ULSB16(unsignedSrc1) * MSB16(signedSrc2x);
      instState->setResult(signedTmp); // write data in E2 phase 
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy operand: " << unsignedSrc1 << " " <<  signedSrc2x 
         << " mpy instruction result: " << signedTmp << std::dec << " (" << (int) signedTmp << ")" << std::endl;
#endif
    }

    // MPYLUHS Integer Multiply 16lsb x 16msb   src1 (16msb), src2 (xumsb16), dst (sint) unit = .M1 or .M2 op field: 13 pipeline phase E1
    void Tms320C6xIss::op_mpylshu_m_13_e1(InstructionState * instState) {
      int32_t signedSrc1; 
      uint32_t unsignedSrc2x; 
      int32_t signedTmp;
      signedSrc1 = (int32_t) state.regfile[instState->ins.m.s][instState->ins.m.src1];
      unsignedSrc2x = state.regfile[instState->ins.m.s ^ instState->ins.m.x][instState->ins.m.src2];
      signedTmp = SLSB16(signedSrc1) * MSB16(unsignedSrc2x);
      instState->setResult(signedTmp); // write data in E2 phase 
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy operand: " << signedSrc1 << " " <<  unsignedSrc2x 
         << " mpy instruction result: " << signedTmp << std::dec << " (" << (int) signedTmp << ")" << std::endl;
#endif
    }

    // SMPY Integer Multiply 16lsb x 16lsb   src1 (slsb16), src2 (xslsb16), dst (sint) unit = .M1 or .M2 op field: 1a pipeline phase E1
    void Tms320C6xIss::op_smpy_m_1a_e1(InstructionState * instState) {
      int32_t signedSrc1, signedSrc2x, signedTmp;
      signedSrc1 = (int32_t) state.regfile[instState->ins.m.s][instState->ins.m.src1];
      signedSrc2x = (int32_t) state.regfile[instState->ins.m.s ^ instState->ins.m.x][instState->ins.m.src2];
      signedTmp = ( SLSB16(signedSrc1) * SLSB16(signedSrc2x) ) << 1;
      if ((uint32_t) signedTmp == 0x80000000)
	signedTmp = 0x7fffffff,
	  state.c_regfile[CSR] = state.c_regfile[CSR] | 0x00000200;
      instState->setResult(signedTmp);
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy operand: " << signedSrc1 << " " <<  signedSrc2x 
         << " mpy instruction result: " << signedTmp << std::dec << " (" << (int) signedTmp << ")" << std::endl;
#endif
    }

