TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
    // SMPYHL Integer Multiply 16msb x 16lsb   src1 (smsb16), src2 (xslsb16), dst (sint) unit = .M1 or .M2 op field: 0a pipeline phase E1
    void Tms320C6xIss::op_smpyhl_m_0a_e1(InstructionState * instState) {
      int32_t signedSrc1, signedSrc2x, signedTmp;
      signedSrc1 = (int32_t) state.regfile[instState->ins.m.s][instState->ins.m.src1];
      signedSrc2x = (int32_t) state.regfile[instState->ins.m.s ^ instState->ins.m.x][instState->ins.m.src2];
      signedTmp = ( MSB16(signedSrc1) * SLSB16(signedSrc2x) ) << 1;
      if ((uint32_t) signedTmp == 0x80000000)
	signedTmp = 0x7fffffff,
	  state.c_regfile[CSR] = state.c_regfile[CSR] | 0x00000200;
      instState->setResult(signedTmp);
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy operand: " << signedSrc1 << " " <<  signedSrc2x 
         << " mpy instruction result: " << signedTmp << std::dec << " (" << (int) signedTmp << ")" << std::endl;
#endif
    }

    // SMPYLH Integer Multiply 16lsb x 16msb   src1 (slsb16), src2 (xsmsb16), dst (sint) unit = .M1 or .M2 op field: 12 pipeline phase E1
    void Tms320C6xIss::op_smpylh_m_12_e1(InstructionState * instState) {
      int32_t signedSrc1, signedSrc2x, signedTmp;
      signedSrc1 = (int32_t) state.regfile[instState->ins.m.s][instState->ins.m.src1];
      signedSrc2x = (int32_t) state.regfile[instState->ins.m.s ^ instState->ins.m.x][instState->ins.m.src2];
      signedTmp = ( SLSB16(signedSrc1) * MSB16(signedSrc2x) ) << 1;
      if ((uint32_t) signedTmp == 0x80000000)
	signedTmp = 0x7fffffff,
	  state.c_regfile[CSR] = state.c_regfile[CSR] | 0x00000200;
      instState->setResult(signedTmp);
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy operand: " << signedSrc1 << " " <<  signedSrc2x 
	 << " mpy instruction result: " << signedTmp << std::dec << " (" << (int) signedTmp << ")" << std::endl;    
#endif
}

    // SMPYH Integer Multiply 16msb x 16msb   src1 (smsb16), src2 (xsmsb16), dst (sint) unit = .M1 or .M2 op field: 12 pipeline phase E1
    void Tms320C6xIss::op_smpyh_m_02_e1(InstructionState * instState) {
      int32_t signedSrc1, signedSrc2x, signedTmp;
      signedSrc1 = (int32_t) state.regfile[instState->ins.m.s][instState->ins.m.src1];
      signedSrc2x = (int32_t) state.regfile[instState->ins.m.s ^ instState->ins.m.x][instState->ins.m.src2];
      signedTmp = (MSB16(signedSrc1) * MSB16(signedSrc2x) ) << 1;
      if ((uint32_t) signedTmp == 0x80000000)
	signedTmp = 0x7fffffff,
	  state.c_regfile[CSR] = state.c_regfile[CSR] | 0x00000200;
      instState->setResult(signedTmp);
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy operand: " << signedSrc1 << " " <<  signedSrc2x 
         << " mpy instruction result: " << signedTmp << std::dec << " (" << (int) signedTmp << ")" << std::endl;
#endif
    }

    void Tms320C6xIss::op_illegal_m_e1(InstructionState * instState) {
      std::cerr << "Warning: unknown instruction with opcode "<< std::hex << instState->ins.m.op << std::dec 
		<< " in .M unit in E1 pipeline phase @ " << m_exec_cycles <<  " cycle, instruction is " 
		<< std::hex << instState->ins.ins 
		<< " PC is " << state.DCE1.getPC() << std::dec << std::endl;
    }

    //
    // E2 phase
    //

    // MPY Integer Multiply 16lsb x 16lsb  src1 (slsb16), src2 (xslsb16), dst (sint) unit = .M1 or .M2 op field: 19 pipeline phase E2
    void Tms320C6xIss::op_mpy_m_19_e2(InstructionState * instState) {
      uint32_t result = instState->getResult() & 0xffffffff;
      instState->setResult(result);
      state.regfile_temp[instState->ins.m.s][instState->ins.m.dst] = result;
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy instruction result: " << result << std::dec << " (" << (int) result << ")"
         << " written to register " << instState->ins.m.dst;
     if (!instState->ins.m.s)
       std::cout << " bank A" ;
     else std::cout << " bank B";
     std::cout << std::endl;
#endif   
    }

    // MPYU Integer Multiply 16lsb x 16lsb  src1 (slsb16), src2 (xulsb16), dst (usint) unit = .M1 or .M2 op field: 1f pipeline phase E2
    void Tms320C6xIss::op_mpyu_m_1f_e2(InstructionState * instState) {
      uint32_t result = instState->getResult() & 0xffffffff;
      instState->setResult(result);
      state.regfile_temp[instState->ins.m.s][instState->ins.m.dst] = result;
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy instruction result: " << result << std::dec << " (" << (int) result << ")"
         << " written to register " << instState->ins.m.dst;
     if (!instState->ins.m.s)
       std::cout << " bank A" ;
     else std::cout << " bank B";
     std::cout << std::endl;
#endif 
    }

    // MPYUS Integer Multiply 16lsb x 16lsb  src1 (ulsb16), src2 (xslsb16), dst (sint) unit = .M1 or .M2 op field: 1d pipeline phase E2
    void Tms320C6xIss::op_mpyus_m_1d_e2(InstructionState * instState) {
      uint32_t result = instState->getResult() & 0xffffffff;
      instState->setResult(result);
      state.regfile_temp[instState->ins.m.s][instState->ins.m.dst] = result;
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy instruction result: " << result << std::dec << "(" << (int) result << ")"
         << " written to register " << instState->ins.m.dst;
     if (!instState->ins.m.s)
       std::cout << " bank A" ;
     else std::cout << " bank B";
     std::cout << std::endl;
#endif     
}

    // MPYSU Integer Multiply 16lsb x 16lsb  src1 (slsb16), src2 (xulsb16), dst (sint) unit = .M1 or .M2 op field: 1b pipeline phase E1
    void Tms320C6xIss::op_mpysu_m_1b_e2(InstructionState * instState) {
      uint32_t result = instState->getResult() & 0xffffffff;
      instState->setResult(result);
      state.regfile_temp[instState->ins.m.s][instState->ins.m.dst] = result;
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy instruction result: " << result << std::dec << "(" << (int) result << ")"
         << " written to register " << instState->ins.m.dst;
     if (!instState->ins.m.s)
       std::cout << " bank A" ;
     else std::cout << " bank B";
     std::cout << std::endl;
#endif 
    }

    // MPY Integer Multiply 16lsb x 16lsb  src1 (scst5), src2 (xslsb16), dst (sint) unit = .M1 or .M2 op field: 1b pipeline phase E2
    void Tms320C6xIss::op_mpy_m_18_e2(InstructionState * instState) {
      uint32_t result = instState->getResult() & 0xffffffff;
      instState->setResult(result);
      state.regfile_temp[instState->ins.m.s][instState->ins.m.dst] = result;
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy instruction result: " << result << std::dec << " (" << (int) result << ")"
         << " written to register " << instState->ins.m.dst;
     if (!instState->ins.m.s)
       std::cout << " bank A" ;
     else std::cout << " bank B";
     std::cout << std::endl;
#endif 
    }

    // MPYSU Integer Multiply 16lsb x 16lsb  src1 (scst5), src2 (xulsb16), dst (sint) unit = .M1 or .M2 op field: 1e pipeline phase E2
    void Tms320C6xIss::op_mpysu_m_1e_e2(InstructionState * instState) {
      uint32_t result = instState->getResult() & 0xffffffff;
      instState->setResult(result);
      state.regfile_temp[instState->ins.m.s][instState->ins.m.dst] = result;
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy instruction result: " << result << std::dec << " (" << (int) result << ")"
         << " written to register " << instState->ins.m.dst;
     if (!instState->ins.m.s)
       std::cout << " bank A" ;
     else std::cout << " bank B";
     std::cout << std::endl;
#endif 
    }

    // MPYH Integer Multiply 16msb x 16msb   src1 (smsb16), src2 (xsmsb16), dst (sint) unit = .M1 or .M2 op field: 01 pipeline phase E2
    void Tms320C6xIss::op_mpyh_m_01_e2(InstructionState * instState) {
      uint32_t result = instState->getResult() & 0xffffffff;
      instState->setResult(result);
      state.regfile_temp[instState->ins.m.s][instState->ins.m.dst] = result;
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy instruction result: " << result << std::dec << " (" << (int) result << ")"
         << " written to register " << instState->ins.m.dst;
     if (!instState->ins.m.s)
       std::cout << " bank A" ;
     else std::cout << " bank B";
     std::cout << std::endl;
#endif 
    }

