TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
    // MPYHU Integer Multiply 16msb x 16msb   src1 (umsb16), src2 (xumsb16), dst (sint) unit = .M1 or .M2 op field: 07 pipeline phase E2
    void Tms320C6xIss::op_mpyhu_m_07_e2(InstructionState * instState) {
      uint32_t result = instState->getResult() & 0xffffffff;
      instState->setResult(result);
      state.regfile_temp[instState->ins.m.s][instState->ins.m.dst] = result;
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy instruction result: " << result << std::dec << " (" << (int) result << ")"
         << " written to register " << instState->ins.m.dst;
     if (!instState->ins.m.s)
       std::cout << " bank A" ;
     else std::cout << " bank B";
     std::cout << std::endl;
#endif 
    }

    // MPYHUS Integer Multiply 16msb x 16msb   src1 (umsb16), src2 (xsmsb16), dst (sint) unit = .M1 or .M2 op field: 05 pipeline phase E2
    void Tms320C6xIss::op_mpyhus_m_05_e2(InstructionState * instState) {
      uint32_t result = instState->getResult() & 0xffffffff;
      instState->setResult(result);
      state.regfile_temp[instState->ins.m.s][instState->ins.m.dst] = result;
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy instruction result: " << result << std::dec << " (" << (int) result << ")"
         << " written to register " << instState->ins.m.dst;
     if (!instState->ins.m.s)
       std::cout << " bank A" ;
     else std::cout << " bank B";
     std::cout << std::endl;
#endif 
    }

    // MPYHSU Integer Multiply 16msb x 16msb   src1 (smsb16), src2 (xumsb16), dst (sint) unit = .M1 or .M2 op field: 03 pipeline phase E2
    void Tms320C6xIss::op_mpyhsu_m_03_e2(InstructionState * instState) {
      uint32_t result = instState->getResult() & 0xffffffff;
      instState->setResult(result);
      state.regfile_temp[instState->ins.m.s][instState->ins.m.dst] = result;
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy instruction result: " << result << std::dec << " (" << (int) result << ")"
         << " written to register " << instState->ins.m.dst;
     if (!instState->ins.m.s)
       std::cout << " bank A" ;
     else std::cout << " bank B";
     std::cout << std::endl;
#endif 
    }

    // MPYHL Integer Multiply 16msb x 16lsb   src1 (smsb16), src2 (xslsb16), dst (sint) unit = .M1 or .M2 op field: 09 pipeline phase E2
    void Tms320C6xIss::op_mpyhl_m_09_e2(InstructionState * instState) {
      uint32_t result = instState->getResult() & 0xffffffff;
      instState->setResult(result);
      state.regfile_temp[instState->ins.m.s][instState->ins.m.dst] = result;
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy instruction result: " << result << std::dec << " (" << (int) result << ")"
         << " written to register " << instState->ins.m.dst;
     if (!instState->ins.m.s)
       std::cout << " bank A" ;
     else std::cout << " bank B";
     std::cout << std::endl;
#endif 
    }

    // MPYHLU Integer Multiply 16msb x 16lsb   src1 (umsb16), src2 (xulsb16), dst (usint) unit = .M1 or .M2 op field: 0f pipeline phase E2
    void Tms320C6xIss::op_mpyhlu_m_0f_e2(InstructionState * instState) {
      uint32_t result = instState->getResult() & 0xffffffff;
      instState->setResult(result);
      state.regfile_temp[instState->ins.m.s][instState->ins.m.dst] = result;
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy instruction result: " << result << std::dec << " (" << (int) result << ")"
         << " written to register " << instState->ins.m.dst;
     if (!instState->ins.m.s)
       std::cout << " bank A" ;
     else std::cout << " bank B";
     std::cout << std::endl;
#endif 
    }

    // MPYHULS Integer Multiply 16msb x 16lsb   src1 (umsb16), src2 (xslsb16), dst (sint) unit = .M1 or .M2 op field: 0d pipeline phase E2
    void Tms320C6xIss::op_mpyhuls_m_0d_e2(InstructionState * instState) {
      uint32_t result = instState->getResult() & 0xffffffff;
      instState->setResult(result);
      state.regfile_temp[instState->ins.m.s][instState->ins.m.dst] = result;
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy instruction result: " << result << std::dec << " (" << (int) result << ")"
         << " written to register " << instState->ins.m.dst;
     if (!instState->ins.m.s)
       std::cout << " bank A" ;
     else std::cout << " bank B";
     std::cout << std::endl;
#endif 
    }

    // MPYHSLU Integer Multiply 16msb x 16lsb   src1 (smsb16), src2 (smsb16), dst (sint) unit = .M1 or .M2 op field: 0b pipeline phase E2
    void Tms320C6xIss::op_mpyhslu_m_0b_e2(InstructionState * instState) {
      uint32_t result = instState->getResult() & 0xffffffff;
      instState->setResult(result);
      state.regfile_temp[instState->ins.m.s][instState->ins.m.dst] = result;
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy instruction result: " << result << std::dec << " (" << (int) result << ")"
         << " written to register " << instState->ins.m.dst;
     if (!instState->ins.m.s)
       std::cout << " bank A" ;
     else std::cout << " bank B";
     std::cout << std::endl;
#endif 
    }

    // MPYLH Integer Multiply 16lsb x 16msb   src1 (slsb16), src2 (slsb16), dst (sint) unit = .M1 or .M2 op field: 11 pipeline phase E2
    void Tms320C6xIss::op_mpylh_m_11_e2(InstructionState * instState) {
      uint32_t result = instState->getResult() & 0xffffffff;
      instState->setResult(result);
      state.regfile_temp[instState->ins.m.s][instState->ins.m.dst] = result;
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy instruction result: " << result << std::dec << " (" << (int) result << ")"
         << " written to register " << instState->ins.m.dst;
     if (!instState->ins.m.s)
       std::cout << " bank A" ;
     else std::cout << " bank B";
     std::cout << std::endl;
#endif 
    }

    // MPYLH Integer Multiply 16lsb x 16msb   src1 (ulsb16), src2 (xumsb16), dst (usint) unit = .M1 or .M2 op field: 17 pipeline phase E2
    void Tms320C6xIss::op_mpylhu_m_17_e2(InstructionState * instState) {
      uint32_t result = instState->getResult() & 0xffffffff;
      instState->setResult(result);
      state.regfile_temp[instState->ins.m.s][instState->ins.m.dst] = result;
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy instruction result: " << result << std::dec << " (" << (int) result << ")"
         << " written to register " << instState->ins.m.dst;
     if (!instState->ins.m.s)
       std::cout << " bank A" ;
     else std::cout << " bank B";
     std::cout << std::endl;
#endif 
    }

    // MPYLUHS Integer Multiply 16lsb x 16msb   src1 (ulsb16), src2 (xsmsb16), dst (sint) unit = .M1 or .M2 op field: 15 pipeline phase E2
    void Tms320C6xIss::op_mpyluhs_m_15_e2(InstructionState * instState) {
      uint32_t result = instState->getResult() & 0xffffffff;
      instState->setResult(result);
      state.regfile_temp[instState->ins.m.s][instState->ins.m.dst] =  result;
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy instruction result: " << result << std::dec << " (" << (int) result << ")"
         << " written to register " << instState->ins.m.dst;
     if (!instState->ins.m.s)
       std::cout << " bank A" ;
     else std::cout << " bank B";
     std::cout << std::endl;
#endif 
    }

    // MPYLUHS Integer Multiply 16lsb x 16msb   src1 (16msb), src2 (xumsb16), dst (sint) unit = .M1 or .M2 op field: 13 pipeline phase E2
    void Tms320C6xIss::op_mpylshu_m_13_e2(InstructionState * instState) {
      uint32_t result = instState->getResult() & 0xffffffff;
      instState->setResult(result);
      state.regfile_temp[instState->ins.m.s][instState->ins.m.dst] = result;
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy instruction result: " << result << std::dec << " (" << (int) result << ")"
         << " written to register " << instState->ins.m.dst;
     if (!instState->ins.m.s)
       std::cout << " bank A" ;
     else std::cout << " bank B";
     std::cout << std::endl;
#endif 
    }

    // SMPY Integer Multiply 16lsb x 16lsb   src1 (slsb16), src2 (xslsb16), dst (sint) unit = .M1 or .M2 op field: 1a pipeline phase E2
    void Tms320C6xIss::op_smpy_m_1a_e2(InstructionState * instState) {
      uint32_t result = instState->getResult() & 0xffffffff;
      instState->setResult(result);
      state.regfile_temp[instState->ins.m.s][instState->ins.m.dst] = result;
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy instruction result: " << result << std::dec << " (" << (int) result << ")"
         << " written to register " << instState->ins.m.dst;
     if (!instState->ins.m.s)
       std::cout << " bank A" ;
     else std::cout << " bank B";
     std::cout << std::endl;
#endif 
    }

    // SMPYHL Integer Multiply 16msb x 16lsb   src1 (smsb16), src2 (xslsb16), dst (sint) unit = .M1 or .M2 op field: 0a pipeline phase E2
    void Tms320C6xIss::op_smpyhl_m_0a_e2(InstructionState * instState) {
      uint32_t result = instState->getResult() & 0xffffffff;
      instState->setResult(result);
      state.regfile_temp[instState->ins.m.s][instState->ins.m.dst] = result;
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy instruction result: " << result << std::dec << " (" << (int) result << ")"
         << " written to register " << instState->ins.m.dst;
     if (!instState->ins.m.s)
       std::cout << " bank A" ;
     else std::cout << " bank B";
     std::cout << std::endl;
#endif
    }

