TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
    // SMPYLH Integer Multiply 16lsb x 16msb   src1 (slsb16), src2 (xsmsb16), dst (sint) unit = .M1 or .M2 op field: 12 pipeline phase E2
    void Tms320C6xIss::op_smpylh_m_12_e2(InstructionState * instState) {
      uint32_t result = instState->getResult() & 0xffffffff;
      instState->setResult(result);
      state.regfile_temp[instState->ins.m.s][instState->ins.m.dst] = result;
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy instruction result: " << result << std::dec << " (" << (int) result << ")"
         << " written to register " << instState->ins.m.dst;
     if (!instState->ins.m.s)
       std::cout << " bank A" ;
     else std::cout << " bank B"; 
     std::cout << std::endl;
#endif 
    }

    // SMPYH Integer Multiply 16msb x 16msb   src1 (smsb16), src2 (xsmsb16), dst (sint) unit = .M1 or .M2 op field: 12 pipeline phase E2
    void Tms320C6xIss::op_smpyh_m_02_e2(InstructionState * instState) {
      uint32_t result = instState->getResult() & 0xffffffff;
      instState->setResult(result);
      state.regfile_temp[instState->ins.m.s][instState->ins.m.dst] = result;
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " mpy instruction result: " << result << std::dec << " (" << (int) result << ")"
         << " written to register " << instState->ins.m.dst;
     if (!instState->ins.m.s)
       std::cout << " bank A" ;
     else std::cout << " bank B";
     std::cout << std::endl;
#endif 
    }

    void Tms320C6xIss::op_illegal_m_e2(InstructionState * instState) {
      std::cerr << "Warning: unknown instruction with opcode "<< std::hex << instState->ins.m.op << std::dec 
		<< " in .M unit in E2 pipeline phase @ " << m_exec_cycles <<  " cycle, instruction is " 
		<< std::hex << instState->ins.ins 
		<< " PC is " << state.E1E2.getPC() << std::dec << std::endl;
    }

    //
    //
    // .D unit InstructionState set
    //
    //

    //
    // E1 phase
    //

    // ADD (.unit) src1 (sint), src2 (sint), dst (sint) -- .unit = .D1, .D2 op field: 10 pipeline phase E1
    void Tms320C6xIss::op_add_d_10_e1(InstructionState * instState) {
      int32_t signedSrc1, signedSrc2, signedDst;
      signedSrc1 = (int32_t) state.regfile[instState->ins.d.s][instState->ins.d.src1]; 
      signedSrc2 = (int32_t) state.regfile[instState->ins.d.s][instState->ins.d.src2]; 
      signedDst = signedSrc1 + signedSrc2;
      state.regfile_temp[instState->ins.d.s][instState->ins.d.dst] =  signedDst;
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " add operand: " 
	 << signedSrc1 << " (" << std::dec << (int) signedSrc1 << ") " << std::hex
	 << signedSrc2 << " (" << std::dec << (int) signedSrc2 << ") " << std::hex
         << " add instruction result: " << signedDst << std::dec << " (" << (int) signedDst << ")" << std::endl;
#endif 
    }

    // ADD (.unit) src1 (ucst5), src2 (sint), dst (sint) -- .unit = .D1, .D2 op field: 12 pipeline phase E1
    void Tms320C6xIss::op_add_d_12_e1(InstructionState * instState) {
      uint32_t unsignedCst1; 
      int32_t signedSrc2, signedDst;
      unsignedCst1 = instState->ins.d.src1;
      signedSrc2 = (int32_t) state.regfile[instState->ins.d.s][instState->ins.d.src2]; 
      signedDst = unsignedCst1 + signedSrc2;
      state.regfile_temp[instState->ins.d.s][instState->ins.d.dst] =  signedDst;
    }

    // ADDAB Add Byte with Addressing (.unit) src1 (sint), src2 (sint), dst (sint) -- .unit = .D1, .D2 op field: 30 pipeline phase E1
    void Tms320C6xIss::op_addab_d_30_e1(InstructionState * instState) {
      int32_t signedSrc1, signedSrc2, signedDst;
      signedSrc1 = (int32_t) state.regfile[instState->ins.d.s][instState->ins.d.src1]; 
      signedSrc2 = (int32_t) state.regfile[instState->ins.d.s][instState->ins.d.src2]; 
      signedSrc1 = signedSrc1 << 0;
      if (instState->ins.d.src2 >=4 && instState->ins.d.src2 <= 7) {
	// use of circular addressing ?
	switch (ADDRESSING_MODE(instState->ins.d.src2,instState->ins.d.s)) {
	case 0x1 :
	  // circular addressing with BK0
	  signedSrc1 = signedSrc1 % power2[BK0+1];
	  break;
	case 0x2 :
	  // circular addressing with BK1
	  signedSrc1 = signedSrc1 % power2[BK1+1];
	  break;
	default :
	  break;
	}
      }
      signedDst = signedSrc2 + signedSrc1;
      state.regfile_temp[instState->ins.d.s][instState->ins.d.dst] =  signedDst;
    }

    // ADDAH Add Half Word with Addressing (.unit) src1 (sint), src2 (sint), dst (sint) -- .unit = .D1, .D2 op field: 34 pipeline phase E1
    void Tms320C6xIss::op_addah_d_34_e1(InstructionState * instState) {
      int32_t signedSrc1, signedSrc2, signedDst;
      signedSrc1 = (int32_t) state.regfile[instState->ins.d.s][instState->ins.d.src1]; 
      signedSrc2 = (int32_t) state.regfile[instState->ins.d.s][instState->ins.d.src2]; 
      signedSrc1 = signedSrc1 << 1;
      if (instState->ins.d.src2 >=4 && instState->ins.d.src2 <= 7) {
	// use of circular addressing ?
	switch (ADDRESSING_MODE(instState->ins.d.src2,instState->ins.d.s)) {
	case 0x1 :
	  // circular addressing with BK0
	  signedSrc1 = signedSrc1 % power2[BK0+1];
	  break;
	case 0x2 :
	  // circular addressing with BK1
	  signedSrc1 = signedSrc1 % power2[BK1+1];
	  break;
	default :
	  break;
	}
      }
      signedDst = signedSrc2 + signedSrc1;
      state.regfile_temp[instState->ins.d.s][instState->ins.d.dst] =  signedDst;
    }

    // ADDAW Add Word with Addressing  (.unit) src1 (sint), src2 (sint), dst (sint) -- .unit = .D1, .D2 op field: 38 pipeline phase E1
    void Tms320C6xIss::op_addaw_d_38_e1(InstructionState * instState) {
      int32_t signedSrc1, signedSrc2, signedDst;
      signedSrc1 = (int32_t) state.regfile[instState->ins.d.s][instState->ins.d.src1]; 
      signedSrc2 = (int32_t) state.regfile[instState->ins.d.s][instState->ins.d.src2]; 
      signedSrc1 = signedSrc1 << 2;
      if (instState->ins.d.src2 >=4 && instState->ins.d.src2 <= 7) {
	// use of circular addressing ?
	switch (ADDRESSING_MODE(instState->ins.d.src2,instState->ins.d.s)) {
	case 0x1 :
	  // circular addressing with BK0
	  signedSrc1 = signedSrc1 % power2[BK0+1];
	  break;
	case 0x2 :
	  // circular addressing with BK1
	  signedSrc1 = signedSrc1 % power2[BK1+1];
	  break;
	default :
	  break;
	}
      }
      signedDst = signedSrc2 + signedSrc1;
      state.regfile_temp[instState->ins.d.s][instState->ins.d.dst] =  signedDst;
    }

