TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
    // ADDAB Add Byte with Addressing (.unit) src1 (ucsut5), src2 (sint), dst (sint) -- .unit = .D1, .D2 op field: 32 pipeline phase E1
    void Tms320C6xIss::op_addab_d_32_e1(InstructionState * instState) {
      uint32_t unsignedCst1; 
      int32_t signedSrc2, signedDst;
      unsignedCst1 = instState->ins.d.src1;
      signedSrc2 = (int32_t) state.regfile[instState->ins.d.s][instState->ins.d.src2];
      unsignedCst1 = unsignedCst1 << 0;
      if (instState->ins.d.src2 >=4 && instState->ins.d.src2 <= 7) {
	// use of circular addressing ?
	switch (ADDRESSING_MODE(instState->ins.d.src2,instState->ins.d.s)) {
	case 0x1 :
	  // circular addressing with BK0
	  unsignedCst1 = unsignedCst1 % power2[BK0+1];
	  break;
	case 0x2 :
	  // circular addressing with BK1
	  unsignedCst1 = unsignedCst1 % power2[BK1+1];
	  break;
	default :
	  break;
	}
      }
      signedDst = signedSrc2 + unsignedCst1;
      state.regfile_temp[instState->ins.d.s][instState->ins.d.dst] =  signedDst;
    }

    // ADDAH Add Half Word with Addressing (.unit) src1 (ucsut5), src2 (sint), dst (sint) -- .unit = .D1, .D2 op field: 32 pipeline phase E1
    void Tms320C6xIss::op_addah_d_36_e1(InstructionState * instState) {
      uint32_t unsignedCst1; 
      int32_t signedSrc2, signedDst;
      unsignedCst1 = instState->ins.d.src1;
      signedSrc2 = (int32_t) state.regfile[instState->ins.d.s][instState->ins.d.src2];
      unsignedCst1 = unsignedCst1 << 1;
      if (instState->ins.d.src2 >=4 && instState->ins.d.src2 <= 7) {
	// use of circular addressing ?
	switch (ADDRESSING_MODE(instState->ins.d.src2,instState->ins.d.s)) {
	case 0x1 :
	  // circular addressing with BK0
	  unsignedCst1 = unsignedCst1 % power2[BK0+1];
	  break;
	case 0x2 :
	  // circular addressing with BK1
	  unsignedCst1 = unsignedCst1 % power2[BK1+1];
	  break;
	default :
	  break;
	}
      }
      signedDst = signedSrc2 + unsignedCst1;
      state.regfile_temp[instState->ins.d.s][instState->ins.d.dst] =  signedDst;
    }

    // ADDAW Add Word with Addressing (.unit) src1 (ucsut5), src2 (sint), dst (sint) -- .unit = .D1, .D2 op field: 3a pipeline phase E1
    void Tms320C6xIss::op_addaw_d_3a_e1(InstructionState * instState) {
      uint32_t unsignedCst1; 
      int32_t signedSrc2, signedDst;
      unsignedCst1 = instState->ins.d.src1;
      signedSrc2 = (int32_t) state.regfile[instState->ins.d.s][instState->ins.d.src2];
      unsignedCst1 = unsignedCst1 << 2;
      if (instState->ins.d.src2 >=4 && instState->ins.d.src2 <= 7) {
	// use of circular addressing ?
	switch (ADDRESSING_MODE(instState->ins.d.src2,instState->ins.d.s)) {
	case 0x1 :
	  // circular addressing with BK0
	  unsignedCst1 = unsignedCst1 % power2[BK0+1];
	  break;
	case 0x2 :
	  // circular addressing with BK1
	  unsignedCst1 = unsignedCst1 % power2[BK1+1];
	  break;
	default :
	  break;
	}
      }
      signedDst = signedSrc2 + unsignedCst1;
      state.regfile_temp[instState->ins.d.s][instState->ins.d.dst] =  signedDst;
    }


    // SUB without saturation (.unit) src1 (sint), src2 (sint), dst (sint) -- .unit = .D1, .D2 op field: 11 pipeline phase E1
    void Tms320C6xIss::op_sub_d_11_e1(InstructionState * instState) {
      int32_t signedSrc1, signedSrc2, signedDst;
      signedSrc1 = (int32_t) state.regfile[instState->ins.d.s][instState->ins.d.src1];
      signedSrc2 = (int32_t) state.regfile[instState->ins.d.s][instState->ins.d.src2];
      signedDst = signedSrc2 - signedSrc1;
      state.regfile_temp[instState->ins.d.s][instState->ins.d.dst] =  signedDst;
    }

    // SUB without saturation (.unit) src1 (ucst5), src2 (sint), dst (sint) -- .unit = .D1, .D2 op field: 13 pipeline phase E1
    void Tms320C6xIss::op_sub_d_13_e1(InstructionState * instState) {
      uint32_t unsignedCst1; int32_t signedSrc2; int32_t signedDst;
      unsignedCst1 = instState->ins.d.src1;
      signedSrc2 = (int32_t) state.regfile[instState->ins.d.s][instState->ins.d.src2];
      signedDst = signedSrc2 - unsignedCst1;
      state.regfile_temp[instState->ins.d.s][instState->ins.d.dst] =  signedDst;
    }

    // SUBAB Subtract Byte with Addressing  (.unit) src1 (sint), src2 (sint), dst (sint) -- .unit = .D1, .D2 op field: 31 pipeline phase E1
    void Tms320C6xIss::op_subab_d_31_e1(InstructionState * instState) {
      int32_t signedSrc1, signedSrc2, signedDst;
      signedSrc1 = (int32_t) state.regfile[instState->ins.d.s][instState->ins.d.src1];
      signedSrc2 = (int32_t) state.regfile[instState->ins.d.s][instState->ins.d.src2];
      signedSrc1 = signedSrc1 << 0;
      if (instState->ins.d.src2 >=4 && instState->ins.d.src2 <= 7) {
	// use of circular addressing ?
	switch (ADDRESSING_MODE(instState->ins.d.src2,instState->ins.d.s)) {
	case 0x1 :
	  // circular addressing with BK0
	  signedSrc1 = signedSrc1 % power2[BK0+1];
	  break;
	case 0x2 :
	  // circular addressing with BK1
	  signedSrc1 = signedSrc1 % power2[BK1+1];
	  break;
	default :
	  break;
	}
      }
      signedDst = signedSrc2 - signedSrc1;
      state.regfile_temp[instState->ins.d.s][instState->ins.d.dst] =  signedDst;
    }

    // SSUBAH Subtract Half Word with Addressing   (.unit) src1 (sint), src2 (sint), dst (sint) -- .unit = .D1, .D2 op field: 31 pipeline phase E1
    void Tms320C6xIss::op_subah_d_35_e1(InstructionState * instState) {
      int32_t signedSrc1, signedSrc2, signedDst;
      signedSrc1 = (int32_t) state.regfile[instState->ins.d.s][instState->ins.d.src1];
      signedSrc2 = (int32_t) state.regfile[instState->ins.d.s][instState->ins.d.src2];
      signedSrc1 = signedSrc1 << 1;
      if (instState->ins.d.src2 >=4 && instState->ins.d.src2 <= 7) {
	// use of circular addressing ?
	switch (ADDRESSING_MODE(instState->ins.d.src2,instState->ins.d.s)) {
	case 0x1 :
	  // circular addressing with BK0
	  signedSrc1 = signedSrc1 % power2[BK0+1];
	  break;
	case 0x2 :
	  // circular addressing with BK1
	  signedSrc1 = signedSrc1 % power2[BK1+1];
	  break;
	default :
	  break;
	}
      }
      signedDst = signedSrc2 - signedSrc1;
      state.regfile_temp[instState->ins.d.s][instState->ins.d.dst] =  signedDst;
    }

    // SUBAW Subtract Word with Addressing    (.unit) src1 (sint), src2 (sint), dst (sint) -- .unit = .D1, .D2 op field: 39 pipeline phase E1
    void Tms320C6xIss::op_subaw_d_39_e1(InstructionState * instState) {
      int32_t signedSrc1, signedSrc2, signedDst;
      signedSrc1 = (int32_t) state.regfile[instState->ins.d.s][instState->ins.d.src1];
      signedSrc2 = (int32_t) state.regfile[instState->ins.d.s][instState->ins.d.src2];
      signedSrc1 = signedSrc1 << 2;
      if (instState->ins.d.src2 >=4 && instState->ins.d.src2 <= 7) {
	// use of circular addressing ?
	switch (ADDRESSING_MODE(instState->ins.d.src2,instState->ins.d.s)) {
	case 0x1 :
	  // circular addressing with BK0
	  signedSrc1 = signedSrc1 % power2[BK0+1];
	  break;
	case 0x2 :
	  // circular addressing with BK1
	  signedSrc1 = signedSrc1 % power2[BK1+1];
	  break;
	default :
	  break;
	}
      }
      signedDst = signedSrc2 - signedSrc1;
      state.regfile_temp[instState->ins.d.s][instState->ins.d.dst] =  signedDst;
    }

    // SUBAB Subtract Byte with Addressing    (.unit) src1 (ucsut5), src2 (sint), dst (sint) -- .unit = .D1, .D2 op field: 39 pipeline phase E1
    void Tms320C6xIss::op_subab_d_33_e1(InstructionState * instState) {
      uint32_t unsignedCst1; 
      int32_t signedSrc2, signedDst;
      unsignedCst1 = instState->ins.d.src1;
      signedSrc2 = (int32_t) state.regfile[instState->ins.d.s][instState->ins.d.src2];
      unsignedCst1 = unsignedCst1 << 0;
      if (instState->ins.d.src2 >=4 && instState->ins.d.src2 <= 7) {
	// use of circular addressing ?
	switch (ADDRESSING_MODE(instState->ins.d.src2,instState->ins.d.s)) {
	case 0x1 :
	  // circular addressing with BK0
	  unsignedCst1 = unsignedCst1 % power2[BK0+1];
	  break;
	case 0x2 :
	  // circular addressing with BK1
	  unsignedCst1 = unsignedCst1 % power2[BK1+1];
	  break;
	default :
	  break;
	}
      }
      signedDst = signedSrc2 - unsignedCst1;
      state.regfile_temp[instState->ins.d.s][instState->ins.d.dst] =  signedDst;
    }

