TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
    // SUBAH Subtract Half Word with Addressing    (.unit) src1 (ucsut5), src2 (sint), dst (sint) -- .unit = .D1, .D2 op field: 37 pipeline phase E1
    void Tms320C6xIss::op_subah_d_37_e1(InstructionState * instState) {
      uint32_t unsignedCst1; 
      int32_t signedSrc2, signedDst;
      unsignedCst1 = instState->ins.d.src1;
      signedSrc2 = (int32_t) state.regfile[instState->ins.d.s][instState->ins.d.src2];
      unsignedCst1 = unsignedCst1 << 1;
      if (instState->ins.d.src2 >=4 && instState->ins.d.src2 <= 7) {
	// use of circular addressing ?
	switch (ADDRESSING_MODE(instState->ins.d.src2,instState->ins.d.s)) {
	case 0x1 :
	  // circular addressing with BK0
	  unsignedCst1 = unsignedCst1 % power2[BK0+1];
	  break;
	case 0x2 :
	  // circular addressing with BK1
	  unsignedCst1 = unsignedCst1 % power2[BK1+1];
	  break;
	default :
	  break;
	}
      }
      signedDst = signedSrc2 - unsignedCst1;
      state.regfile_temp[instState->ins.d.s][instState->ins.d.dst] =  signedDst;

    }

    // SUBAW Subtract Word with Addressing     (.unit) src1 (ucsut5), src2 (sint), dst (sint) -- .unit = .D1, .D2 op field: 37 pipeline phase E1
    void Tms320C6xIss::op_subaw_d_3b_e1(InstructionState * instState) {
      uint32_t unsignedCst1; 
      int32_t signedSrc2, signedDst;
      unsignedCst1 = instState->ins.d.src1;
      signedSrc2 = (int32_t) state.regfile[instState->ins.d.s][instState->ins.d.src2];
      unsignedCst1 = unsignedCst1 << 2;
      if (instState->ins.d.src2 >=4 && instState->ins.d.src2 <= 7) {
	// use of circular addressing ?
	switch (ADDRESSING_MODE(instState->ins.d.src2,instState->ins.d.s)) {
	case 0x1 :
	  // circular addressing with BK0
	  unsignedCst1 = unsignedCst1 % power2[BK0+1];
	  break;
	case 0x2 :
	  // circular addressing with BK1
	  unsignedCst1 = unsignedCst1 % power2[BK1+1];
	  break;
	default :
	  break;
	}
      }
      signedDst = signedSrc2 - unsignedCst1;
      state.regfile_temp[instState->ins.d.s][instState->ins.d.dst] =  signedDst;
    }

    // Load Byte From Memory With a 15-Bit Unsigned Constant Offset -- LDB (.unit) *+B14/B15[ucst15], dst -- .unit = .D2  pipeline phase E1
    void Tms320C6xIss::op_ldb_d_ldstOffset_02_e1(InstructionState * instState) {
      uint32_t unsignedSrc1, address;      
      unsignedSrc1 = state.regfile[sideB][(instState->ins.d_ldstOffset.y == 0)?14:15];
      address = unsignedSrc1 + (instState->ins.d_ldstOffset.ucst15 << 0);
      instState->setAddress(address, instState->getLoadStorePosition());
      instState->setReadInstInPacket(true);
#if TMS320C62_DEBUG
     std::cout
         << m_name << std::hex
         << " load instruction: @" << address << std::dec
         << " (" << " READ_BYTE " << ")"
         << " -> rf" << std::dec << instState->ins.d_ldstOffset.dst
         << std::endl;
#endif    
    }

    // Load Byte From Memory With a 15-Bit Unsigned Constant Offset -- LDBU (.unit) *+B14/B15[ucst15], dst -- .unit = .D2  pipeline phase E1
    void Tms320C6xIss::op_ldbu_d_ldstOffset_01_e1(InstructionState * instState) {
      uint32_t unsignedSrc1, address;
      unsignedSrc1 = state.regfile[sideB][(instState->ins.d_ldstOffset.y == 0)?14:15];
      address = unsignedSrc1 + (instState->ins.d_ldstOffset.ucst15 << 0);
      instState->setAddress(address, instState->getLoadStorePosition());
      instState->setReadInstInPacket(true);
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " load instruction: @" << address << std::dec
        << " (" << " READ_BYTE " << ")"
        << " -> rf" << std::dec << instState->ins.d_ldstOffset.dst
        << std::endl;
#endif
    }

    // Load Halfword From Memory With a 15-Bit Unsigned Constant Offset -- LDH (.unit) *+B14/B15[ucst15], dst  -- .unit = .D2  pipeline phase E1
    void Tms320C6xIss::op_ldh_d_ldstOffset_04_e1(InstructionState * instState) {
      uint32_t unsignedSrc1, address;
      unsignedSrc1 = state.regfile[sideB][(instState->ins.d_ldstOffset.y == 0)?14:15];
      address = unsignedSrc1 + (instState->ins.d_ldstOffset.ucst15 << 1);
      instState->setAddress(address, instState->getLoadStorePosition());
      instState->setReadInstInPacket(true);
#if tms320c62_DEBUG
    std::cout
        << m_name << std::hex
        << " load @" << address << std::dec
        << " (" << " READ_HALF " << ")"
        << " -> rf" << std::dec << instState->ins.d_ldstOffset.dst
        << std::endl;
#endif
    }

    // Load Halfword From Memory With a 15-Bit Unsigned Constant Offset -- LDHU (.unit) *+B14/B15[ucst15], dst  -- .unit = .D2  pipeline phase E1
    void Tms320C6xIss::op_ldhu_d_ldstOffset_00_e1(InstructionState * instState) {
      uint32_t unsignedSrc1, address;
      unsignedSrc1 = state.regfile[sideB][(instState->ins.d_ldstOffset.y == 0)?14:15];
      address = unsignedSrc1 + (instState->ins.d_ldstOffset.ucst15 << 1);
      instState->setAddress(address, instState->getLoadStorePosition());
      instState->setReadInstInPacket(true);
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " load instruction: @" << address << std::dec
        << " (" << " READ_HALF " << ")"
        << " -> rf" << std::dec << instState->ins.d_ldstOffset.dst
        << std::endl;
#endif
    }

    // Load Word From Memory With a 15-Bit Unsigned Constant Offset -- LDW (.unit) *+B14/B15[ucst15], dst  -- .unit = .D2  pipeline phase E1
    void Tms320C6xIss::op_ldw_d_ldstOffset_06_e1(InstructionState * instState) {
      uint32_t unsignedSrc1, address;
      unsignedSrc1 = state.regfile[sideB][(instState->ins.d_ldstOffset.y == 0)?14:15];
      address = unsignedSrc1 + (instState->ins.d_ldstOffset.ucst15 << 2);
      instState->setAddress(address, instState->getLoadStorePosition());
      instState->setReadInstInPacket(true);
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
	<< " load instruction: @" << address << std::dec
//	<< " load instruction: @" << instState->getAddress(instState->getLoadStorePosition()) << std::dec
        << " (" << " READ_WORD " << ")"
        << " -> rf" << std::dec << instState->ins.d_ldstOffset.dst
        << std::endl;
#endif
    }

