TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
    // Store Byte to Memory With a 15-Bit Unsigned Constant Offset -- STB (.unit) src, *+B14/B15[ucst15] -- .unit = .D2  pipeline phase E1
    void Tms320C6xIss::op_stb_d_ldstOffset_03_e1(InstructionState * instState) {
      uint32_t unsignedSrc1, address, data;
      unsignedSrc1 = state.regfile[sideB][(instState->ins.d_ldstOffset.y == 0)?14:15];
      address = unsignedSrc1 + (instState->ins.d_ldstOffset.ucst15 << 0);
      data = state.regfile[instState->ins.d_ldstOffset.s][instState->ins.d_ldstOffset.dst] & 0x000000ff;
      instState->setAddress(address, instState->getLoadStorePosition());
      instState->setData(data, instState->getLoadStorePosition());
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " store instruction: @" << address 
        << ": " << data << std::dec
        << " (" << " WRITE_BYTE " << ")"
        << std::endl;
#endif
   }

    // Store Halfword to Memory With a 15-Bit Unsigned Constant Offset -- STH (.unit) src, *+B14/B15[ucst15] -- .unit = .D2  pipeline phase E1
    void Tms320C6xIss::op_sth_d_ldstOffset_05_e1(InstructionState * instState) {
      uint32_t unsignedSrc1, address, data;
      unsignedSrc1 = state.regfile[sideB][(instState->ins.d_ldstOffset.y == 0)?14:15];
      address = unsignedSrc1 + (instState->ins.d_ldstOffset.ucst15 << 1);
      data = state.regfile[instState->ins.d_ldstOffset.s][instState->ins.d_ldstOffset.dst] & 0x0000ffff;
      instState->setAddress(address, instState->getLoadStorePosition());
      instState->setData(data, instState->getLoadStorePosition());
      instState->setWriteInstInPacket(true);
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " store instruction: @" << address 
        << ": " << data << std::dec
        << " (" << " WRITE_HALF " << ")"
        << std::endl;
#endif
    }

    // Store Word to Memory With a 15-Bit Unsigned Constant Offset -- STW (.unit) src, *+B14/B15[ucst15] -- .unit = .D2  pipeline phase E1
    void Tms320C6xIss::op_stw_d_ldstOffset_07_e1(InstructionState * instState) {
      uint32_t unsignedSrc1, address, data;
      unsignedSrc1 = state.regfile[sideB][(instState->ins.d_ldstOffset.y == 0)?14:15];
      address = unsignedSrc1 + (instState->ins.d_ldstOffset.ucst15 << 2);
      data = (state.regfile[instState->ins.d_ldstOffset.s][instState->ins.d_ldstOffset.dst]);
      instState->setAddress(address, instState->getLoadStorePosition());
      instState->setData(data, instState->getLoadStorePosition());
      instState->setWriteInstInPacket(true);
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " store instruction: @" << address 
        << ": " << data << std::dec
        << " (" << " WRITE_WORD " << ")"
        << std::endl;
#endif
    }

    // Load Byte From Memory With a 5-Bit Unsigned Constant Offset or Register Offset -- .unit = .D1 or .D2  pipeline phase E1
    // LDB (.unit) *+baseR[offsetR], dst or LDB (.unit) *+baseR[ucst5], dst
    void Tms320C6xIss::op_ldb_d_ldstBaseROffset_02_e1(InstructionState * instState) {
      uint32_t unsignedCst1, address = 0; int32_t signedSrc1; int32_t signedSrc2;
      signedSrc1 = state.regfile[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.offsetR];
      signedSrc2 = state.regfile[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR];
      unsignedCst1 = instState->ins.d_ldstBaseROffset.offsetR;
      signedSrc1 = signedSrc1 << 0;
      unsignedCst1 = unsignedCst1 << 0;

      if (instState->ins.d_ldstBaseROffset.baseR >=4 && instState->ins.d_ldstBaseROffset.baseR <= 7) {
	// use of circular addressing ?
	switch (ADDRESSING_MODE(instState->ins.d_ldstBaseROffset.baseR,instState->ins.d_ldstBaseROffset.y)) {
	case 0x1 :
	  // circular addressing with BK0
	  signedSrc1 = signedSrc1 % power2[BK0+1];
	  unsignedCst1 = unsignedCst1 % power2[BK0+1];
	  break;
	case 0x2 :
	  // circular addressing with BK1
	  signedSrc1 = signedSrc1 % power2[BK1+1];
	  unsignedCst1 = unsignedCst1 % power2[BK1+1];
	  break;
	default :
	  break;
	}
      }

      switch (instState->ins.d_ldstBaseROffset.mode) {
      case 0x0 :
	address = (signedSrc2 - unsignedCst1);
	break;
      case 0x1 :
	address = (signedSrc2 + unsignedCst1);
	break;
      case 0x4 :
	address = (signedSrc2 - signedSrc1);
	break;
      case 0x5 :
	address = signedSrc2 + signedSrc1;
	break;
      case 0x8 : // predecrement
	signedSrc2 = signedSrc2 - unsignedCst1;
	address = (signedSrc2);
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0x9 : // preincrement
	signedSrc2 = signedSrc2 + unsignedCst1;
	address = (signedSrc2);
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xa : //postdecrement
	address = (signedSrc2);
	signedSrc2 = signedSrc2 - unsignedCst1;
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xb : //postincrement
	address = (signedSrc2);
	signedSrc2 = signedSrc2 + unsignedCst1;
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xc : // predecrement
	signedSrc2 = signedSrc2 - signedSrc1;
	address = (signedSrc2);
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xd : // preincrement
	signedSrc2 = signedSrc2 + signedSrc1;
	address = (signedSrc2);
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xe : //postdecrement
	address = (signedSrc2);
	signedSrc2 = signedSrc2 - signedSrc1;
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xf : //postincrement
	address = (signedSrc2);
	signedSrc2 = signedSrc2 + signedSrc1;
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      default:
	break;
      }

      instState->setAddress(address, instState->getLoadStorePosition());
      instState->setReadInstInPacket(true);
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " load instruction: @" << address << std::dec
        << " (" << " READ_BYTE " << ")"
        << " -> rf" << std::dec << instState->ins.d_ldstBaseROffset.dst
        << std::endl;
#endif    
}

    // Load Byte From Memory With a 5-Bit Unsigned Constant Offset or Register Offset  -- .unit = .D1 or .D2  pipeline phase E1
    // LDBU (.unit) *+baseR[offsetR], dst or LDBU (.unit) *+baseR[ucst5], dst
    void Tms320C6xIss::op_ldbu_d_ldstBaseROffset_01_e1(InstructionState * instState) {
      uint32_t unsignedCst1, address = 0; int32_t signedSrc1; int32_t signedSrc2;
      signedSrc1 = state.regfile[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.offsetR];
      signedSrc2 = state.regfile[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR];
      unsignedCst1 = instState->ins.d_ldstBaseROffset.offsetR;
      signedSrc1 = signedSrc1 << 0;
      unsignedCst1 = unsignedCst1 << 0;

      if (instState->ins.d_ldstBaseROffset.baseR >=4 && instState->ins.d_ldstBaseROffset.baseR <= 7) {
	// use of circular addressing ?
	switch (ADDRESSING_MODE(instState->ins.d_ldstBaseROffset.baseR,instState->ins.d_ldstBaseROffset.y)) {
	case 0x1 :
	  // circular addressing with BK0
	  signedSrc1 = signedSrc1 % power2[BK0+1];
	  unsignedCst1 = unsignedCst1 % power2[BK0+1];
	  break;
	case 0x2 :
	  // circular addressing with BK1
	  signedSrc1 = signedSrc1 % power2[BK1+1];
	  unsignedCst1 = unsignedCst1 % power2[BK1+1];
	  break;
	default :
	  break;
	}
      }

