TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
      switch (instState->ins.d_ldstBaseROffset.mode) {
      case 0x0 :
	address = (signedSrc2 - unsignedCst1);
	break;
      case 0x1 :
	address = (signedSrc2 + unsignedCst1);
	break;
      case 0x4 :
	address = (signedSrc2 - signedSrc1);
	break;
      case 0x5 :
	address = signedSrc2 + signedSrc1;
	break;
      case 0x8 : // predecrement
	signedSrc2 = signedSrc2 - unsignedCst1;
	address = (signedSrc2);
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0x9 : // preincrement
	signedSrc2 = signedSrc2 + unsignedCst1;
	address = (signedSrc2);
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xa : //postdecrement
	address = (signedSrc2);
	signedSrc2 = signedSrc2 - unsignedCst1;
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xb : //postincrement
	address = (signedSrc2);
	signedSrc2 = signedSrc2 + unsignedCst1;
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xc : // predecrement
	signedSrc2 = signedSrc2 - signedSrc1;
	address = (signedSrc2);
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xd : // preincrement
	signedSrc2 = signedSrc2 + signedSrc1;
	address = (signedSrc2);
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xe : //postdecrement
	address = (signedSrc2);
	signedSrc2 = signedSrc2 - signedSrc1;
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xf : //postincrement
	address = (signedSrc2);
	signedSrc2 = signedSrc2 + signedSrc1;
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      default:
	break;
      }

      instState->setAddress(address, instState->getLoadStorePosition());
      instState->setReadInstInPacket(true);
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " load instruction: @" << address << std::dec
        << " (" << " READ_HALF " << ")"
        << " -> rf" << std::dec << instState->ins.d_ldstBaseROffset.dst
        << std::endl;
#endif
    }

    // Load Word From Memory With a 5-Bit Unsigned Constant Offset or Register Offset -- .unit = .D1 or .D2  pipeline phase E1
    // LDW (.unit) *+baseR[offsetR], dst    -- LDW (.unit) *+baseR[ucst5], dst
    void Tms320C6xIss::op_ldw_d_ldstBaseROffset_06_e1(InstructionState * instState) {
      uint32_t unsignedCst1, address = 0; int32_t signedSrc1; int32_t signedSrc2;
      signedSrc1 = state.regfile[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.offsetR];
      signedSrc2 = state.regfile[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR];
      unsignedCst1 = instState->ins.d_ldstBaseROffset.offsetR;

      signedSrc1 = signedSrc1 << 2;
      unsignedCst1 = unsignedCst1 << 2;

      if (instState->ins.d_ldstBaseROffset.baseR >=4 && instState->ins.d_ldstBaseROffset.baseR <= 7) {
	// use of circular addressing ?
	switch (ADDRESSING_MODE(instState->ins.d_ldstBaseROffset.baseR,instState->ins.d_ldstBaseROffset.y)) {
	case 0x1 :
	  // circular addressing with BK0
	  signedSrc1 = signedSrc1 % power2[BK0+1];
	  unsignedCst1 = unsignedCst1 % power2[BK0+1];
	  break;
	case 0x2 :
	  // circular addressing with BK1
	  signedSrc1 = signedSrc1 % power2[BK1+1];
	  unsignedCst1 = unsignedCst1 % power2[BK1+1];
	  break;
	default :
	  break;
	}
      }

      switch (instState->ins.d_ldstBaseROffset.mode) {
      case 0x0 :
	address = (signedSrc2 - unsignedCst1);
	break;
      case 0x1 :
	address = (signedSrc2 + unsignedCst1);
	break;
      case 0x4 :
	address = (signedSrc2 - signedSrc1);
	break;
      case 0x5 :
	address = signedSrc2 + signedSrc1;
	break;
      case 0x8 : // predecrement
	signedSrc2 = signedSrc2 - unsignedCst1;
	address = (signedSrc2);
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0x9 : // preincrement
	signedSrc2 = signedSrc2 + unsignedCst1;
	address = (signedSrc2);
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xa : //postdecrement
	address = (signedSrc2);
	signedSrc2 = signedSrc2 - unsignedCst1;
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xb : //postincrement
	address = (signedSrc2);
	signedSrc2 = signedSrc2 + unsignedCst1;
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xc : // predecrement
	signedSrc2 = signedSrc2 - signedSrc1;
	address = (signedSrc2);
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xd : // preincrement
	signedSrc2 = signedSrc2 + signedSrc1;
	address = (signedSrc2);
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xe : //postdecrement
	address = (signedSrc2);
	signedSrc2 = signedSrc2 - signedSrc1;
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xf : //postincrement
	address = (signedSrc2);
	signedSrc2 = signedSrc2 + signedSrc1;
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      default:
	break;
      }

      instState->setAddress(address, instState->getLoadStorePosition());
      instState->setReadInstInPacket(true);
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
	<< " load instruction: @" << instState->getAddress(instState->getLoadStorePosition()) << std::dec
//         << " load instruction: @" << address << std::dec
        << " (" << " READ_WORD " << ")"
        << " -> rf" << std::dec << instState->ins.d_ldstBaseROffset.dst
        << std::endl;
#endif
    }

    // Store Byte to Memory With a 5-Bit Unsigned Constant Offset or Register Offset -- .unit = .D1 or .D2  pipeline phase E1
    // STB (.unit) src, *+baseR[offsetR] -- STB (.unit) src, *+baseR[ucst5]
    void Tms320C6xIss::op_stb_d_ldstBaseROffset_03_e1(InstructionState * instState) {
      uint32_t unsignedCst1, data, address = 0; int32_t signedSrc1; int32_t signedSrc2;
      signedSrc1 = state.regfile[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.offsetR];
      signedSrc2 = state.regfile[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR];
      unsignedCst1 = instState->ins.d_ldstBaseROffset.offsetR;
      data = state.regfile[instState->ins.d_ldstBaseROffset.s][instState->ins.d_ldstBaseROffset.dst] & 0x000000ff;

