TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
      signedSrc1 = signedSrc1 << 0;
      unsignedCst1 = unsignedCst1 << 0;

      if (instState->ins.d_ldstBaseROffset.baseR >=4 && instState->ins.d_ldstBaseROffset.baseR <= 7) {
	// use of circular addressing ?
	switch (ADDRESSING_MODE(instState->ins.d_ldstBaseROffset.baseR,instState->ins.d_ldstBaseROffset.y)) {
	case 0x1 :
	  // circular addressing with BK0
	  signedSrc1 = signedSrc1 % power2[BK0+1];
	  unsignedCst1 = unsignedCst1 % power2[BK0+1];
	  break;
	case 0x2 :
	  // circular addressing with BK1
	  signedSrc1 = signedSrc1 % power2[BK1+1];
	  unsignedCst1 = unsignedCst1 % power2[BK1+1];
	  break;
	default :
	  break;
	}
      }

      switch (instState->ins.d_ldstBaseROffset.mode) {
      case 0x0 :
	address = (signedSrc2 - unsignedCst1);
	break;
      case 0x1 :
	address = (signedSrc2 + unsignedCst1);
	break;
      case 0x4 :
	address = (signedSrc2 - signedSrc1);
	break;
      case 0x5 :
	address = signedSrc2 + signedSrc1;
	break;
      case 0x8 : // predecrement
	signedSrc2 = signedSrc2 - unsignedCst1;
	address = (signedSrc2);
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0x9 : // preincrement
	signedSrc2 = signedSrc2 + unsignedCst1;
	address = (signedSrc2);
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xa : //postdecrement
	address = (signedSrc2);
	signedSrc2 = signedSrc2 - unsignedCst1;
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xb : //postincrement
	address = (signedSrc2);
	signedSrc2 = signedSrc2 + unsignedCst1;
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xc : // predecrement
	signedSrc2 = signedSrc2 - signedSrc1;
	address = (signedSrc2);
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xd : // preincrement
	signedSrc2 = signedSrc2 + signedSrc1;
	address = (signedSrc2);
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xe : //postdecrement
	address = (signedSrc2);
	signedSrc2 = signedSrc2 - signedSrc1;
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xf : //postincrement
	address = (signedSrc2);
	signedSrc2 = signedSrc2 + signedSrc1;
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      default:
	break;
      }

      instState->setAddress(address, instState->getLoadStorePosition());
      instState->setData(data, instState->getLoadStorePosition());
      instState->setWriteInstInPacket(true);
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " store instruction: @" << address 
        << ": " << data << std::dec
        << " (" << " WRITE_BYTE " << ")"
        << std::endl;
#endif
    }

    // Store Halfword to Memory With a 5-Bit Unsigned Constant Offset or Register Offset  -- .unit = .D1 or .D2  pipeline phase E1
    // STH (.unit) src, *+baseR[offsetR] -- STH (.unit) src, *+baseR[ucst5]
    void Tms320C6xIss::op_sth_d_ldstBaseROffset_05_e1(InstructionState * instState) {
      uint32_t unsignedCst1, data, address = 0; int32_t signedSrc1; int32_t signedSrc2;
      signedSrc1 = state.regfile[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.offsetR];
      signedSrc2 = state.regfile[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR];
      unsignedCst1 = instState->ins.d_ldstBaseROffset.offsetR;
      data = state.regfile[instState->ins.d_ldstBaseROffset.s][instState->ins.d_ldstBaseROffset.dst] & 0x0000ffff;

      signedSrc1 = signedSrc1 << 1;
      unsignedCst1 = unsignedCst1 << 1;

      if (instState->ins.d_ldstBaseROffset.baseR >=4 && instState->ins.d_ldstBaseROffset.baseR <= 7) {
	// use of circular addressing ?
	switch (ADDRESSING_MODE(instState->ins.d_ldstBaseROffset.baseR,instState->ins.d_ldstBaseROffset.y)) {
	case 0x1 :
	  // circular addressing with BK0
	  signedSrc1 = signedSrc1 % power2[BK0+1];
	  unsignedCst1 = unsignedCst1 % power2[BK0+1];
	  break;
	case 0x2 :
	  // circular addressing with BK1
	  signedSrc1 = signedSrc1 % power2[BK1+1];
	  unsignedCst1 = unsignedCst1 % power2[BK1+1];
	  break;
	default :
	  break;
	}
      }

      switch (instState->ins.d_ldstBaseROffset.mode) {
      case 0x0 :
	address = (signedSrc2 - unsignedCst1);
	break;
      case 0x1 :
	address = (signedSrc2 + unsignedCst1);
	break;
      case 0x4 :
	address = (signedSrc2 - signedSrc1);
	break;
      case 0x5 :
	address = signedSrc2 + signedSrc1;
	break;
      case 0x8 : // predecrement
	signedSrc2 = signedSrc2 - unsignedCst1;
	address = (signedSrc2);
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0x9 : // preincrement
	signedSrc2 = signedSrc2 + unsignedCst1;
	address = (signedSrc2);
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xa : //postdecrement
	address = (signedSrc2);
	signedSrc2 = signedSrc2 - unsignedCst1;
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xb : //postincrement
	address = (signedSrc2);
	signedSrc2 = signedSrc2 + unsignedCst1;
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xc : // predecrement
	signedSrc2 = signedSrc2 - signedSrc1;
	address = (signedSrc2);
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xd : // preincrement
	signedSrc2 = signedSrc2 + signedSrc1;
	address = (signedSrc2);
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xe : //postdecrement
	address = (signedSrc2);
	signedSrc2 = signedSrc2 - signedSrc1;
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xf : //postincrement
	address = (signedSrc2);
	signedSrc2 = signedSrc2 + signedSrc1;
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      default:
	break;
      }

      instState->setAddress(address, instState->getLoadStorePosition());
      instState->setData(data, instState->getLoadStorePosition());
      instState->setWriteInstInPacket(true);
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " store instruction: @" << address
        << ": " << data  << std::dec
        << " (" << " WRITE_HALF " << ")"
        << std::endl;
#endif
    }

