TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
    // Store Word to Memory With a 5-Bit Unsigned Constant Offset or Register Offset  -- .unit = .D1 or .D2  pipeline phase E1
    // STW (.unit) src, *+baseR[offsetR]  -- STW (.unit) src, *+baseR[ucst5]
    void Tms320C6xIss::op_stw_d_ldstBaseROffset_07_e1(InstructionState * instState) {
      uint32_t unsignedCst1, data, address = 0; int32_t signedSrc1; int32_t signedSrc2;
      signedSrc1 = state.regfile[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.offsetR];
      signedSrc2 = state.regfile[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR];
      unsignedCst1 = instState->ins.d_ldstBaseROffset.offsetR;
      data = state.regfile[instState->ins.d_ldstBaseROffset.s][instState->ins.d_ldstBaseROffset.dst];

      signedSrc1 = signedSrc1 << 2;
      unsignedCst1 = unsignedCst1 << 2;

      if (instState->ins.d_ldstBaseROffset.baseR >=4 && instState->ins.d_ldstBaseROffset.baseR <= 7) {
	// use of circular addressing ?
	switch (ADDRESSING_MODE(instState->ins.d_ldstBaseROffset.baseR,instState->ins.d_ldstBaseROffset.y)) {
	case 0x1 :
	  // circular addressing with BK0
	  signedSrc1 = signedSrc1 % power2[BK0+1];
	  unsignedCst1 = unsignedCst1 % power2[BK0+1];
	  break;
	case 0x2 :
	  // circular addressing with BK1
	  signedSrc1 = signedSrc1 % power2[BK1+1];
	  unsignedCst1 = unsignedCst1 % power2[BK1+1];
	  break;
	default :
	  break;
	}
      }

      switch (instState->ins.d_ldstBaseROffset.mode) {
      case 0x0 :
	address = (signedSrc2 - unsignedCst1);
	break;
      case 0x1 :
	address = (signedSrc2 + unsignedCst1);
	break;
      case 0x4 :
	address = (signedSrc2 - signedSrc1);
	break;
      case 0x5 :
	address = signedSrc2 + signedSrc1;
	break;
      case 0x8 : // predecrement
	signedSrc2 = signedSrc2 - unsignedCst1;
	address = (signedSrc2);
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0x9 : // preincrement
	signedSrc2 = signedSrc2 + unsignedCst1;
	address = (signedSrc2);
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xa : //postdecrement
	address = (signedSrc2);
	signedSrc2 = signedSrc2 - unsignedCst1;
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xb : //postincrement
	address = (signedSrc2);
	signedSrc2 = signedSrc2 + unsignedCst1;
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xc : // predecrement
	signedSrc2 = signedSrc2 - signedSrc1;
	address = (signedSrc2);
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xd : // preincrement
	signedSrc2 = signedSrc2 + signedSrc1;
	address = (signedSrc2);
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xe : //postdecrement
	address = (signedSrc2);
	signedSrc2 = signedSrc2 - signedSrc1;
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      case 0xf : //postincrement
	address = (signedSrc2);
	signedSrc2 = signedSrc2 + signedSrc1;
	state.regfile_temp[instState->ins.d_ldstBaseROffset.y][instState->ins.d_ldstBaseROffset.baseR] = signedSrc2;
	break;
      default:
	break;
      }

      instState->setAddress(address, instState->getLoadStorePosition());
      instState->setData(data, instState->getLoadStorePosition());
      instState->setWriteInstInPacket(true);
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " store instruction: @" << address 
        << ": " << data << std::dec
        << " (" << " WRITE_WORD " << ")"
        << std::endl;
#endif
    }


    //
    // E2 phase
    // this phase is used to transmit the data_from_mem data to E2 phase 
    //

    // Load Byte From Memory With a 15-Bit Unsigned Constant Offset -- LDB (.unit) *+B14/B15[ucst15], dst -- .unit = .D2  pipeline phase E2
    void Tms320C6xIss::op_ldb_d_ldstOffset_02_e2(InstructionState * instState) {
      r_mem_req = true;
      r_mem_type = READ_BYTE;
      r_mem_addr = instState->getAddress(instState->getLoadStorePosition());
      r_mem_dest = instState->ins.d_ldstOffset.dst;
      r_mem_unsigned = false;
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex 
        << " load instruction request with @" << r_mem_addr << " is sent to memory "
        << std::dec << std::endl;
#endif
    }

    // Load Byte From Memory With a 15-Bit Unsigned Constant Offset -- LDBU (.unit) *+B14/B15[ucst15], dst -- .unit = .D2  pipeline phase E2
    void Tms320C6xIss::op_ldbu_d_ldstOffset_01_e2(InstructionState * instState) {
      r_mem_req = true;
      r_mem_type = READ_BYTE;
      r_mem_addr = instState->getAddress(instState->getLoadStorePosition());
      r_mem_dest = instState->ins.d_ldstOffset.dst;
      r_mem_unsigned = false;
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " load instruction request with @" << r_mem_addr << " is sent to memory "
        << std::dec << std::endl;
#endif
      }

    // Load Halfword From Memory With a 15-Bit Unsigned Constant Offset -- LDH (.unit) *+B14/B15[ucst15], dst  -- .unit = .D2  pipeline phase E2
    void Tms320C6xIss::op_ldh_d_ldstOffset_04_e2(InstructionState * instState) {
      r_mem_req = true;
      r_mem_type = READ_HALF;
      r_mem_addr = instState->getAddress(instState->getLoadStorePosition());
      r_mem_dest = instState->ins.d_ldstOffset.dst;
      r_mem_unsigned = false;
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " load instruction request with @" << r_mem_addr << " is sent to memory "
        << std::dec << std::endl;
#endif
    }

    // Load Halfword From Memory With a 15-Bit Unsigned Constant Offset -- LDHU (.unit) *+B14/B15[ucst15], dst  -- .unit = .D2  pipeline phase E2
    void Tms320C6xIss::op_ldhu_d_ldstOffset_00_e2(InstructionState * instState) {
      r_mem_req = true;
      r_mem_type = READ_HALF;
      r_mem_addr = instState->getAddress(instState->getLoadStorePosition());
      r_mem_dest = instState->ins.d_ldstOffset.dst;
      r_mem_unsigned = true;
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " load instruction request with @" << r_mem_addr << " is sent to memory "
        << std::dec << std::endl;
#endif
       }

    // Load Word From Memory With a 15-Bit Unsigned Constant Offset -- LDW (.unit) *+B14/B15[ucst15], dst  -- .unit = .D2  pipeline phase E2
    void Tms320C6xIss::op_ldw_d_ldstOffset_06_e2(InstructionState * instState) {
      r_mem_req = true;
      r_mem_type = READ_WORD;
      r_mem_addr = instState->getAddress(instState->getLoadStorePosition());
      r_mem_dest = instState->ins.d_ldstOffset.dst;
      r_mem_unsigned = false;
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " load instruction request with @" << r_mem_addr << " is sent to memory "
        << std::dec << std::endl;
#endif
    }

    // Store Byte to Memory With a 15-Bit Unsigned Constant Offset -- STB (.unit) src, *+B14/B15[ucst15] -- .unit = .D2  pipeline phase E2
    void Tms320C6xIss::op_stb_d_ldstOffset_03_e2(InstructionState * instState) {
      r_mem_req = true;
      r_mem_type = WRITE_BYTE;
      r_mem_addr = instState->getAddress(instState->getLoadStorePosition());
      r_mem_wdata = instState->getData(instState->getLoadStorePosition());
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " store instruction request with @" << r_mem_addr << " is sent to memory (data: " << r_mem_wdata << ")"
        << std::dec << std::endl;
#endif
    }

