TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
    // Store Halfword to Memory With a 15-Bit Unsigned Constant Offset -- STH (.unit) src, *+B14/B15[ucst15] -- .unit = .D2  pipeline phase E2
    void Tms320C6xIss::op_sth_d_ldstOffset_05_e2(InstructionState * instState) {
      r_mem_req = true;
      r_mem_type = WRITE_HALF;
      r_mem_addr = instState->getAddress(instState->getLoadStorePosition());
      r_mem_wdata = instState->getData(instState->getLoadStorePosition());
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " store instruction request with @" << r_mem_addr << " is sent to memory (data: " << r_mem_wdata << ")"
        << std::dec << std::endl;
#endif
       }

    // Store Word to Memory With a 15-Bit Unsigned Constant Offset -- STW (.unit) src, *+B14/B15[ucst15] -- .unit = .D2  pipeline phase E2
    void Tms320C6xIss::op_stw_d_ldstOffset_07_e2(InstructionState * instState) {
      r_mem_req = true;
      r_mem_type = WRITE_WORD;
      r_mem_addr = instState->getAddress(instState->getLoadStorePosition());
      r_mem_wdata = instState->getData(instState->getLoadStorePosition());
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " store instruction request with @" << r_mem_addr << " is sent to memory (data: " << r_mem_wdata << ")"
        << std::dec << std::endl;
#endif
    }

    // Load Byte From Memory With a 5-Bit Unsigned Constant Offset or Register Offset -- .unit = .D1 or .D2  pipeline phase E2
    // LDB (.unit) *+baseR[offsetR], dst or LDB (.unit) *+baseR[ucst5], dst
    void Tms320C6xIss::op_ldb_d_ldstBaseROffset_02_e2(InstructionState * instState) {
      r_mem_req = true;
      r_mem_type = READ_BYTE;
      r_mem_addr = instState->getAddress(instState->getLoadStorePosition());
      r_mem_dest = instState->ins.d_ldstBaseROffset.dst;
      r_mem_unsigned = false;
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " load instruction request with @" << r_mem_addr << " is sent to memory "
        << std::dec << std::endl;
#endif
    }

    // Load Halfword From Memory With a 5-Bit Unsigned Constant Offset or Register Offset
    // LDBU (.unit) *+baseR[offsetR], dst or LDBU (.unit) *+baseR[ucst5], dst
    void Tms320C6xIss::op_ldbu_d_ldstBaseROffset_01_e2(InstructionState * instState) {
      r_mem_req = true;
      r_mem_type = READ_HALF;
      r_mem_addr = instState->getAddress(instState->getLoadStorePosition());
      r_mem_dest = instState->ins.d_ldstBaseROffset.dst;
      r_mem_unsigned = false;
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " load instruction request with @" << r_mem_addr << " is sent to memory "
        << std::dec << std::endl;
#endif
    }

    // Load Halfword From Memory With a 5-Bit Unsigned Constant Offset or Register Offset -- .unit = .D1 or .D2  pipeline phase E2
    // LDH (.unit) *+baseR[offsetR], dst   LDH (.unit) *+baseR[ucst5], dst
    void Tms320C6xIss::op_ldh_d_ldstBaseROffset_04_e2(InstructionState * instState) {
      r_mem_req = true;
      r_mem_type = READ_HALF;
      r_mem_addr = instState->getAddress(instState->getLoadStorePosition());
      r_mem_dest = instState->ins.d_ldstBaseROffset.dst;
      r_mem_unsigned = false;
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " load instruction request with @" << r_mem_addr << " is sent to memory "
        << std::dec << std::endl;
#endif
    }

    // Load Halfword From Memory With a 5-Bit Unsigned Constant Offset or Register Offset -- .unit = .D1 or .D2  pipeline phase E2
    // LDHU (.unit) *+baseR[offsetR], dst   LDHU (.unit) *+baseR[ucst5], dst
    void Tms320C6xIss::op_ldhu_d_ldstBaseROffset_00_e2(InstructionState * instState) {
      r_mem_req = true;
      r_mem_type = READ_HALF;
      r_mem_addr = instState->getAddress(instState->getLoadStorePosition());
      r_mem_dest = instState->ins.d_ldstBaseROffset.dst;
      r_mem_unsigned = false;
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " load instruction request with @" << r_mem_addr << " is sent to memory "
        << std::dec << std::endl;
#endif
    }

    // Load Word From Memory With a 5-Bit Unsigned Constant Offset or Register Offset -- .unit = .D1 or .D2  pipeline phase E2
    // LDW (.unit) *+baseR[offsetR], dst    -- LDW (.unit) *+baseR[ucst5], dst
    void Tms320C6xIss::op_ldw_d_ldstBaseROffset_06_e2(InstructionState * instState) {
      r_mem_req = true;
      r_mem_type = READ_WORD;
      r_mem_addr = instState->getAddress(instState->getLoadStorePosition());
      r_mem_dest = instState->ins.d_ldstBaseROffset.dst;
      r_mem_unsigned = true;
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " load instruction request with @" << r_mem_addr << " is sent to memory "
        << std::dec << std::endl;
#endif
    }

    // Store Byte to Memory With a 5-Bit Unsigned Constant Offset or Register Offset -- .unit = .D1 or .D2  pipeline phase E2
    // STB (.unit) src, *+baseR[offsetR] -- STB (.unit) src, *+baseR[ucst5]
    void Tms320C6xIss::op_stb_d_ldstBaseROffset_03_e2(InstructionState * instState) {
      r_mem_req = true;
      r_mem_type = WRITE_BYTE;
      r_mem_addr = instState->getAddress(instState->getLoadStorePosition());
      r_mem_wdata = instState->getData(instState->getLoadStorePosition());
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " store instruction request with @" << r_mem_addr << " is sent to memory (data: " << r_mem_wdata << ")"
        << std::dec << std::endl;
#endif
    }

    // Store Halfword to Memory With a 5-Bit Unsigned Constant Offset or Register Offset  -- .unit = .D1 or .D2  pipeline phase E2 
    // STH (.unit) src, *+baseR[offsetR] -- STH (.unit) src, *+baseR[ucst5]
    void Tms320C6xIss::op_sth_d_ldstBaseROffset_05_e2(InstructionState * instState) {
      r_mem_req = true;
      r_mem_type = WRITE_HALF;
      r_mem_addr = instState->getAddress(instState->getLoadStorePosition());
      r_mem_wdata = instState->getData(instState->getLoadStorePosition());
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " store instruction request with @" << r_mem_addr << " is sent to memory (data: " << r_mem_wdata << ")"
        << std::dec << std::endl;
#endif
    }

    // Store Word to Memory With a 5-Bit Unsigned Constant Offset or Register Offset  -- .unit = .D1 or .D2  pipeline phase E2
    // STW (.unit) src, *+baseR[offsetR]  -- STW (.unit) src, *+baseR[ucst5]
    void Tms320C6xIss::op_stw_d_ldstBaseROffset_07_e2(InstructionState * instState) {
      r_mem_req = true;
      r_mem_type = WRITE_WORD;
      r_mem_addr = instState->getAddress(instState->getLoadStorePosition());
      r_mem_wdata = instState->getData(instState->getLoadStorePosition());
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " store instruction request with @" << r_mem_addr << " is sent to memory (data: " << r_mem_wdata << ")"
        << std::dec << std::endl;
#endif
    }


    //
    // E3 phase
    //

    // Load Byte From Memory With a 15-Bit Constant Offset -- LDB (.unit) *+B14/B15[ucst15], dst -- .unit = .D2  pipeline phase E3
    void Tms320C6xIss::op_ldb_d_ldstOffset_02_e3(InstructionState * instState) {
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " value read at @" << instState->getAddress(instState->getLoadStorePosition()) << "(" <<data_from_mem << ")"
        << std::dec << std::endl;
#endif
    data_from_mem_e3[instState->getLoadStorePosition()] = data_from_mem;
    }

    // Load Byte From Memory With a 15-Bit Unsigned Constant Offset -- LDBU (.unit) *+B14/B15[ucst15], dst -- .unit = .D2  pipeline phase E3
    void Tms320C6xIss::op_ldbu_d_ldstOffset_01_e3(InstructionState * instState) {
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " value read at @" << instState->getAddress(instState->getLoadStorePosition()) << "(" <<data_from_mem << ")"
        << std::dec << std::endl;
#endif
    data_from_mem_e3[instState->getLoadStorePosition()] = data_from_mem;
    }

    // Load Halfword From Memory With a 15-Bit Constant Offset -- LDH (.unit) *+B14/B15[ucst15], dst  -- .unit = .D2  pipeline phase E3
    void Tms320C6xIss::op_ldh_d_ldstOffset_04_e3(InstructionState * instState) {
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " value read at @" << instState->getAddress(instState->getLoadStorePosition()) << "(" <<data_from_mem << ")"
        << std::dec << std::endl;
#endif
    data_from_mem_e3[instState->getLoadStorePosition()] = data_from_mem;
    }

