TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
    // Load Halfword From Memory With a 15-Bit Unsigned Constant Offset -- LDHU (.unit) *+B14/B15[ucst15], dst  -- .unit = .D2  pipeline phase E3
    void Tms320C6xIss::op_ldhu_d_ldstOffset_00_e3(InstructionState * instState) {
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " value read at @" << instState->getAddress(instState->getLoadStorePosition()) << "(" <<data_from_mem << ")"
        << std::dec << std::endl;
#endif
    data_from_mem_e3[instState->getLoadStorePosition()] = data_from_mem;
    }

    // Load Word From Memory With a 15-Bit Unsigned Offset -- LDW (.unit) *+B14/B15[ucst15], dst  -- .unit = .D2  pipeline phase E3
    void Tms320C6xIss::op_ldw_d_ldstOffset_06_e3(InstructionState * instState) {
#if TMS320C62_DEBUG
      std::cout
        << m_name << std::hex
        << " value read at @" << instState->getAddress(instState->getLoadStorePosition()) << "(" <<data_from_mem << ")"
        << std::dec << std::endl;
#endif
    data_from_mem_e3[instState->getLoadStorePosition()] = data_from_mem;
    }

    // Store Byte to Memory With a 15-Bit Unsigned Constant Offset -- STB (.unit) src, *+B14/B15[ucst15] -- .unit = .D2  pipeline phase E3
    void Tms320C6xIss::op_stb_d_ldstOffset_03_e3(InstructionState * instState) {
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " value read at @" << instState->getAddress(instState->getLoadStorePosition()) << "(" <<data_from_mem << ")"
        << std::endl;
#endif
    }

    // Store Halfword to Memory With a 15-Bit Unsigned Constant Offset -- STH (.unit) src, *+B14/B15[ucst15] -- .unit = .D2  pipeline phase E3
    void Tms320C6xIss::op_sth_d_ldstOffset_05_e3(InstructionState * instState) {
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " value read at @" << instState->getAddress(instState->getLoadStorePosition()) << "(" <<data_from_mem << ")"
        << std::dec << std::endl;
#endif
    }

    // Store Word to Memory With a 15-Bit Unsigned Constant Offset -- STW (.unit) src, *+B14/B15[ucst15] -- .unit = .D2  pipeline phase E3
    void Tms320C6xIss::op_stw_d_ldstOffset_07_e3(InstructionState * instState) {
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " value stored in memory : " << instState->getData(instState->getLoadStorePosition())
        << std::dec << std::endl;
#endif
    }

    // Load Byte From Memory With a 5-Bit Unsigned Constant Offset or Register Offset -- .unit = .D1 or .D2  pipeline phase E3
    // LDB (.unit) *+baseR[offsetR], dst or LDB (.unit) *+baseR[ucst5], dst
    void Tms320C6xIss::op_ldb_d_ldstBaseROffset_02_e3(InstructionState * instState) {
#if TMS320C62_DEBUG
      std::cout
        << m_name << std::hex
        << " value read at @" << instState->getAddress(instState->getLoadStorePosition()) << "(" <<data_from_mem << ")"
        << std::dec << std::endl;
#endif
    data_from_mem_e3[instState->getLoadStorePosition()] = data_from_mem;
    }
    
    // Load Halfword From Memory With a 5-Bit Unsigned Constant Offset or Register Offset  -- .unit = .D1 or .D2  pipeline phase E3
    // LDBU (.unit) *+baseR[offsetR], dst or LDBU (.unit) *+baseR[ucst5], dst
    void Tms320C6xIss::op_ldbu_d_ldstBaseROffset_01_e3(InstructionState * instState) {
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " value read at @" << instState->getAddress(instState->getLoadStorePosition()) << "(" <<data_from_mem << ")"
        << std::dec << std::endl;
#endif
    data_from_mem_e3[instState->getLoadStorePosition()] = data_from_mem;
    }

    // Load Halfword From Memory With a 5-Bit Unsigned Constant Offset or Register Offset -- .unit = .D1 or .D2  pipeline phase E3
    // LDH (.unit) *+baseR[offsetR], dst   LDH (.unit) *+baseR[ucst5], dst
    void Tms320C6xIss::op_ldh_d_ldstBaseROffset_04_e3(InstructionState * instState) {
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " value read at @" << instState->getAddress(instState->getLoadStorePosition()) << "(" <<data_from_mem << ")"
        << std::dec << std::endl;
#endif
    data_from_mem_e3[instState->getLoadStorePosition()] = data_from_mem;
    }

    // Load Halfword From Memory With a 5-Bit Unsigned Constant Offset or Register Offset -- .unit = .D1 or .D2  pipeline phase E3
    // LDHU (.unit) *+baseR[offsetR], dst   LDHU (.unit) *+baseR[ucst5], dst
    void Tms320C6xIss::op_ldhu_d_ldstBaseROffset_00_e3(InstructionState * instState) {
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " value read at @" << instState->getAddress(instState->getLoadStorePosition()) << "(" <<data_from_mem << ")"
        << std::dec << std::endl;
#endif
    data_from_mem_e3[instState->getLoadStorePosition()] = data_from_mem;
    }

    // Load Word From Memory With a 5-Bit Unsigned Constant Offset or Register Offset -- .unit = .D1 or .D2  pipeline phase E3
    // LDW (.unit) *+baseR[offsetR], dst    -- LDW (.unit) *+baseR[ucst5], dst
    void Tms320C6xIss::op_ldw_d_ldstBaseROffset_06_e3(InstructionState * instState) {
#if TMS320C62_DEBUG
     std::cout
       << m_name << std::hex
       << " value read at @" << instState->getAddress(instState->getLoadStorePosition()) << "(" <<data_from_mem << ")"
       << std::dec << std::endl;
#endif
    data_from_mem_e3[instState->getLoadStorePosition()] = data_from_mem;
    }

    // Store Byte to Memory With a 5-Bit Unsigned Constant Offset or Register Offset -- .unit = .D1 or .D2  pipeline phase E3
    // STB (.unit) src, *+baseR[offsetR] -- STB (.unit) src, *+baseR[ucst5]
    void Tms320C6xIss::op_stb_d_ldstBaseROffset_03_e3(InstructionState * instState) {
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " value stored in memory : " << instState->getData(instState->getLoadStorePosition())
        << std::dec << std::endl;
#endif
    }

    // Store Halfword to Memory With a 5-Bit Unsigned Constant Offset or Register Offset  -- .unit = .D1 or .D2  pipeline phase E3
    // STH (.unit) src, *+baseR[offsetR] -- STH (.unit) src, *+baseR[ucst5]
    void Tms320C6xIss::op_sth_d_ldstBaseROffset_05_e3(InstructionState * instState) {
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " value stored in memory : " << instState->getData(instState->getLoadStorePosition())
        << std::dec << std::endl;
#endif
    }

