TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
    // Store Word to Memory With a 5-Bit Unsigned Constant Offset or Register Offset  -- .unit = .D1 or .D2  pipeline phase E3
    // STW (.unit) src, *+baseR[offsetR]  -- STW (.unit) src, *+baseR[ucst5]
    void Tms320C6xIss::op_stw_d_ldstBaseROffset_07_e3(InstructionState * instState) {
#if TMS320C62_DEBUG
    std::cout
        << m_name << std::hex
        << " value stored in memory : " << instState->getData(instState->getLoadStorePosition())
        << std::dec << std::endl;
#endif
    }


    //
    // E4 phase
    //

    // Load Byte From Memory With a 15-Bit Constant Offset -- LDB (.unit) *+B14/B15[ucst15], dst -- .unit = .D2  pipeline phase E4
    void Tms320C6xIss::op_ldb_d_ldstOffset_02_e4(InstructionState * instState) {
      instState->setData(data_from_mem_e3[instState->getLoadStorePosition()], instState->getLoadStorePosition());
#if TMS320C62_DEBUG
	std::cout
	  << m_name << std::hex
	  << " value received at CPU boundary: "  << data_from_mem_e3[instState->getLoadStorePosition()] << std::dec 
	  << std::endl;
#endif
    }

    // Load Byte From Memory With a 15-Bit Unsigned Constant Offset -- LDBU (.unit) *+B14/B15[ucst15], dst -- .unit = .D2  pipeline phase E4
    void Tms320C6xIss::op_ldbu_d_ldstOffset_01_e4(InstructionState * instState) {
      instState->setData(data_from_mem_e3[instState->getLoadStorePosition()], instState->getLoadStorePosition());
#if TMS320C62_DEBUG
	std::cout
	  << m_name << std::hex
	  << " value received at CPU boundary: "  << data_from_mem_e3[instState->getLoadStorePosition()] << std::dec 
	  << std::endl;
#endif
    }

    // Load Halfword From Memory With a 15-Bit Constant Offset -- LDH (.unit) *+B14/B15[ucst15], dst  -- .unit = .D2  pipeline phase E4
    void Tms320C6xIss::op_ldh_d_ldstOffset_04_e4(InstructionState * instState) {
      instState->setData(data_from_mem_e3[instState->getLoadStorePosition()], instState->getLoadStorePosition());
#if TMS320C62_DEBUG
	std::cout
	  << m_name << std::hex
	  << " value received at CPU boundary: "  << data_from_mem_e3[instState->getLoadStorePosition()] << std::dec 
	  << std::endl;
#endif
    }

    // Load Halfword From Memory With a 15-Bit Unsigned Constant Offset -- LDHU (.unit) *+B14/B15[ucst15], dst  -- .unit = .D2  pipeline phase E4
    void Tms320C6xIss::op_ldhu_d_ldstOffset_00_e4(InstructionState * instState) {
      instState->setData(data_from_mem_e3[instState->getLoadStorePosition()], instState->getLoadStorePosition());
#if TMS320C62_DEBUG
	std::cout
	  << m_name << std::hex
	  << " value received at CPU boundary: "  << data_from_mem_e3[instState->getLoadStorePosition()] << std::dec 
	  << std::endl;
#endif
    }

    // Load Word From Memory With a 15-Bit Unsigned Offset -- LDW (.unit) *+B14/B15[ucst15], dst  -- .unit = .D2  pipeline phase E4
    void Tms320C6xIss::op_ldw_d_ldstOffset_06_e4(InstructionState * instState) {
      instState->setData(data_from_mem_e3[instState->getLoadStorePosition()], instState->getLoadStorePosition());
#if TMS320C62_DEBUG
	std::cout
	  << m_name << std::hex
	  << " value received at CPU boundary: "  << data_from_mem_e3[instState->getLoadStorePosition()] << std::dec 
	  << std::endl;
#endif
    }

    // Store Byte to Memory With a 15-Bit Unsigned Constant Offset -- STB (.unit) src, *+B14/B15[ucst15] -- .unit = .D2  pipeline phase E4
    void Tms320C6xIss::op_stb_d_ldstOffset_03_e4(InstructionState * instState) {
    }

    // Store Halfword to Memory With a 15-Bit Unsigned Constant Offset -- STH (.unit) src, *+B14/B15[ucst15] -- .unit = .D2  pipeline phase E4
    void Tms320C6xIss::op_sth_d_ldstOffset_05_e4(InstructionState * instState) {
    }

    // Store Word to Memory With a 15-Bit Unsigned Constant Offset -- STW (.unit) src, *+B14/B15[ucst15] -- .unit = .D2  pipeline phase E4
    void Tms320C6xIss::op_stw_d_ldstOffset_07_e4(InstructionState * instState) {
    }

    // Load Byte From Memory With a 5-Bit Unsigned Constant Offset or Register Offset -- .unit = .D1 or .D2  pipeline phase E4
    // LDB (.unit) *+baseR[offsetR], dst or LDB (.unit) *+baseR[ucst5], dst
    void Tms320C6xIss::op_ldb_d_ldstBaseROffset_02_e4(InstructionState * instState) {
      instState->setData(data_from_mem_e3[instState->getLoadStorePosition()], instState->getLoadStorePosition());
#if TMS320C62_DEBUG
	std::cout
	  << m_name << std::hex
	  << " value received at CPU boundary: "  << data_from_mem_e3[instState->getLoadStorePosition()] << std::dec 
	  << std::endl;
#endif
    }
    
    // Load Halfword From Memory With a 5-Bit Unsigned Constant Offset or Register Offset  -- .unit = .D1 or .D2  pipeline phase E4
    // LDBU (.unit) *+baseR[offsetR], dst or LDBU (.unit) *+baseR[ucst5], dst
    void Tms320C6xIss::op_ldbu_d_ldstBaseROffset_01_e4(InstructionState * instState) {
      instState->setData(data_from_mem_e3[instState->getLoadStorePosition()], instState->getLoadStorePosition());
#if TMS320C62_DEBUG
	std::cout
	  << m_name << std::hex
	  << " value received at CPU boundary: "  << data_from_mem_e3[instState->getLoadStorePosition()] << std::dec 
	  << std::endl;
#endif
    }

    // Load Halfword From Memory With a 5-Bit Unsigned Constant Offset or Register Offset -- .unit = .D1 or .D2  pipeline phase E4
    // LDH (.unit) *+baseR[offsetR], dst   LDH (.unit) *+baseR[ucst5], dst
    void Tms320C6xIss::op_ldh_d_ldstBaseROffset_04_e4(InstructionState * instState) {
      instState->setData(data_from_mem_e3[instState->getLoadStorePosition()], instState->getLoadStorePosition());
#if TMS320C62_DEBUG
	std::cout
	  << m_name << std::hex
	  << " value received at CPU boundary: "  << data_from_mem_e3[instState->getLoadStorePosition()] << std::dec 
	  << std::endl;
#endif
    }

    // Load Halfword From Memory With a 5-Bit Unsigned Constant Offset or Register Offset -- .unit = .D1 or .D2  pipeline phase E4
    // LDHU (.unit) *+baseR[offsetR], dst   LDHU (.unit) *+baseR[ucst5], dst
    void Tms320C6xIss::op_ldhu_d_ldstBaseROffset_00_e4(InstructionState * instState) {
      instState->setData(data_from_mem_e3[instState->getLoadStorePosition()], instState->getLoadStorePosition());
#if TMS320C62_DEBUG
	std::cout
	  << m_name << std::hex
	  << " value received at CPU boundary: "  << data_from_mem_e3[instState->getLoadStorePosition()] << std::dec 
	  << std::endl;
#endif
    }

    // Load Word From Memory With a 5-Bit Unsigned Constant Offset or Register Offset -- .unit = .D1 or .D2  pipeline phase E4
    // LDW (.unit) *+baseR[offsetR], dst    -- LDW (.unit) *+baseR[ucst5], dst
    void Tms320C6xIss::op_ldw_d_ldstBaseROffset_06_e4(InstructionState * instState) {
      instState->setData(data_from_mem_e3[instState->getLoadStorePosition()], instState->getLoadStorePosition());
#if TMS320C62_DEBUG
	std::cout
	  << m_name << std::hex
	  << " value received at CPU boundary: "  << data_from_mem_e3[instState->getLoadStorePosition()] << std::dec 
	  << std::endl;
#endif
    }

    // Store Byte to Memory With a 5-Bit Unsigned Constant Offset or Register Offset -- .unit = .D1 or .D2  pipeline phase E4
    // STB (.unit) src, *+baseR[offsetR] -- STB (.unit) src, *+baseR[ucst5]
    void Tms320C6xIss::op_stb_d_ldstBaseROffset_03_e4(InstructionState * instState) {
    }

    // Store Halfword to Memory With a 5-Bit Unsigned Constant Offset or Register Offset  -- .unit = .D1 or .D2  pipeline phase E4
    // STH (.unit) src, *+baseR[offsetR] -- STH (.unit) src, *+baseR[ucst5]
    void Tms320C6xIss::op_sth_d_ldstBaseROffset_05_e4(InstructionState * instState) {
    }

    // Store Word to Memory With a 5-Bit Unsigned Constant Offset or Register Offset  -- .unit = .D1 or .D2  pipeline phase E4
    // STW (.unit) src, *+baseR[offsetR]  -- STW (.unit) src, *+baseR[ucst5]
    void Tms320C6xIss::op_stw_d_ldstBaseROffset_07_e4(InstructionState * instState) {
    }


    //
    // E5 phase
    //

    // Load Byte From Memory With a 15-Bit Unsigned Constant Offset -- LDB (.unit) *+B14/B15[ucst15], dst -- .unit = .D2  pipeline phase E5
    void Tms320C6xIss::op_ldb_d_ldstOffset_02_e5(InstructionState * instState) {
      if (!registerUpdatePostponed) {
	state.regfile_temp[instState->ins.d_ldstOffset.s][instState->ins.d_ldstOffset.dst] = instState->getData(instState->getLoadStorePosition());
#if TMS320C62_DEBUG
	std::cout
	  << m_name << std::hex
	  << " value " << instState->getData(instState->getLoadStorePosition()) << std::dec << " is written to ";
	if (!instState->ins.d_ldstOffset.s)
	  std::cout << " bank A" ;
	else std::cout << " bank B";
	std::cout << " register " << instState->ins.d_ldstOffset.dst << std::endl;
#endif
      }
      else Tms320C6xIss::registerToBeUpdateLater(instState->ins.d_ldstOffset.s,instState->ins.d_ldstOffset.dst,instState->getData(instState->getLoadStorePosition()));
    }

    // Load Byte From Memory With a 15-Bit Unsigned Constant Offset -- LDBU (.unit) *+B14/B15[ucst15], dst -- .unit = .D2  pipeline phase E5
    void Tms320C6xIss::op_ldbu_d_ldstOffset_01_e5(InstructionState * instState) {
      if (!registerUpdatePostponed) {
	state.regfile_temp[instState->ins.d_ldstOffset.s][instState->ins.d_ldstOffset.dst] = instState->getData(instState->getLoadStorePosition()); 
#if TMS320C62_DEBUG
	std::cout
	  << m_name << std::hex
	  << " value " << instState->getData(instState->getLoadStorePosition()) << std::dec << " is written to ";
	if (!instState->ins.d_ldstOffset.s)
	  std::cout << " bank A" ;
	else std::cout << " bank B";
	std::cout << " register " << instState->ins.d_ldstOffset.dst << std::endl;
#endif
      }
      else Tms320C6xIss::registerToBeUpdateLater(instState->ins.d_ldstOffset.s,instState->ins.d_ldstOffset.dst,instState->getData(instState->getLoadStorePosition()));
    }

    // Load Halfword From Memory With a 15-Bit Unsigned Constant Offset -- LDH (.unit) *+B14/B15[ucst15], dst  -- .unit = .D2  pipeline phase E5
    void Tms320C6xIss::op_ldh_d_ldstOffset_04_e5(InstructionState * instState) {
      if (!registerUpdatePostponed) {
	state.regfile_temp[instState->ins.d_ldstOffset.s][instState->ins.d_ldstOffset.dst] = instState->getData(instState->getLoadStorePosition());
#if TMS320C62_DEBUG
	std::cout
	  << m_name << std::hex
	  << " value " << instState->getData(instState->getLoadStorePosition()) << std::dec << " is written to ";
	if (!instState->ins.d_ldstOffset.s)
	  std::cout << " bank A" ;
	else std::cout << " bank B";
	std::cout << " register " << instState->ins.d_ldstOffset.dst << std::endl;
#endif
      }
      else Tms320C6xIss::registerToBeUpdateLater(instState->ins.d_ldstOffset.s,instState->ins.d_ldstOffset.dst,instState->getData(instState->getLoadStorePosition()));
    }

    // Load Halfword From Memory With a 15-Bit Unsigned Constant Offset -- LDHU (.unit) *+B14/B15[ucst15], dst  -- .unit = .D2  pipeline phase E5
    void Tms320C6xIss::op_ldhu_d_ldstOffset_00_e5(InstructionState * instState) {
      if (!registerUpdatePostponed) {
	state.regfile_temp[instState->ins.d_ldstOffset.s][instState->ins.d_ldstOffset.dst] = instState->getData(instState->getLoadStorePosition());
#if TMS320C62_DEBUG
	std::cout
	  << m_name << std::hex
	  << " value " << instState->getData(instState->getLoadStorePosition()) << std::dec << " is written to ";
	if (!instState->ins.d_ldstBaseROffset.s)
	  std::cout << " bank A" ;
	else std::cout << " bank B";
	std::cout << " register " << instState->ins.d_ldstBaseROffset.dst << std::endl;
#endif
      }
      else Tms320C6xIss::registerToBeUpdateLater(instState->ins.d_ldstOffset.s,instState->ins.d_ldstOffset.dst,instState->getData(instState->getLoadStorePosition()));
    }

    // Load Word From Memory With a 15-Bit Unsigned Constant Offset -- LDW (.unit) *+B14/B15[ucst15], dst  -- .unit = .D2  pipeline phase E5
    void Tms320C6xIss::op_ldw_d_ldstOffset_06_e5(InstructionState * instState) {
      if (!registerUpdatePostponed) {
	state.regfile_temp[instState->ins.d_ldstOffset.s][instState->ins.d_ldstOffset.dst] = instState->getData(instState->getLoadStorePosition());
#if TMS320C62_DEBUG
	std::cout
	  << m_name << std::hex
	  << " value " << instState->getData(instState->getLoadStorePosition()) << std::dec << " is written to ";
	if (!instState->ins.d_ldstBaseROffset.s)
	  std::cout << " bank A" ;
	else std::cout << " bank B";
	std::cout << " register " << instState->ins.d_ldstBaseROffset.dst << std::endl;
#endif 
      }
      else Tms320C6xIss::registerToBeUpdateLater(instState->ins.d_ldstOffset.s,instState->ins.d_ldstOffset.dst,instState->getData(instState->getLoadStorePosition()));
    }

    // Load Byte From Memory With a 5-Bit Unsigned Constant Offset or Register Offset -- .unit = .D1 or .D2  pipeline phase E5
    // LDB (.unit) *+baseR[offsetR], dst or LDB (.unit) *+baseR[ucst5], dst
    void Tms320C6xIss::op_ldb_d_ldstBaseROffset_02_e5(InstructionState * instState) {
     if (!registerUpdatePostponed) {
       state.regfile_temp[instState->ins.d_ldstBaseROffset.s][instState->ins.d_ldstBaseROffset.dst] = instState->getData(instState->getLoadStorePosition());
#if TMS320C62_DEBUG
       std::cout
	 << m_name << std::hex
	 << " value " << instState->getData(instState->getLoadStorePosition()) << std::dec << " is written to ";
       if (!instState->ins.d_ldstBaseROffset.s)
	 std::cout << " bank A" ;
       else std::cout << " bank B";
       std::cout << " register " << instState->ins.d_ldstBaseROffset.dst << std::endl;
#endif 
     }
     else Tms320C6xIss::registerToBeUpdateLater(instState->ins.d_ldstBaseROffset.s,instState->ins.d_ldstBaseROffset.dst,instState->getData(instState->getLoadStorePosition()));
    }

    // Load Halfword From Memory With a 5-Bit Unsigned Constant Offset or Register Offset
    // LDBU (.unit) *+baseR[offsetR], dst or LDBU (.unit) *+baseR[ucst5], dst
    void Tms320C6xIss::op_ldbu_d_ldstBaseROffset_01_e5(InstructionState * instState) {
     if (!registerUpdatePostponed) {
       state.regfile_temp[instState->ins.d_ldstBaseROffset.s][instState->ins.d_ldstBaseROffset.dst] = instState->getData(instState->getLoadStorePosition());
#if TMS320C62_DEBUG
       std::cout
	 << m_name << std::hex
	 << " value " << instState->getData(instState->getLoadStorePosition()) << std::dec << " is written to ";
       if (!instState->ins.d_ldstBaseROffset.s)
	 std::cout << " bank A" ;
       else std::cout << " bank B";
       std::cout << " register " << instState->ins.d_ldstBaseROffset.dst << std::endl;
#endif 
     }
     else Tms320C6xIss::registerToBeUpdateLater(instState->ins.d_ldstBaseROffset.s,instState->ins.d_ldstBaseROffset.dst,instState->getData(instState->getLoadStorePosition()));
    }

