TakuKitamura/ttool-fstar/MPSoC/soclib/soclib/iss/tms320c6x/src/iss/tms320c62_instructions.cpp
    // Load Halfword From Memory With a 5-Bit Unsigned Constant Offset or Register Offset -- .unit = .D1 or .D2  pipeline phase E5
    // LDH (.unit) *+baseR[offsetR], dst   LDH (.unit) *+baseR[ucst5], dst
    void Tms320C6xIss::op_ldh_d_ldstBaseROffset_04_e5(InstructionState * instState) {
     if (!registerUpdatePostponed) {
       state.regfile_temp[instState->ins.d_ldstBaseROffset.s][instState->ins.d_ldstBaseROffset.dst] = instState->getData(instState->getLoadStorePosition());
#if TMS320C62_DEBUG
       std::cout
	 << m_name << std::hex
	 << " value " << instState->getData(instState->getLoadStorePosition()) << std::dec << " is written to ";
       if (!instState->ins.d_ldstBaseROffset.s)
	 std::cout << " bank A" ;
       else std::cout << " bank B";
       std::cout << " register " << instState->ins.d_ldstBaseROffset.dst << std::endl;
#endif 
     }
     else Tms320C6xIss::registerToBeUpdateLater(instState->ins.d_ldstBaseROffset.s,instState->ins.d_ldstBaseROffset.dst,instState->getData(instState->getLoadStorePosition()));
    }

    // Load Halfword From Memory With a 5-Bit Unsigned Constant Offset or Register Offset -- .unit = .D1 or .D2  pipeline phase E1
    // LDHU (.unit) *+baseR[offsetR], dst   LDHU (.unit) *+baseR[ucst5], dst
    void Tms320C6xIss::op_ldhu_d_ldstBaseROffset_00_e5(InstructionState * instState) {
     if (!registerUpdatePostponed) {
       state.regfile_temp[instState->ins.d_ldstBaseROffset.s][instState->ins.d_ldstBaseROffset.dst] = instState->getData(instState->getLoadStorePosition());
#if TMS320C62_DEBUG
       std::cout
	 << m_name << std::hex
	 << " value " << instState->getData(instState->getLoadStorePosition()) << std::dec << " is written to ";
       if (!instState->ins.d_ldstBaseROffset.s)
	 std::cout << " bank A" ;
       else std::cout << " bank B";
       std::cout << " register " << instState->ins.d_ldstBaseROffset.dst << std::endl;    
#endif  
     }
     else Tms320C6xIss::registerToBeUpdateLater(instState->ins.d_ldstBaseROffset.s,instState->ins.d_ldstBaseROffset.dst,instState->getData(instState->getLoadStorePosition()));
    }

    // Load Word From Memory With a 5-Bit Unsigned Constant Offset or Register Offset -- .unit = .D1 or .D2  pipeline phase E1
    // LDW (.unit) *+baseR[offsetR], dst    -- LDW (.unit) *+baseR[ucst5], dst
    void Tms320C6xIss::op_ldw_d_ldstBaseROffset_06_e5(InstructionState * instState) {
     if (!registerUpdatePostponed) {
       state.regfile_temp[instState->ins.d_ldstBaseROffset.s][instState->ins.d_ldstBaseROffset.dst] = instState->getData(instState->getLoadStorePosition());
#if TMS320C62_DEBUG
       std::cout
	 << m_name << std::hex
	 << " value " << instState->getData(instState->getLoadStorePosition()) << std::dec << " is written to ";
       if (!instState->ins.d_ldstBaseROffset.s)
	 std::cout << " bank A" ;
       else std::cout << " bank B";
       std::cout << " register " << instState->ins.d_ldstBaseROffset.dst << std::endl;    
#endif    
     }
     else Tms320C6xIss::registerToBeUpdateLater(instState->ins.d_ldstBaseROffset.s,instState->ins.d_ldstBaseROffset.dst,instState->getData(instState->getLoadStorePosition()));
    }


    void Tms320C6xIss::op_nothing_to_be_done(InstructionState * instState) {    }
    

    void Tms320C6xIss::op_illegal_d_e1(InstructionState * instState) {
      std::cerr << "Warning: unknown instruction with opcode "<< std::hex << instState->ins.d.op << std::dec 
		<< " in .D unit in E1 pipeline phase @ " << m_exec_cycles <<  " cycle, instruction is " 
		<< std::hex << instState->ins.ins
		<< " PC is " << state.DCE1.getPC() << std::dec << std::endl;
    }
	}}

      
// Local Variables:
// tab-width: 4
// c-basic-offset: 4
// c-file-offsets:((innamespace . 0)(inline-open . 0))
// indent-tabs-mode: nil
// End:

// vim: filetype=cpp:expandtab:shiftwidth=4:tabstop=4:softtabstop=4
 
